"""
平水词林韵列表集。
汉字的平仄类别：定义平声为 1，上声为 2，去声为 3，入声为 4
平水、词林韵部按实际划分决定。
命名按照小鹤双拼加数字命名。
列表内容为：字、声调、平水韵部、词林韵部，平水韵四部总编号
"""

ds1 = [
    """㒥㓽㕬㖓㙹㚅㚇㜴㝘㝟㝫㠉㠓㢥㣝㦀㦕㩚㭜㯶㰍㳘㴦㵯㸗㹣㼧㼿䀄䁓䂫䃧䆍䆚䈵䉺䍶䏊䑃䒠䕺䖝䙦䞑䟥䡫䡯䤓䤝䥂䧆䧷䧺䪊䪦䫹䮵䮾䰒䱰䱵䲨䴀䴶䴿䵄䵆丛东中
丰仜仝仹侗倥倲偑僮僼充公冡冯冲凨凬凮功勭匆匑匔厐叢叿同咙哃哄哅嗡嘃嚨囪囱囲埄埪埬堫堸塜塳夢夣妅娀娂娻宆宫宮寷屸峒峝崆崇崈崠崧嵏嵕嵡嵩嵷嵸嶐巃
巄工幊幪庞弓徖忠忡忩怱总恫悤悾惾愡愩憽懜懞懵戎拢捴揔搃摓摠攏攻昽晍曈曚曧曨朡朣朦朧杛東枫柊栊桐梦棇棕椶楓楤樋樥樬樷橦檒檧檬櫳欉毧氃氋汎汷沖沣
沨泈泷洚洪浲浺涳涷渢渱湰溕滝漋漎漗漨漴潀潂潨潼濍濛瀜瀧灃灇灴烔烘烽烿焢焧焪熊熋熍熜熢熥燑燪爖爜爞犝狨狪猔猣猦獞獴玒玜珑珫璁瓏瓨疘疯痋痌瘋癃盅
眮瞢瞳矇矒砻硹硿碂碽礱礲种秱稯穜穷穹空窮窿竆童竼笼筒筩箜篊篢篭篵篷籠粠粡糼糿紅終絧絨総緫緵縂總繱纄红终绒罞罿羢翀翁翪聋聡聦聪聰聾肜胧膧艂艐艟
艨芃芎茏茙茸茺茼荭菄菘菶葒葓葱葻葼蒙蓊蓪蓬蔠蔥蕫蕯藂藭蘢蘴虫虹蚣蜙蝀蝬螉融螎螽蟲蠓蠪衕衷襱訌詷讧谼谾豅豐豵赨躬躳逄通逢鄷鄸酆酮釭鉷銅錝鍐鍯鎓
鏓鑁鑝鑨铜闂隆雄雺霟霳靀靇靊韸韼風飌风餇饛馮駥騘騣驄骢髳髼鬉鬔鬷魟鮦鯟鯮鯼鲖鴤鴻鵼鶇鶲鸏鸗鸫鸿鹟鹲麷鼨龎龐龓𠀝𠁦𠁧𠂂𠑽𠔈𠔾𠤊𠤰𠪷𡁏𡃡𡚑𡞧𡟟𡠙
𡺺𡿂𢁠𢂔𢃐𢄟𢈉𢊕𢏕𢐔𢓣𢔅𢖄𢖷𢛔𢛙𢝈𢞏𢤄𢤲𢥞𢦦𢨱𢫨𢬀𢷙𢸭𢽦𣋶𣌾𣐯𣑸𣚜𣫣𣮪𣯐𣻢𤄏𤄓𤢶𤯚𤲚𤷆𤾬𥄁𥉕𥍺𥑳𥑿𥓻𥨪𥩌𥫂𥫯𥬪𥭥𥲆𥳌𥵫𥷈𥷜𥸉𥸲𦄜𦆟𦇱𦊽𦏆𦏺𦔸
𦕠𦗜𦝰𦞨𦨴𦪪𦫰𦬕𦱇𦵡𦿏𧆉𧆼𧊕𧌆𧌢𧍰𧍸𧎡𧐬𧓏𧓕𧘏𧙥𧚋𧚐𧚬𧛹𧞑𧞞𧠊𧭊𧯾𧰯𧲍𧳆𧴂𧼓𧾳𨀜𨀯𨂴𨇘𨊧𨋝𨋷𨍈𨍉𨎳𨏠𨚯𨛱𨜺𨝭𨝯𨞫𨠤𨡮𨢊𨢠𨣘𨱸𨲰𨴛𨺡𨺢𨼿𨾊𨿢𩄖
𩄦𩄺𩅉𩍅𩐛𩐠𩑓𩒼𩓅𩔚𩖛𩗄𩘵𩙐𩙣𩜍𩜖𩞉𩟞𩟭𩣳𩥃𩦺𩨯𩮀𩯍𩻡𩿅𪀚𪀭𪎽𪔍𪔣𪚓㒶㓚㓛㕼㠦㠮㣉㣭㤝㥖㨑㮬㲁㳞㺋䅝䆔䆪䈡䈦䈺䐋䓗䗓䘪䝉䝦䩺䯷䰤䰸䲲""",
    1,
    1,
    1,
    1,
]

ds2 = [
    """㐫㚵㛔㝐㠽㡣㣑㣠㤏㧭㫒㬝㮪㲨㷭㹐㺎㼸㽫䂈䂥䃔䅃䅊䆹䇀䇯䈶䊄䌬䗤䗥䘬䠜䡆䡥䡴䢉䢼䤊䥢䩼䰌䳉䳋䳍䳯䳷䶱丰从伀佟佣供侬倧倯傛傭儂兇共农冬冲凇凶刣匈
卭吽呍咚哝喁嗈噥噰堼墉壅夆妐妦婃媀媶嫆嫞孮宗容封峯峰崶嵱幒庝庸庺廱彤彸従從徸忪忷恟恭悰慒慵憃憧憹捀搈摏摓昸暰松枀枞柗桏桻梥榕榵槦樅橦檂欁汹沖
洶浓浲浵淙淞溶滽漨澭濃灉炂炵烽熔熧牅犎琮瑢瑽痈痋癕癰盽眬瞛矓磫禯禺秾穁穠竜笗笻笼筇篈篭籠籦綘緃緟縙縦縫縱纵缝胷胸脓膿臃舂舼艟苁苳茏茸葑蓉蓯蕹
蕽蘢蚒蚣蛩蛬蜂蜙蝩螤蠭衝衳褈褣襛訩詾誴譨讻賨賩赨跫踨踪蹖蹤蹱躘農辳逢邕邛郺鄘醲重鈡鉖鉵銎銿鋒鍶鍾鎔鏞鏠鏦鏧鐘鑫钟锋锶锺镕镛隀雍雝顒颙饔騌驡骔
髶髸鬃鬆鬞鰫鱅鳙鷛鸗鼕齈龍龏龒龔龙龚𠆌𠔙𠕌𠛀𠝤𠟍𠷸𠹅𡊼𡕖𢃏𢃭𢓘𢓱𢔋𢔩𢢓𢧳𢪋𣪯𣯨𣵞𤅐𤖀𤛑𤤑𤤶𤱨𥂒𥍮𥎂𥓰𥗦𥛝𥡬𥧱𥪻𥬆𥳎𦃽𦉂𦙄𦟛𦤘𦨰𦪽𦬘𦭭𧋒𧋚𧌝𧎣
𧐍𧑆𧗕𧘂𧘮𧝎𧝸𧲤𧲴𧴄𧴗𧺣𧿖𨈮𨉴𨉷𨌰𨑊𨑪𨒀𨒱𨙔𨜳𨠌𨤩𨥍𨱛𨱿𨲟𨲳𨳁𨳗𩂓𩂽𩅽𩇔𩌠𩌨𩍉𩍓𩑗𩔔𩘎𩙘𩙠𩞋𩟷𩢽𩤛𩥫𩬛𩬰𩮠𪀛𪃾𪄉𪄻𪅖𪆯𪒒𪒬𪔳𪔷𪖁𪚑𪚝𪚠㐯㓙㙡
㜂㜉㜡㞱㟾㢕㫡㫪㮤㲇㳟㶻㸼㻾㿈䀱䂌䇗䐫䗦䗬䗸䙂䝑䡮䢨䣏䧡䯳""",
    1,
    2,
    1,
    2,
]

jl3 = [
    """㕠㟅㟌㤶㼻䁸䃥䄝䉘䉶䎫䓼䚎䚒䚗䜫䜶䝄䤸䭚䵨佭刅厐厖双哝哤啌噇噥囪囱垹堫夅娏孇尨峕幢庞庬悾愯憃憹扛掆摃摐撞杠枞栙桩梆椌槓樁樅橦欆江泷洚浝涳淙滝
漎瀧牎牕牻狵玒玜瑽瓨痝矼窓窗窻缸罁羫肛胦腔膧舡舽艭茳蛖訌譨讧谾豇跫跭逄邦邫釭鏦降雙駹騌骔鬃魟鸏鹲龎龐𠌴𠲑𡆪𢁏𢥠𢭎𣫝𣻛𤝷𤢐𤭬𤰅𤱵𤵸𤵻𥆙𥍷𥎋𥎒𥡟
𥬮𦔛𦗳𦦗𧄐𧔧𧕟𧘍𧜧𧢆𧬧𧱡𨇯𨦱𨪒𩆿𩐨𩒿𩞆𩟊𩣼𩩝𩪘𩭒𩽧𪁪𪐿𪔔㒕㧿㼹㾤䆫䢶䧏䨇""",
    1,
    3,
    2,
    3,
]

vi4 = [
    """㐌㒧㒿㓟㔣㔭㔻㕒㕧㖇㖢㖷㘂㘹㙓㚝㚦㚸㛓㜷㝖㞴㞾㞿㟚㠜㠿㢑㣍㤵㥎㥓㦾㧫㨳㩻㩼㩽㩾㫅㬐㬢㮃㮕㮛㮰㯄㯅㯦㰎㰕㰘㰚㰻㱦㲠㳽㴲㶟㷢㷰㸏㹎㹫㺇㺈㺔㺣㺨㺿
㻟㼢㽡㾨䀵䂣䄜䄬䅑䅗䅲䅻䆅䇁䇪䇫䈕䈘䉲䉻䊍䊚䊳䋥䋩䌕䌤䌳䍋䍘䍦䎟䎠䎱䐅䐖䑊䑴䓜䓡䓺䔆䔟䔮䕤䕫䕳䕷䕻䖒䖪䖽䖿䗐䘒䙙䙰䙹䙾䚿䛂䛐䛴䜅䜔䝚䝝䝷䞅䞚
䞾䟚䟸䡋䢫䣡䣫䣽䥯䥴䥸䧅䧝䧦䧳䧴䧶䨏䩓䩟䪎䪧䪹䫋䫏䫑䫠䬁䬐䬜䬮䭣䭨䭶䭼䮈䮊䮔䯱䰇䱈䱌䱘䲑䲩䲬䲹䲿䳄䳠䳡䳢䳫䴊䴢䴻䴽䵹䶔䶞䶴䶵丌丕丝为丽乁之书
乿亀亏亓仔仪仳伊伎伓伾侇侕倁倕倛倠倭偨偲僖僛儀儿児兒其兹冝凘凞凥刕剂剓剘剞剤剺劑劘劙匙匜医卑卮危厓厘厜厮厶台司吚吱吹呞呢呰呲呸咦咨咿哸唯唲啙
嗞嗤嗺嘻噅噕噫嚟嚱圌圯坘坨坮坯坻垂垐垒埀埘埤基埼堳塒墀墮壀壘壝壨夂夊夔夶夷奇奞她妛妫妮委姕姨姬姼姿娞娭娸娺婎婑婯媊媐媤媯媸嫘嫛嫠嫢嬀嬉嬨孋孖
孜孳孶孷宐宜宧寅寪寲尸尼居屍屔岐岯峏峓峗崎崕崖崥嵋嵫嵯嵳嶷巇巙差巵巸师師帷庳廝廲弥彌彛彜彝彞彨彲彽徛徥忯怌思怟怡怩怶恑恖恞悂悘悲惟惢愢愭慈戂
戏戣戯戱戲扅扺披抳抷抾拸持掑推提搋搘摛摫撝擟攗攠攡支攲敧敮斉斯施旇旑旖旗时旹時暆暿曦書朇朞期杒杘枇枝枱柂柅柌栀栘栥栭栺桋桘桤桵桸梔梕梨梩梸棃
棊棋椅椎椑椔椝椸楑楒楣榯榰榱榹榿槌槜槣槻槼樆檇檱檹櫀欈欐欙欹欺歧殦毉比毗毘毞氂氏汖池汥汦沘沩沶治泀泜洈洏洟洢浉浬浽涯淄淇湄湤湷湽溈溡溮滋滖漄
漓漦漪潍潙澌澬濉濝濨濰瀰灕炊炋為焁焈焷煕熈熙熪熹熺燍燨爔爢爲牺犁犂犄犛犠犤犧犪狉狋狏狓狮狸猈猉猍猕猗猚猸獅獼玆玼珁珆琍琟琦琪琵瑂瑡璂璃璾瓃瓍
瓕瓵瓷瓻甀甆甤甾畸疑疧疲疵疷痍痴痿癡皮眉眙眭眱眵睂睝睢瞝瞡瞦瞴矀矖知碁碑碕磁磃礠祁祇祎祗祠祬祺禆禌禔禕禗禠禥禧离私秓秖秛秜秠秪秶移稘稦稵穲窥
窺竒竾笞筂筛筣箄箈箎箕箠箷篃篅篩篪篱篺簁簃簊簛簰籬籭籾粚粢粸糜糦糸紎紕累絁絫絲絺綏綥綦綨維緇緌緦縒縭縲縻繥纍纗纚纝纟纰绥维缁缌缡缧罙罢罳罴罷
罹羁羆羇羈羛羠羲羸翍耆而耏耔耚耛聏肌肢肶胂胑胔胝胰胹脂脪脽脾腄腗腝膍臸艃芓芕芝芪苤苼茈茊茌茨茬茲荋荎荠荲荽荾菑菞菭萁萆萎萑萓萕葘葰葵葹葿蒒蓍
蓠蓰蓶蓷蔂蔩蕤蕬蕲薋薺藄藣蘄蘪蘲蘳蘷蘺蘼虁虆虒虧虮虵虽蚍蚑蚔蚩蚭蚳蚽蚾蛇蛜蛦蛳蜊蜘蜝蜞蜤蜱蜲螄螔螭螷蟍蟕蟖蟣蟴蟸蠀蠝蠡蠫蠯蠵衪衰衹衼袘被袲袻
裨裭褫褵褷襹覉覊規覗覣覹规觜觭觯觶觹觺觽觿訑訵訾訿詒詖詞詩誃誒誰誺諀諅諆諮諰謘謧謻譆譩讉词诐诒诗诶谁谘豼豾貍貔貤貲貽貾資賫賷贻赀资赍赼赿趀趍
趑趦跂跜跠跢踑踟踦躨躸軝輀輜輺轙轜辎辝辞辤辭迆迟迡迤迱迻追逵逶遀遅遗遟遲遺邳邿郦郪郫郿鄈鄑鄬鄿酈酏酾醀醚醨醫醾醿釃釄釐鈈鈚鈭鈶鈹鉟鉹銔鋖鋫錃
錅錍錐錘錙錡錤鍉鍦鍨鍿鎚鎡鏔鏫鐁鑗鑴钚铍锜锤锥锱镃镾闚阰阺陂陏陑陭陲陴隋随隓隦隨隭隳隵隹雌雖離鞖頄頉頤頥頯頾頿顀顊颐颸飔飢飴飺餈饎饥饴馗馳馶
駍駓騅騎騏騤騦騩騹驪驰骊骐骑骓骙骴髊髬髭髵鬐鬶鬹鬾魌魑魮魳魾鮍鮞鮧鮨鯔鯕鯬鰣鰤鰦鰭鲏鲕鲥鲯鲻鳍鳲鳷鳺鳾鴜鴟鴯鴲鴺鵄鵧鵯鵸鵹鵻鶀鶅鶗鶙鶥鶳鶿鷀
鷥鸃鸍鸓鸝鸤鸱鸶鸸鹂鹎鹚鹛麊麋麎麒麗麾黐黟黧黴鼅鼒鼭鼶鼺齊齍齎齐齜齝齹龇龜龟龡𠀢𠀮𠁭𠁴𠁼𠂹𠃼𠄒𠄱𠅌𠆂𠌱𠍫𠏩𠐾𠒆𠓤𠓪𠔋𠔛𠔶𠔸𠖓𠗺𠚽𠛃𠛘𠞧𠠍𠡄𠤗
𠥊𠨌𠨸𠩗𠩺𠪃𠪗𠭰𠯂𠰅𠴩𠵬𠷇𠹦𠻗𠼝𠽬𠾆𠾋𡀗𡃸𡄵𡉪𡊝𡍮𡎍𡒾𡓰𡖾𡗈𡙛𡙭𡚼𡛡𡜬𡝓𡠋𡡒𡺔𡺸𡻣𢀡𢁂𢁒𢂒𢃛𢄡𢇲𢇳𢈡𢊀𢊄𢊘𢋼𢌈𢌳𢎈𢏒𢓖𢓡𢔊𢖅𢛥𢛮𢜽𢞗𢟢𢡴𢣳𢤂
𢩼𢫴𢮚𢱆𢳀𢴱𢶴𢹍𢺷𢺿𢻂𢻚𢻪𢻫𢻹𢼉𢾦𢾪𢾱𣁒𣂖𣇳𣎮𣏚𣐃𣐑𣐓𣐵𣓋𣔬𣖰𣘬𣙼𣚀𣚁𣚄𣚎𣜁𣟵𣟸𣢁𣢂𣢋𣢑𣢞𣢭𣢷𣣊𣣷𣤘𣤴𣥨𣨫𣬈𣬉𣬘𣬼𣮄𣮉𣯆𣯤𣳩𣸘𣹡𤃪𤅤𤆾𤇴𤈔𤎱
𤖪𤗫𤘊𤘌𤘢𤘹𤙵𤚤𤜖𤝻𤠠𤪌𤬘𤮎𤯖𤱍𤲸𤵋𤷍𤸬𤹌𤹸𤺀𤼘𤼜𤽁𤿎𤿐𤿾𥀖𥁇𥄶𥄻𥄿𥅡𥅵𥇚𥈻𥊈𥋟𥌟𥌰𥍋𥍔𥐀𥓓𥕶𥚉𥜰𥝑𥝮𥠱𥤻𥦣𥫶𥫽𥭘𥯡𥯨𥰭𥲧𥲪𥳳𥴺𥵨𥶓𥶻𥹄𥹆𥹋
𥺡𥻍𥻿𥼅𥼝𥼩𥼻𥽰𥾣𥿆𦃇𦃋𦄐𦆤𦇲𦇵𦉈𦊁𦌭𦍧𦏤𦏸𦐉𦑡𦑺𦓓𦓽𦔂𦔌𦖊𦖺𦗕𦙆𦚟𦝢𦞟𦞲𦟧𦡫𦣝𦩖𦭲𦮺𦯛𦯫𦱰𦳈𦳚𦴀𦵭𦸷𦹽𦺱𦻃𦼻𦽕𧀗𧄚𧅯𧉅𧋎𧋗𧌔𧌞𧍜𧍥𧎨𧎪𧐉𧐌
𧑇𧑜𧓎𧓑𧓗𧔥𧕓𧕮𧕯𧖕𧙈𧚩𧛏𧛺𧜂𧜚𧞓𧞸𧠜𧡇𧡦𧡺𧢦𧣤𧣬𧥕𧥤𧦧𧦭𧧺𧩚𧩹𧪡𧪫𧫠𧫬𧭟𧮒𧮛𧯯𧱒𧲈𧲘𧲺𧳁𧳏𧳞𧳼𧴁𧷱𧹌𧹛𧼘𧼠𧿞𨀥𨃯𨅤𨆋𨇎𨈚𨉭𨋦𨌌𨍢𨒬𨒮𨙸𨚖𨛯
𨜽𨝏𨝖𨝳𨟾𨠐𨠶𨢮𨣬𨤫𨧦𨨲𨪌𨱜𨲐𨳷𨴓𨵎𨸒𨻀𨾚𨾡𨾦𨾻𨿭𩀣𩀶𩁌𩃃𩄚𩅰𩆂𩆵𩉋𩉬𩌝𩍲𩏣𩒂𩓠𩓧𩓸𩔦𩔹𩖹𩖾𩗰𩙇𩚇𩚉𩚯𩛮𩜊𩠯𩣚𩤖𩥂𩥐𩥬𩨝𩪀𩫫𩭇𩭦𩰴𩱄𩱊𩲪𩳣𩳩
𩴞𩵉𩶅𩶪𩷾𩸢𩸨𩹍𩻟𩼨𩽨𩿥𪀓𪀔𪁐𪁚𪂅𪄯𪅆𪅵𪅾𪆁𪆗𪆳𪆴𪊕𪋇𪌈𪌱𪌹𪎫𪎭𪎮𪏐𪏼𪑿𪒔𪓻𪓿𪕈𪕊𪕨𪖂𪗉𪗋𪗐𪗪𪘬𪙉㒋㗓㗪㚀㜯㞢㠌㠼㣦㨢㩬㫷㮅㰞㰨㱆㲍㲤㴯㶊㶨
㸟㺰㽄㽔㽧㽻㿲㿳䂀䂓䅔䊷䎩䓋䟀䡳䣎䤈䧌䨨䩭䫢䮆䲉䲭䴧䶆乊""",
    1,
    4,
    3,
    4,
]

ww5 = [
    """㙎㙨㚻㛄㟓㟪㣲㥋㫎㫵㳖㹷䇵䈈䉠䓅䙟䟇䥩䧇䩁䬠亴依俙僟几刉刏厞叽唏喡嘰囗围圍圻埼奜妃威婓婔媁媈媙屄岓岿巋巍希帏帰幃幑幾归微徽悕扉挥揮旂晖晞暉机
椲楎楲機欷歸毴沂浠涠淝渄湋溦溰潿瀈灳烯煇犩狶猆玂玑琋璣畿疿痱癓皈睎矀矶碕磯祈禈禨稀緋绯翚翬耭肥肵腓莃菲葳薇蘬虮蚚蜚蜰蝛蟣蟦衣袆裶褘覹誹譏譩讥
诽豨輝辉违違郗郼鍏鐖闈闱隇霏霺非靟鞿韋韦頎颀飛飝飞餥饑饥馡騑騛騩鬿魕鯡鰄鰴鲱鵗𠂣𠄿𠥎𠨚𠲻𠶨𡇦𡘡𡚈𢆻𢑮𢞉𢣉𢩡𢾁𣄓𣐿𣫪𤓚𤟤𤢀𤳥𤷂𤾈𥇖𥇳𥍁𥭬𥳏𥼘𦠄
𦤇𦱷𦺬𧗒𧗼𧝕𧰙𧻶𨵈𨸔𨻒𩇫𩇯𩇽𩋾𩎵𩏉𩏏𩒽𩙲𩜆𩦋𩦎𩹉𩹥𩼌𪁹𪅹𪏏𪙧㠻㡬㩣㱕㵟㹆㼄䒾䖷䢜䪰""",
    1,
    5,
    3,
    5,
]

yu6 = [
    """㞐㠠㡹㣄㥠㭕㭬㯉㯫㱺㶆㶛㺞㻬㽰㾒䁩䂛䆽䊰䋈䍱䏣䏸䐗䐳䒧䓚䔡䕡䗨䘫䝣䟊䟽䠧䢸䣰䬔䮉䰕䰻䱉䱬䱷䳜与且书予于亐伃伹佉余佢侞俆偦储儲凃凥初刞劯匷呿咀
唹嘘噓坥墟如妤娪婮嬩居屠岨崌帤庐廬徐慮憈懙扵抾拠挐捈捒捓据揟摅摴攄於旟曥書桇梳椐楈榈槠樗橥櫖櫚櫧櫫欤歔歟沮洳涂涺淤淭渔渠湑滁漁潴瀦爈狙狳猪玙
琚瑹璖璩璵璷畬畭畲疋疎疏疽瘀砠硢磲祛稌筎筡箊篨籅籧糈紓紶綀縃纾耝耡胠胥胪腒臚舁舆與舒艅苴茹菃菹葅蒘蒢蒣蔬蕏蕖蕠藇藘藷藸蘧虑虗虚虛蚷蛆蜍蜛蝑蝫
螶蟝蠩衙袪袽裾誉諝諸謯譽诸谞豠豦豬趄踈躇車輋輿轝车邚郚醵鉏鋙鋤鐻铻锄閭闾阹除雎雓雤餘馀馿驉驢驴魖魚魼鮽鯺鱋鱼鴑鴡鴽鵌鵨鶋鷠鸒麆齬龉𠁉𠍲𠎳𠙴𠧰
𠫎𠿝𡁎𡂊𡄲𡡥𡻌𢊧𢎖𢎻𢔪𢣻𢦌𢨁𢬱𢴮𢹏𣅤𣖪𣖹𣦡𣭠𣰡𤁵𤕟𤙟𤟠𤡣𤥽𤨎𤱐𤴙𥀵𥕰𥝨𥞚𥬔𥱂𥳕𥶆𥷔𥿇𦄽𦋯𦌿𦕙𦪡𦯣𦱅𦶕𦺗𦺪𦼫𦿀𧊟𧌋𧐅𧓻𧕎𧗎𧝔𧞏𧰇𧲵𧾚𨇖𨌎𨎶𨐣𨚴
𨛭𨛮𨝈𨞙𨶢𨼋𨼫𨼽𩋵𩟳𩤺𩥭𩦡𩰠𩴀𩺰𩼪𪁲𪂓𪅰𪆂𪆫𪆷𪇝𪊻𪋏𪋑𪋮𪌆𪍸𪙳㝒㠊㧧䃴䅕䈌䈝䋒䋡䝻䡤䣷䥚䧾䪶""",
    1,
    6,
    4,
    6,
]

yu7 = [
    """㐡㔧㕊㕑㖩㗅㗙㚉㚢㚥㜹㝼㟺㠸㡏㡡㢏㢳㤤㥚㥥㧣㪀㪭㪺㫙㬂㬰㭔㭰㭸㯛㱠㲎㲘㳛㷒㷻㹳㺏㺮㻀㻌㻍㻯㼋㼶㽳㾰㿖䂂䄨䅳䅷䇬䈬䈻䉉䉑䉿䊀䊿䋧䋶䍂䍢䎁䒀䓊䔕
䖘䛕䜽䝒䞕䞤䟞䠒䡍䢐䢓䣄䣚䣯䦜䧢䩒䩣䩱䩴䫓䫱䭅䭌䭍䮏䰧䰭䰰䵶䵾乌乎于亐伕伖伮侏俘俞俱倶僫儒兪冔凃凫刍刳劬匍区區卢厨句吁吳吴吾呉呋呕呜呱呼咕咮
哌唔啚喁喖喣喩喻嗚嘑嘔嘟噁嚅嚧囌図图圖圗圩圬垀垆垺堣堬塗墲墿壚壶壷壺夫奴妋姁姇姑姝娄娐娛娪娯娱娵婁媀媩媭媰嫫嫴嬃嬬孚孤孥孵孺尃屠岖岣岴峬峹峿
崳嵎嵞嶀嶇巫帑幁幠幮庩庯廔廚廜弙弧彋徂徒忂怃怤恗恶悪惡愈愉愚慺憮懦懧懯戵扜扝扵扶抅抭拘挎捄捈捗揄摸摹攎救敷敺斪於旉无旴晇晡曘朐朱杅杇杸枎枢枯
枸枹柎柧柨栌株桍桙桴梌梧楜楡楰榆榑樞模橅橭橱橾檡櫉櫥櫨櫯欋欔欨歈歍歑殂殊殍殳毋母毹毺氀氁氍汙汚污沽泒泘泭泸洖洙洿浯涂淲渝渪湖湡溇滹漊潳澞濡瀘
灈炉烏無燸爐牏牾犓狐猢獳獹玈玗玞玸珠珸瑚瑜瑦瑹璑璷瓐瓠瓳瓿甦畉疞痀痡瘉瘏瘘瘺瘻癒癯盂盓盧盱眗睮瞜瞴瞿矑砆砮硃祦祩禂禑禺租秼稃稌稣穌穻窏窬竽笟
符笯筟箁箍箛箶篐籚粗粰糊糐糢紆紑紨絇絑綒緅緰繻纑纡罏罛罦羭翑翵聥肤胊胍胕胡腢腴膚膜膢膴臑臞臾舖舗舻艫芋芌芙芜芦芻苏苸苻苽茣茰茱荂荴荹荼莁莆莩
莵菇菟菩菰萭萮萸葄葋葡葫蒌蒤蒩蒭蒱蒲蓃蔞蕍蕦蕪薷蘆蘇蘓蘛虍虖虞虶蚨蛄蛛蛷蜅蜈蝓蝡蝴螐螸蠕蠦蠷蠼衚衢衧衭袧袾裯褕襦覦觎觕觚訏誅誈誣誧諏諛謣謨謩
謼譃譕诛诬诹谀谟豠豧貗貙趋趍趎趣趨趺跍跔跗跦跿踙踰蹰躕躣躯軀軗軤軥軱軲輸轤轱轳轷输辜迂迃逋途逜逾邘邞邭邾郀郙郚郛都鄃鄜酑酤酥酴酺醏醐醹釪釫鈇
鈲鈷鈽銖鋘鋪鍝鍸鎢鏤鑐鑪鑺钨钴钸铢铺镂闍阇陎陓陠陬隃隅雏雐雛雩雽需須顬顱须颅颥颫餔餬馟駆駈駑駒駯駼騟騶驅驱驹驺驽骬骷髃髗鬍鬚魱魲鮈鮕鮢鮬鯂鯃
鯆鰅鰞鰸鱬鱸鲈鳧鳬鳺鴝鴣鴮鴸鵌鵏鵐鵵鶘鶦鶵鷋鷜鷡鷵鸆鸕鸜鸪鸬鸲鹀鹕麁麄麆麌麤麩麬麱麸黸鼄鼩鼯齬齵龉𠒍𠕮𠘧𠙎𠝳𠞆𠟺𠣪𠣰𠤦𠧀𠬣𠴱𠴾𠷞𠻚𠻬𠽿𠾫𠿘𡇩
𡍐𡏪𡗵𡘛𡚾𡜵𡝉𡠜𡠞𡡓𢁢𢃀𢄼𢉢𢋅𢋹𢌄𢎵𢏆𢏯𢑹𢓲𢔢𢖳𢗲𢜯𢞦𢡇𢬾𢰆𢸫𢼹𢾄𢾭𣀐𣄟𣆵𣈥𣑿𣘧𣙶𣚏𣚐𣛫𣞒𣟒𣡾𣢒𣥳𣩷𣯸𣰋𣰠𣰻𣰿𣻜𣽈𣽉𣿆𤇠𤕘𤗬𤙛𤚅𤚉𤚎𤜹𤝘𤝹𤥮
𤬛𤭑𤭱𤮧𤰑𤱽𤵡𤹪𤼀𤿚𥁡𥂤𥃔𥄑𥅗𥈈𥈏𥕻𥗫𥘮𥛂𥤨𥪀𥭠𥯮𥰪𥱀𥱻𥲐𥳉𥳓𥳗𥶜𥻞𥼼𥿍𦀣𦄼𦅏𦇁𦈣𦊬𦋆𦌬𦏻𦐛𦐣𦑹𦓔𦓕𦔬𦘴𦙋𦙶𦚈𦜛𦤂𦥁𦧘𦧙𦨳𦩞𦮑𦰲𦱃𦱄𦲰𦳓𦳾𦴉
𦶀𦷳𦺟𦺠𦺥𦼇𦽏𦿊𧀮𧀴𧃠𧄒𧆓𧆜𧆣𧆹𧆻𧇄𧇛𧇡𧈯𧊠𧍪𧍵𧑕𧔖𧙆𧙶𧛞𧠩𧥱𧦝𧧶𧪮𧬕𧲕𧳎𧵞𧷿𧻷𧼜𧾱𧾶𨁏𨁺𨄅𨅑𨊱𨑒𨖛𨛥𨞻𨠋𨢢𨢬𨬕𨬗𨰸𨱱𨴩𨵦𨸯𨼊𨿏𩁹𩂉𩂧𩉿𩊣𩑕
𩑶𩒇𩒧𩒾𩓖𩓣𩖬𩚩𩝷𩡃𩢪𩢳𩢶𩢻𩥽𩦢𩧘𩨗𩨙𩪍𩬙𩰯𩱍𩲵𩳅𩳌𩳨𩵅𩵩𩶈𩶉𩶭𩺼𩻚𩿧𪀊𪁖𪃍𪃎𪄊𪄝𪊐𪏻𪏿𪑄𪕉𪕮𪕱𪙃㓬㢝㣘㦆㦵㩤㭪㮧㰭㲗㸖㸡㼡䃿䄮䆰䇓䇕䉐䊸䎍
䎔䏏䐻䓏䓵䖉䖚䞛䞮䣿䧸䩲䮃䮒䰅䰑䱐䴣䴸""",
    1,
    7,
    4,
    7,
]

qi8 = [
    """㓾㔒㖒㙠㜎㡗㡙㣆㣢㦒㨒㩗㩦㯕㰀㴝㼰㽯䀘䄢䄺䅠䉫䍕䐡䔣䔧䔶䘽䙵䚣䚷䛏䛱䤍䨑䪢䫣䬫䬾䭫䮘䯓䱱䵩䶒乩亝仾低倪偍傒儶儿児兒兮凄刕刲卟卥厗呧啙啼嗁嗘嘶
圭坭埞埿堤奃奎奚妻婗媂媞嫛屔屖崥崹嵆嵇嵠嶲巂廲彽徆徯徲忚恓悽惿懠批折挤捿提携撕擕擠攜斉斊暌枅柢栖桋梋梐梨梯梸棃棲棿椑楏榽樨橀檕櫅殹氐泥淒淣渧
湀溪澌烓焍燍犀犁犂狴猊猰玭珪珶瑅瑿瓈瓗畦盠眭眱睳睼睽砒碮磃磇磎磾禔禵稊稽窐笄笓筓箆篦粞紪綈緀締緹繄纗绨缇缔罤羝聧肶胿脐腣膍臍臡艩茥荑萋蒵蒾蔾
蕛藈藜虀蛂蛴蜺蝭蝰螇螕蟸蠐蠡蠵袛袿褆西觬觹觽觿詆謑謕謧诋谿豀豍豯貎貕賫賷赍趆趧跻蹄蹊蹏躋輗迷遆邌邽郋郌郪郳酅醍醯釮銈銻錅錍鍗鍷鎞鏫鑇鑗鑙鑴锑
閨闺隄隮雞霋霓鞞鞮韲題题騠騱驨驪骊鬶鬹鮧鮭鮷鯢鯷鲑鲵鳀鳮鴺鵜鵹鶈鶏鶗鶙鷄鷈鷉鷖鷤鸂鸝鸡鹂鹈鹥麑麛麡黊黎黧黳鼙鼶鼷齊齌齎齏齐齑齯𠅚𠆵𠔍𠜱𠞄𠽰𡃷
𡄷𡇒𡌤𡏛𡐠𡗞𡗳𡛜𡿙𢗴𢟵𢠹𢡅𢥘𢯉𢰘𣅥𣕁𣖸𣘦𣚡𣢍𣢎𣤳𣫴𣸒𣹲𤋭𤗘𤗢𤚢𤛿𤝸𤟥𤟾𤠓𤣑𤥒𤦤𤬿𤭌𤭜𤮯𤮰𤲺𤳤𤶈𤺊𤼮𥉐𥉘𥌍𥌛𥏠𥕁𥝌𥶛𥺵𥾬𥿄𦀘𦆈𦋅𦎣𦓯𦦃𦩭𦮐𦱔𦺙
𦻀𧀠𧀰𧋉𧋘𧍝𧓉𧔩𧕉𧙣𧜤𧟃𧟼𧠟𧡨𧢧𧤃𧥖𧪷𧫦𧬊𧮼𧯗𧻝𧿝𨁃𨄛𨊻𨏳𨒲𨔛𨛫𨝟𨢥𨣾𨤽𨥦𨪉𨲋𨳻𨴼𨹶𨻕𨻼𨾴𩁟𩅖𩆲𩋣𩑾𩓂𩔢𩗫𩛑𩛶𩤽𩥯𩥴𩧋𩨒𩭧𩮵𩰳𩹵𩺫𪂿𪄆𪇈𪈥𪊧
𪋗𪌍𪑭𪓬𪓷𪖦𪗅𪗆𪗇𪗍𪗏𪛂㓳㔸㕃㛷㢴㫝㮷㰿㾷㿽䂑䃜䅅䐎䒊䖙䗗䚜䛊䝴䠁䧑䪡䪣䳶""",
    1,
    8,
    3,
    8,
]

ja9_1 = [
    """㔞㗨㜥㜳㠢㥟㦟㨙㨤㩄㪓㼮㾹䁲䃈䃶䍲䓱䔝䕸䙎䚑䠹䡡䡨䨪䯐䱝䳸䴜乖佳侪俳偕儕厓唻啀啡喈喍嘊埋堦夈娾媘崕崖崽差徍徘徥怀慀懐懷挨捚捱排掜揩搋摨擓斉斋
斎柴棑楷榸榽槐櫰歪涯淣淮湝溾瀤煯牌犤犲猅猈瑎痎皆睚祡秸稭竵筛箄篩篺簁簰籭縀腉膎膗荄薢薶蘹蝔螷蠯街褢褱誽諧諰谐豺輫釵钗阶階霾鞂鞋鞵骸鮭鲑鶛麡齊
齋齐齜龇龤𠁰𠛕𠦬𠵠𠷒𡇸𡺵𢋿𢓬𢔡𢖤𢛞𢠼𢰇𢶀𢾆𣅜𣝁𤜄𤭧𤻦𥐟𥱼𥷫𥻄𦂄𦈰𦝨𦩯𧱾𧳐𨌅𨤢𨵞𩋧𩍃𩑐𩑢𩓬𩘅𩝦𩤠𩱳𪊉𪘇𪘨𪚎㾩㾬䂷䓙䬩㪰㩺㗍""",
    1,
    9,
    5,
    9,
]

ja9_2 = ["""㰪䦱佳厓哇唲娃娲媧徍涯漄猚緺芆蛙蜗蝸靫騧鮭鲑鼃𠴺𦶎𩃐𩋘𪗹""", 1, 9, 10, 9]

hv10_1 = [
    """㒲㙜㙵㚊㜾㨟㬃㯁㱯㱾㷘㸀㾍䀭䅘䋱䐩䑓䚡䞗䠽䧒䪱䬵䯮䰄䱺䴭䶣侅來俫倈偲儓凒剀剴台呆咍咳哀哉唉唻啋囼坮垓埃壊奒姟婡嬯孡孩孻峐崃崍嵦庲开徕徠思愢懛
才抬挼揌擡敱敳斄旲晐材来栽梾棶檯欸毐毢毸涞淶渽溨溾災灾炱炲烖烗猍猜獃珆琜畡皑皚睵硙磑祴筙箂箈籉絯纔胎胲能腮臺苔荄莱菑菭萊葘薹裁該该豥財賅賌賳
财赅跆輫逨邰郂郲開陔隑頦顋颏颱駘騃騋骀鮐鯠鰓鲐鳃鶆麳𠳆𠹛𡒢𡙓𡿧𢎋𢑬𢦏𢦒𣐮𣔮𣖤𣢇𣣿𤡲𤢗𤦃𤲓𤸖𤸳𦈲𦓹𦞁𦩴𦪍𦬁𦳦𧉟𧊏𧪚𧭏𧯲𧯺𧳟𧵤𧻲𧽊𧽖𨴆𨸜𩌃𩠚𩪂𩬠
𩮖𩰶𩿡𪃄𪑚𪒴㢤㰧㰩㱼㶼㾂䠕䤤""",
    1,
    10,
    5,
    10,
]

hv10_2 = [
    """㙁㚰㛱㟝㟴㢈㵢㷇㷟㺳㾯㿉㿗䀃䊈䍙䍣䣙䤂䨓䫊佪偎傀催僓儡凗咴哸啡嗺囘回囬坆坏垖培堆塠塺墔壞妚媒尵崔崴嵟嵬巍廆廻廽弚彽徊徘恛恢悝愄慛抔拻捼推揋搥
摧擂攂敦晆杯枚柸栂桅桮梅棓椳楳槐槑槯樶橔檑櫆櫑毰洃洄渨湈漼灰烠烣焞煤煨煺熣燘燰玫珻瑰璝瓃瓌畾痐痦痽盃盔碨磓磪禖穨簂紑縗繢缋缞罍羧肧胚脄脢脧腜
膭苺茴荋莓葨蓷藬藱蘈虺蚘蛔蛕蜖螚衃裴裵詴詼誒謘讉诙诶豗賠赔蹪轠迴逥酶醅鋂錑鎚鏙鐜鐳鑘镭阢阫陪陫陮隈隗隤雷霉靁鞼頧頹頺頽顝颓魁魋鮠鮰鰃鳂鴭鸓鼿
𠂤𠑛𠦗𡃩𡈶𡏩𡜥𢄊𢈹𢉭𢕘𢟋𢟴𣀀𣖱𣡧𣬆𣯱𤕚𤗏𤗯𤗴𤛍𤜡𤤷𤧫𤬃𤬭𤮚𤮸𤳳𤳴𤵛𤵮𤷎𤸉𤹵𥃌𥑵𥼂𦈧𦈶𦉎𦙂𦭹𦸏𦸪𧒜𧚷𧛚𧝋𧞭𧧆𧮓𧴥𧼬𧽠𨄍𨌴𨓿𨛬𨞽𨠥𨡌𨲪𨻃𨻵𩈜𩎜𩘺
𩢱𩨽𩮴𩲅𩴻𩵣𪀬𪂜𪃏𪈑𪌤𪑀𪖕㕍㜠㞀㞜㮎㻁䂙䋿䖶䙑䜃䝅䝇䭔""",
    1,
    10,
    3,
    10,
]

vf11 = [
    """㑗㔂㕙㖘㘦㙬㚬㛙㛛㜪㝄㝇㝙㞶㟩㟭㡄㡒㥲㧢㨉㫳㭄㰋㰬㲀㵌㵮㻞㽦㾕䀼䁕䄄䅸䆣䇹䈁䋋䋸䐇䐜䑳䓐䔚䖜䖲䘩䙉䚬䝧䞭䟴䡅䡑䢅䢻䣅䣨䣩䥎䪸䮼䯂䰠䱯䳲亀亲人
仁份伦伸侁侲信倫偱傧僎儐兟冺凐勻匀厸呻咰唇嗔嗪嚚嚬囙囜因囩囵囷圁圇圳均垔垠堙堻塡填塵墐壣壿夋夤奫妽姄姰姺姻娠娦婣媇媋嫀嫃嫔嬪孞宒宸宾寅尘屒屯
屾岷峋峮峷峾崏嶙巡巾帪廵彬循忈忎忞忟忳怋恂慇憌扟抡抻抿振捘捪捵掄揗搷搸攽敃敐敒敯敶斌新斴旬旻旼旾昀春晨暋暙暽曟朲杊杶柛栒栕栶桭梹棆椕椿榛槆槇
槙槟樄樼橁檈檭檳櫄欭歅殝殥殷毥民氤汃汮沦泟泯泿洇津洵浱浾淪淳湣湮湻溱滣滨漘潧潾濒濱濵瀕瀙灥燊燐犉狋狺猌猵獜獱玟玢玭珅珉珍珎珒珢珣珳琎琘琝瑃瑉
瑧瑸璌璘璡璸甄甐甡申甽畇畛疄痻皴盷盹盿眒眞真眴瞋瞤瞵矉矜矝砇砏碅碈碖磌磷礗礥神禋禛秂秦秵穦窀竣竴笢筃筠箘箟籈籶籸粦粼紃紉純紳絪綸緍緡緸縜繗繽
纫纯纶绅缗缤罠翷耣肫胂脣腀膞臣臻芢苠茞茵荀荺莀莘莙莼菌萅蒓蒖蓁蓴蔩蔯薪薲薼薽蘋蚐蛝蜠蜦螓螴螾蠙衠袀裀裑覠親訔訚訫訰訷詢詵誾諄論諲謓论诜询谆豳
貞貧賓賔贇贞贫赟踆踚身軙輑輪輴轃轔轮辚辛辰迍迧迿逡遵邠邻郇鄞鄰醇醕鈞鈱鉁銀銁銞鋆錀錉錞錱鍲鏔鏻鑌钧银镔閩閺閿闅闉闽阌阠阾陈陙陯陳陻隣霦鞇頵頻
顮顰频颦馪馴馻駗駨駪駰驎驞驯骃魜鯙鯩鰆鱗鳞鳼鴖鵢鶉鶞鷆鷏鷐鷷鹑麇麎麏麐麕麟齗龂龜龟𠃫𠄤𠐺𠔹𠔽𠖟𠚼𠛶𠣕𠣡𠭙𠸸𡇂𡇑𡇖𡇬𡈲𡉐𡋪𡓓𡖌𡖒𡖬𡗥𡛞𡼐𡿠𢆺𢈯
𢎭𢘊𢛕𢝯𢣐𢭧𢻸𣀍𣃄𣌚𣌠𣌨𣕍𣖼𣘘𣘣𣘲𣚆𣞟𣢏𣱈𣱜𤇜𤕊𤚨𤚩𤝚𤡳𤸅𤿟𥂵𥃰𥆣𥎊𥐩𥞁𥢮𥳱𥸬𥻋𥼭𥾡𦅑𦇖𦇘𦎣𦎧𦐹𦘔𦚏𦟘𦨆𦩏𦳜𦳣𦳳𦸯𦺷𦽖𧊭𧌙𧓪𧔪𧗁𧚉𧡘𧢹𧨡𧩬𧭹
𧮬𧱜𧲂𧷟𧸈𧽔𧾝𧾠𨀴𨏞𨐍𨐔𨐕𨐰𨑌𨛊𨞲𨬖𨸬𨿡𩀋𩉼𩞻𩤁𩰗𩴱𩺵𩻜𩿃𪀠𪀽𪁧𪂆𪂹𪇕𪋻𪔗𪙤𪙾𪛊㟗㡦㫩㯽㰉䃌䈯䊁䍰䎙䓰䘜䞺䠳䧣䧬䨈""",
    1,
    11,
    6,
    11,
]

wf12 = [
    """㚃㜏㥯㪊㮗㶏㷊㸮㹜㹞䉙䎹䒺䓄䖐䘇䢵䦩䩿䭽䰚䴦䵫云俽军分勋勛勤勲勳厪君员員嚑囩坟垠堇墳妏妘妡妢宭岎帉帬幩廑弅彣忻惞愪慇慬懃懄拚揾搵敃文斤斦斳昐
昕曛朌枌桾梤棻棼橒橨欣歏殷氛氲氳汶汾沄涢溳溵澐濆濦炆炘焄焚煇煴熅熉熏燌燓燻爋犾狺獯玟珳畃瘟瘽皲皸皹盺眃矄砇砏磤秎秐筋筠筼篔紋紛紜緼縕縜纁纭纷
纹缊羒羣群羵翂耘耺聞肦臐芠芬芸芹荕荤菦菫萉葐葷蒀蒑蒕蒶蒷蓳蔒蕓蕡蕲薫薰蘄蘍蚉蚊蚚蚠蝹螡蟁衯裙裠褞觔訚訜誾豮豶貟賁贠贲軍轒邤郧鄖鄞鄿醺釿鈖錀鍕
鐼閺閿闅闻阌隫雯雰雲餴饙馚馧馩馼魰魵鮶鲪鳻鳼鴍鴖麇麏麕黂鼖鼢鼤齦龈𠑰𠛸𡺕𢁥𢴢𣀄𣂗𣂜𣘝𣜺𣬩𣯻𣱦𤖘𤗸𤛭𤵒𥎊𥠺𥳡𦌺𦍪𦐈𦔐𦦑𧖁𧥼𧬞𧮱𧰣𧶊𧷐𧿚𨍆𨎾𨛡𨞗
𨳚𨳣𨶭𨷐𨷒𩁴𩉵𩎗𩞑𩢌𩪱𩰟𩿈𪔅𪛊㞣㯣䈥䈽䌲䗼䙧䭻""",
    1,
    12,
    6,
    12,
]

yr13_1 = [
    """㓺㟲㥳㦥㨜㩮㱪㸋㹇㹉㺕䁔䇾䉒䊟䋣䋦䌓䓂䕰䖠䖤䚙䚭䞿䡝䩩䪛䪤䫶䭈䮝䮳䲮仮佡僠元冤勫匥原厡厵反吅咺喛喧喯喰噃园園垣堚墦妴娮媗媛媴嫄嬎宛寃帵幡怨惌
愃愋抃拚掀援摱攐攑旙旛昍晅暄暖杬梡棥楥榞榬槾樊樠橎沅洹湲源溒瀪瀳瀿烦煊煖煗煩燔爰犍犿狟猨猿獂琂璠甗番眢睷睻矾礬笎笲箮籓籵緐繁繙羱羳翧翻膰臗芫
萱萲葾蒝蒬蓒蕃蕿薗薠藩藼蘐蘩蚖蜿蝖蝯螈蠜袁袢袸裷褑褤襎言諠諼謜谖豲貆蹯軒轅轓轩辕邍邧鎱鐇阮靬鞬飜駌騵魭鱕鴛鵷鶢鶱鷭鸳鹓黿鼋𠫐𡈒𡍦𡟰𢅼𢆀𢇪𢍈𢏧
𢐲𢗯𢬵𢱽𢳚𢶃𣘖𣹠𤄜𥜴𥢌𥰟𥴤𥸨𥻫𥼞𥿋𦊻𦪖𦾴𧀭𧉗𧊾𧑩𧔞𧢜𧤎𧳭𧻚𧾎𨆌𨟄𨡄𨷇𩉯𩋱𩌑𩍎𩍻𩕪𩛟𩧅𩰵𩱡𪀈𪄁𪕀𪖇㓩㠾䆭䊕䠝䥉䳦""",
    1,
    13,
    7,
    13,
]

yr13_2 = [
    """㑮㖧㖹㢯㩔㬿㮯㯊㸑㹠㻊㼊䊐䊩䐊䑳䖵䝠䟂䡣䫒䰟䴅䴷亹仑们侖們倴吞吨吩啍喰喷噋噴噸囤囩圂坃坉坤垠埙堃塤墩墪墫壎壦奔婚婨婫存孙孫尊屯崐崑崘崙嶟庉弴
忳忶怋恩惀惃惇惛憞憣扪抡拫拵捫掄搎撉撴敦敯斖旽昆昏昬昷晜暋暾朜村根棔棞槂樽橔歕殙殟汶沄泍泿浑涒涽混渀温渾湓湣溫溷澊澐瀳炖焜焞煾燉犇犜狲猑猻玧
珲琨琿瑥瑻璊瓫痕痻瘒瘟盆睧睯禤穈純緷緼縕繜纯缊罇臀臋芚芲荪菎菕菛葐蒽蓀蕰蕴蕵薀薞藩藴蘊虋蜫蜳蟦裈裩褌褞訰論论豘豚豱貇賁贲跟踚蹲軘輼轀轋辒逩邨
錕錛鐼锛锟門閅閽闦门阍陯霕鞎韞韫顐飧飩飱餛餫饨馄騉驐髠髡髨魂魨鯤鲀鲲鵾鶤鷷鹍黁黗鼲𠉣𠔕𠚯𠛵𠭿𠽾𡆰𡉒𡟯𡼖𢍜𣇲𣋄𣝂𣣏𣤿𣨿𣯩𤅣𤇯𤟤𤫹𤭞𤮐𤿄𥁕𥂦𥊽𥴫
𥸵𦌸𦚣𦟓𦼿𧃣𧄸𧎤𧑒𧝗𧠚𧥊𧮠𧰭𨀛𨋨𨙯𨙲𨚲𨜵𨱙𨱤𨳔𨳘𨹙𩂄𩅴𩎤𩑥𩔉𩖤𩞤𩥈𩭋𩷵𩻋𩽞𪂽𪉸𪋆𪌋𪌽𪎴𪎶𪏆𪑖㒭㛰㡓㤋㤙㪟㬈㱎㻹㼔䃦䎜䔻䕖䪃䵍""",
    1,
    13,
    6,
    13,
]

hj14 = [
    """㐤㒼㗄㗈㘓㙔㙢㝴㟨㠝㡩㥇㩛㱍㱚㶥㸔㸩㿪䃪䃲䈲䊜䊡䐽䑌䒟䒥䕊䖂䗕䗙䙁䜌䜱䝎䝳䦡䦨䧲䪍䬧䮧䯈䰔䱗䴟䵎丸丹乹乾亁侒倌偳儧儹兰冠刊刓判剜剬剸勯匰单単
叹吅唌啴單喰嘆嘽嚾囒团団團圝圞坛垸塼墁墰墵壇奸姍姗姧婠媏媻嫥嫨嬏嬗安完官宽寏寒寛寬岏峘峦巑巒帴帵幋幱干弁弹弾彈忓忨悗慱慲懽抏抟拌拚拦捖掸搫搬
摊摶撢撣撺擹攅攒攔攛攢攤攼敦晥暕曫曼杆柈栏栞栾桉桓桿梡棺椯槃槫槾樠檀檲櫕欄欑欒欗欢歎歓歡残殘殚殫毌汍汗洀洹涫渜湌湍滦滩漙漧漫潘澜澷濽瀊瀾灒灓
灘灡灤烷煓犴犿狟狻猯獂獌獾玕珊瓛番痑痠瘅瘢瘫癉癱皖盘盤看眢睕瞒瞞矕矸砃磐磻穳窤端竱竿箪篅簞籣糰糷紈絙綄緐縏繁繟繵纨罎羉羦羱翰耑聅肝胖臗臤般芄
芉荁荌莞萈萑蒰蘭虊虷螌蟠蠸褍褩襌襕襴覌覍観觀观謾譋讕讙谩谰豌豲豻貆貋貒貚貛跘跚蹒蹣躜躝躦迀邗郸鄲酄酇酸釺鉆銮鋑鍴鎜鏄鏝鑚鑽鑾钎钻镘闌阑难雃雈
雗難靬鞌鞍鞔鞶韊韓韩頇顢顸颟飡餐饅馒馯騨驒驙驩髋髖鬗鰻鱄鳗鳱鴅鵉鶾鷒鷤鷻鸞鸾鼾𠁽𠁿𠒢𠕍𠕑𠠋𠡡𠽲𡅻𡘍𡚊𡽜𢉂𢓃𢓆𢖑𢦸𢧮𢬵𢰍𢺈𣀶𣁦𣌓𣎅𣓁𣧻𣶣𤞿𤟉𤠍
𤳖𤶤𤺏𤻷𤼙𥀐𥂥𥈼𥉟𥍬𥐓𥕿𥜄𥢽𥤸𥧭𥮚𥲑𥵣𥷬𥹚𥹳𦍼𦎊𦙱𦞖𦧼𦪫𦪹𦺊𦺐𦺦𦼉𦾸𦾹𧐕𧑚𧓘𧓩𧜞𧤗𧯡𧰄𧱆𧱼𧲦𧿙𨃞𨃟𨉝𨌁𨕹𨝌𨠡𨣵𨴣𨷻𨽧𩃘𩆑𩆓𩎑𩏑𩑖𩖒𩘯𩛳𩜵𩝖𩟒
𩠽𩡄𩤚𩦊𩵄𩾝𩾞𪄀𪅀𪈋𪈩𪊥𪍩𪏖𪐬𪑃𪒀𪒋𪔆𪘑𪘝㛽㠆㢖㣋㨏㫨㽃㿻䀂䆺䈀䉔䐷䝔䝜䡽䢿䬸䯃䵊""",
    1,
    14,
    7,
    14,
]

uj15 = [
    """㗴㘖㡲㣶㯗㰑㶎㹕㺗㻞㿏䃑䅼䚲䡲䦥䭴䰉䰋䴉僝关删刪囏圜奸姦姧娴婜嫺嫻嬛孯孱寰山弯彎患悭慳憪扳掔擐攀攽斑斒斓斕曫朌楌殷湲湾漹潸潹潺澖澘澴灣狠狦獌
环班環痫瘝癇癎癏眅睔瞯矕矜矝硍糫綸纶羟羥羴肦臤般艰艱菅葌蕑蕳藖虤虨蛝蛮螌蠻覵訕訮詽譠讪豩豻貋跧轘辬还還邖鍰鐶锾镮閂閑閒間関闗關闤闩闲间阛靬頑
頒顅顏顔顽颁颜馯鬘鬜鬝鬟鰥鱞鳏鳻鷳鷴鷼鹇黫黰𠊩𠔯𠟼𠠪𠬆𠴨𡅭𡇿𡎻𡠒𡿤𢇇𢛓𢺄𣡩𣧺𤌔𤛚𤜍𤜘𤠿𤡖𤡥𤡰𤢋𤫫𤸷𤻆𥈒𥌻𥹓𥿑𦣴𦫤𧇥𧢞𧲾𨝵𨲛𨲾𨳡𨴾𩅦𩆱𩋆𩔮𩙽𩦂
𩬞𩮉𩿉𪈿𪍺𪑪𪙨㐴㘤㸶䂅䓸䔵䘎䚪䤽""",
    1,
    15,
    7,
    15,
]

xm16 = [
    """㒙㒰㓲㔯㕙㘋㘣㙻㛹㜕㜣㝰㟀㟫㡉㢆㢟㢺㥕㦁㧂㨎㩲㫟㭹㮌㰃㰄㳂㳄㳙㳬㳭㵪㶌㸐㹡㼐㼷㽭㾓㾫㿊㿼䀬䀽䁢䁣䂴䃉䃛䄭䄹䄽䅌䇂䉳䊙䋌䌯䏃䏈䑏䔳䕼䖍䗠䗡䘰䚈
䚯䛲䟍䟒䟧䠰䡒䡘䣑䣺䥧䧃䨊䮁䮄䰓䱲䲂䲻䳒䳣䳪䳿䶬专乹乾亁仙仚仟传伭佃佺便偂偏傎傓傳傿僆僊儃儇先全兲冿剈前剶剸勌千单単卷厧县叀吅员咽員唌啳單嗹
嘕嘫噒囦囨圆圈圌圎圏圓圜圱圲坚垠埏堅堧塡填塼壖壥天奱奷奾妍妶姢姩姸姾娟娫娹婂婘婵媊媔媗媥嫙嫣嫥嫾嬋嬛嬵孉孪孯孱孿宀宣専專尟尠屇屳岍峑嵮巅巏巓
巔巛川巻帴平年幵廛廯延弦弮弲忓怜恮悁悛悬惓惤愃愆慩憐懁懸戋戔扁扇扦拪拳拴挛挳挻捐捲掔揅揎揙搧搴搷搼摼撁撋攐攓攣攧旃旋旜昖暶暷朘权杄枅枬栓栴梋
梴梿棉棩棬椯椽椾楄楥楩槇槙槤槫権橪橼檈檰櫋櫞櫣權歅歬毡氈氊汘汧沺沿泉洤涎涓涟淵渁渊渕湔湮湲湶湹湺溅滇滨漣漩漹潫潹潺澶濱濺濽瀍瀳灁灒烟烻焆焉然
煎煙煽熞燀燃燕牋牑牵牷牽犈犍犏狋狿猏猭猵獧獱玄玆玧玭玹珗珚琁琕瑄瑌瑏瑔瑸瑼璇璳璸璿瓀瓹甂甄甎田畋痃痊瘨癫癲癴癵盷県眠眩睊瞏瞑瞤矈矊矎矏矔研砖
硂硏硟碊碝磌磚礝祆禅禪秈秊稨穿窴竣笺笾筌筵箋箞箯篅篇篯篶篿籈籛籩籼糄純絃絟絭綖綿緜緣編緾縁縓縣縳縺繎繟繵纏纒纯绵缏编缘缠羴羶翧翩翴翾耑联聨聫
聮聯肙肩肰胘胭胼脠脧腁腃膞膻臙臤臱舡舩舷船芇芊苮茾荃莚莲菸菺萹葏葕葥葲蓮蔅蔫薽虇虔蚈蚿蜁蜎蜒蜵蜷蝉蝒蝙蝝蟤蟬蟺蠉蠙蠲蠸裐裫褰褼觠觾訮詮詽誸諐
諓諞諯謜謰譞诠谝谸豜豣貚貟賆賢贒贠贤跧跰跹踡蹁蹎蹥蹮躔躚軿輇輧輲辁边辿迁还连連遄遷還邅邉邊郔鄟鄢鄽酀酄鈆鈿鉛銒銓銭鋋鋑鋗鋻錈錕錢鍵鍹鍽鎸鏇鏈
鐉鐫鑳钱钿铅铨链锟锩键镌镟閍閼闐阏阗阡雃零靔靝鞙鞭鞯韀韆韉頨顅顓顚顛顴颛颠颧颴飦餰饘馢駢駩駽騈騚騝騡騫驙驠骈骞骿鬈鬋鮮鯅鯾鯿鰁鰬鰱鰹鱄鱣鱻鲜
鲢鲣鳈鳊鳣鳶鵑鵳鶣鶰鷆鷏鷒鷰鸇鸢鹃鹯麉黇鼘鼝齤齻𠀼𠄃𠄋𠏓𠐈𠑘𠑲𠑺𠓴𠚉𠛑𠛖𠛭𠛮𠡶𠣖𠤀𠤹𠥙𠥞𠩠𠫄𠫉𠫺𠯀𠷁𠷊𠿏𠿢𡅶𡅹𡇮𡈉𡈣𡒳𡙒𡾥𢂘𢃬𢇶𢉞𢌕𢍱𢎙𢏮𢐃
𢐆𢐐𢑆𢕖𢕨𢖎𢛆𢝓𢞬𢟿𢣔𢨿𢩟𢩠𢮂𢰊𢱾𢷻𢻶𣆴𣍴𣖳𣚙𣛹𣝕𣟋𣟳𣠸𣡠𣥡𣩀𣪀𣬹𣭻𣮏𣮿𣶒𣼞𣽖𤄺𤜼𤟿𤠶𤡨𤡮𤣆𤣥𤤦𤥷𤫞𤬠𤮳𤲬𤷄𥅬𥈇𥊿𥌂𥏥𥑻𥔮𥣰𥧑𥪧𥫛𥬍𥮒𥱺𥲋𥳚
𥷀𦂒𦇭𦌚𦎞𦎵𦏂𦏮𦐽𦑙𦒜𦓰𦗀𦙪𦛣𦝟𦝪𦣋𦣏𦣨𦧝𦧴𦬞𦬾𦮻𦱁𦳄𦸊𦺛𦽟𦿂𧃑𧄺𧈾𧉄𧉎𧍭𧍲𧐖𧐗𧓋𧔤𧖘𧘜𧛓𧟑𧟨𧡤𧢖𧫹𧭇𧮮𧰊𧱀𧱩𧲀𧲨𧸨𧹬𧺅𧼏𧽆𧽍𧽐𧽢𧾍𧾡𨀮𨁆𨂯
𨇤𨇼𨉾𨊟𨌈𨏩𨏶𨐋𨓯𨓲𨔥𨖳𨖾𨘢𨘼𨚶𨛈𨛲𨜻𨝍𨟠𨮻𨸮𨺘𨺩𨽷𩂍𩄠𩋋𩌯𩎳𩑹𩓫𩕖𩘒𩜬𩣲𩤡𩥄𩪾𩰎𩼼𪀝𪁼𪃋𪄏𪄷𪅉𪈻𪉻𪍴𪎾𪏊𪏗𪓍𪓼𪔙𪚁㒽㕓㗔㝚㡐㩊㫋㮍㮵㲔㶜㷑
㷙䀒䀖䄳䄵䆤䆥䉦䋗䌑䍹䒶䔐䗎䙭䙲䙴䚊䚶䢬䢴䱳䲆䳌""",
    1,
    16,
    7,
    16,
]

xc17 = [
    """㑸㑾㕥㕺㝯㟘㟹㠒㡻㨱㪣㯱㲈㵳㸛㼼䀉䁘䁧䄏䅺䆙䉼䌃䌊䍃䎄䎗䏆䒒䕯䖢䖴䖺䘟䙅䙳䚺䚻䜍䠛䢣䢪䩌䩦䫞䬙䮽䯾䱁䱔䲷䳂䴛䴩䵲么乔佋佬佻侥侨傜僄僑僚僥儌儦
凋刁刂刟剽劁劭勡勪匋卲叼吆呺哓哨啋喓喬喿嗂嘄嘌嘵嘹嘺噍嚣嚻囂垚堯墂夭奝妖妱姚娆娇婤媱嫖嫶嫽嬈嬌孂宎宵寥寮尞尧尭屪岧岹峣峤嵺嶕嶚嶛嶠嶢嶣嶤巶幖
幧幺庅庣廫弨弴彇彫彯徭徺徼怊怮恌愮慓憀憍憔憢憭憿招挑描揱揺搖摇摽撨撩撬撽敫敹料旚旫昭晁暚暸朝朷杓条枖枭枵柖标桡桥條梟椒楆榣槗標樤樵橇橈橋橑橚
橾櫹欩歊殀毊浇消漂漻潇潚潮澆瀌瀟灬炤烑烧焇焦焼熇熛熮燆燋燎燒燺爂爒牊犥狕狣猋猫猺獠獢獥玿珧琱瑤瑶璙瓢痟痨瘭癄癆皽盄瞍瞗瞧硝碉磦礁祅祒祧票穘穚
穮窑窯窰窷竂笤筄箫箾篍篻簘簝簥簫綃緢緰繇繑繚繰绡缭缲翏翘翛翲翹聊聎脁脿腰膋膘膫膮膲臕芀苕苗茮荍荛荞莜莦菬萔萧萩葽蓚蓧蓨蔈蔋蕉蕎蕘蕭薸藃藨藮蘨
虈虭蛁蛲蛸蜩螵蟂蟏蟟蟭蟯蟰蠨褕褿襓要訞調謠謡謤譙调谣谯豂貂貓贆超趒趫趬跳跷踃蹺軺轎轺轿辽迢逍遙遥遼邀郻鄡鄥鄵釗鉊銚銷鋚錨錭鍣鍫鍬鎐鎥鏢鐈鐎鐐
鐰鑣钊铫销锚锹镖镣镳镽闝陶隃雕霄鞒鞗鞽韶顟顠顤顦颵颷颻飂飃飄飆飇飈飉飊飖飘飙飚餆饒饶駋驃驍驕驫骁骄骉骠髎髟髫魈魒鮉鮡鮹鯛鰩鰷鱎鲦鲷鳐鴁鴞鴵鵰
鶓鷂鷍鷦鷮鷯鸄鸮鹋鹞鹩鹪麃麅麼鼂鼌鼦齠龆𠌠𠏈𠑐𠑪𠕻𠚥𠚻𠛪𠤺𠤼𠧪𠨥𠰉𠷻𡂢𡆩𡏭𡓖𡔜𡝛𡝩𡟠𡺯𡻪𡼚𢁾𢄷𢄹𢆷𢆽𢈆𢊙𢊻𢋇𢐟𢑈𢓝𢓮𢗈𢘟𢧱𢪶𢮉𢻤𢿣𣁰𣂁𣂇𣂥𣄠
𣋍𣒼𣝐𣝞𣟆𣟐𣟼𣣳𣣵𣨘𣬸𣯹𣶃𤐫𤑳𤓪𤖻𤚜𤚭𤞚𤢖𤣠𤫺𤬖𤱠𤵠𤺃𤺫𤿘𥄉𥉼𥪯𥮐𥰜𥲊𥲦𥶏𦅃𦆸𦏷𦐺𦔗𦔩𦔷𦕵𦗖𦟞𦠎𦨣𦩍𦩻𦪕𦪛𦮁𦯐𦶌𦸔𦺓𦺹𦾺𧂏𧄍𧄎𧌁𧌠𧍔𧘨𧘩𧥍𧳍
𧷋𧽎𧽤𧽽𨋫𨍳𨓳𨘔𨜑𨝓𨝱𨞶𨨴𨭚𨰑𨱻𨶅𨶲𨸓𩀜𩋍𩙚𩜸𩪊𩯊𩱴𩲤𩳸𩴩𩾒𩾓𩾗𪁎𪆄𪋖𪌵𪚰㓮㚋㚠㬸㲖㲬㲵㴅㶮㶾㸈㹦䁃䁭䂏䌁䌭䔥䖀䨭䫿䳩䶰""",
    1,
    17,
    8,
    17,
]

yc18 = [
    """㕭㘭㠂㤊㤍㬵㮁㹲㺒㿰䂚䂭䃩䄻䅦䈰䈾䉰䋂䍊䍖䒝䘯䜈䢒䩝䫸䰫䴃交佼侾倄凹刨剿勦勹勽包匏吵呶咆咬哮啁嗃嘋嘐嘮嘲嚆嚗坳垇墝墽姣娋婋媌嫹宯尥尦崤嵪嵺巢
巣庖庨弰怓抄抓抙抛拋挍挠捊捎掊摎摮摷撓敎教敲旓枹柪梎梢樔殽毃泑泡洨涍淆渵漅灱灲炮炰烋焇爮爻犛狍猇獿瓟痚硇硗硣磝磽礉礟稍穘窌窙窲窼笅笣筊筲緢繷
罞罺耖聱肴胞胶脟脬膠艄芁苞茅茆茭莦萷藃虓蛟蛸觘訤訬詉詨誟誵謧謷謸謿譊賿跑跤踍蹘軪軳輎轇轈郊郩鄗鄛鈔鉋鐃鑤钞铇铙鞄鞘鞩韒頝顟顤颮颵飑餚骲骹髇髐
髾鮫鮹鲛鴢鵁鵃鶜鸼麃麅齙龅𠐋𠝑𠣑𠣒𠴳𠹎𡏮𡡊𡡏𡻝𡽧𡾌𢛘𢪼𢼼𢿏𣏠𣔷𣮃𣰩𣺳𤍒𤔉𤕢𤙴𤛖𤠖𤷤𥆔𥉾𥊌𥑪𥕘𥧇𥲀𥶔𥹜𥾤𦄏𦗔𦨖𦸛𦺔𦾱𧍂𧒚𧓿𧣦𧤮𧵢𨃤𨄓𨎦𨓩𨚔𨠦𨲆
𩍂𩎔𩎘𩎾𩐜𩖥𩖯𩨟𩫂𩫥𩾾𪁉㫴㶀䞴䟁䫜䬘䮦""",
    1,
    18,
    8,
    18,
]

hc19 = [
    """㗦㜖㞪㟉㠙㩝㩠㬔㮘㯥㲏㴞㷮㹗㺀㺜䄚䆁䐬䑬䓘䕅䛌䛝䛬䜊䜎䜮䝁䝥䤾䥝䦋䧫䫨䬞䬢䭷䮯䯌䲏䵅傮儫刀劳労勞匋厫叨号呺咎咷哰唠啕嗥嗷嗸嘈嘷噑嚎嚣嚻囂壕夒
夲夵嫍尻岕峱崂嵍嵪嶅嶆嶗嶩巎幍廒弢忉慅慆慒憥憹抭挑挠捞掏掻搔搯摮撈撓撡操敖旄曹曺朷枆桃梼椃椮槄槔槮槹槽橰橾檮櫜毛毫氂洮浶涛涝淘溞滔滶漕澇濠濤
熬爊牢牦猱獆獋獒獓獔瑫璈痨癆皋皐睾磱祹窂篙簝簩籇糕糟絛綢綯縚縧繅绦绸绹缫羔翢翱翶翺翿耗聎膏膫臊臑臯舠艘艚芼茠萄蒿蓸蔜蕔薅號蚝蜪蝚螬螯蟧蠔袍裦
裪裯褒褿襃覒訄詜諕謈謟謷謸譹豪蹧軞轑迯逃遨遭鄋鄵酕醄醩醪釖鋾鏊鏖鏪闁陶隞鞀鞉鞱韜韬颾飸餻饀饕駣騊騒騷驁骚骜高髙髛髝髦魛鰠鰲鱢鱽鳋鳌鷎鷔鷱鼇鼗
鼛𠅬𠇏𠈭𠋺𠌪𠓝𠗆𠚃𠢕𠬢𡂘𡊛𡺫𡼗𡽝𡾂𢔇𢔳𢚄𢜸𢧴𢫩𢻇𣈅𣉔𣉿𣊁𣍖𣔱𣘪𣘫𣩒𣭖𣭮𣭹𣰺𣹪𣽎𤎤𤏶𤔱𤘸𤙎𤝄𤞍𤠘𤡇𤡐𤡤𤢨𤩂𤴻𤵟𤵥𥀛𥢐𥢒𥰱𥲍𦋿𦍚𦍱𦒢𦞣𦩄𦪈𦺆𦺰𧂩
𧅃𧕐𧖠𧙌𧟜𧢌𧨲𧫒𧯌𧴓𨂜𨒑𨚙𨝲𨠷𨡒𨣃𨦭𨪊𨲮𨼍𩆘𩋃𩏤𩐮𩕯𩖸𩗥𩘮𩙈𩛽𩞄𩞣𩤉𩥅𩥊𩩾𩫔𩫕𩫚𩭾𩮘𩮚𩮯𩱏𪁔𪊳𪌼𪔘㞵㡟㤒㥰㫞㫦㮴㯾㰏䀞䈱䑹䫽䬭乚""",
    1,
    19,
    8,
    19,
]

ge20 = [
    """㑚㔮㗻㛖㛗㜑㢦㨇㩯㭫㰙㸫㸰㸱㼠㽨㾃䃺䄉䊨䌴䍫䐆䑘䒩䓾䔋䕏䖕䖸䚰䠡䡐䣜䪑䭩䭾䯊䯢䰿䳗䳘䴱䴾么他伽何佗侳俄倭傞傩儸儺剆劘吔吪呙呵咃咊和咼哥哦哪哬
唆唩啝啰啵喎喛嗦嗬嘙囉囮坡埚堝堶多夛她妸妿姀娑娥娿婀婆它尛屙岥岮峨峩崜嵯嵳嶓庅庹惒戂戈戓戨抲拕拖挪挱挲挼捼搓搫摞摩擵攎攞攠枙枷柁柇柯桫梛梭椤
楇橠櫇欏歌氇氌沱沲河波涐涡涶涹渦渮滒澕濄牁牠牱牺犐犧狏猡猧献獻玀玻珂珴瑳番疴痑痤痾瘥瘸皒皤盉睉睋矬砢砣砤硪碆碢磋磨禾科稞窝窠窩箩簑簔簻籮紴紽
緐緺繁罗羅翗脶腡舸艖苛茄荷莎莏莪莴菏菠萂萝萪萵蒫蓑蔖薖蘑蘿虆虘虵蚵蛇蛾蝌螺蟸蠃蠡袉覣覶覼訛訶訸詑誐謌譌讹诃趖跎跢踒踻蹉躜躦軻轲迆过迗迤迦迱逻
過遳邏那郍鄱酇酡醝鈋鈛鈳鉌鉕鉫錒鍋鐹鑼钶钷锅锕锣阤阿陀陁难難靴鞾頗颇饠馱駄駝駞騀騨騾驒驘驝驮驼骡髁髍髿魔魤魺鮀鮻鲄鴕鴚鵝鵞鸁鸵鹅鹺鹾麼麽鼉鼍
鼧齹龢𠀀𠈱𠊵𠏀𠧕𠯫𠱀𠱗𠳊𠴻𠸲𠹈𡈙𡑟𡖔𡖝𡖫𡡉𡼃𡾉𡿊𢎄𢏜𢑠𢘿𢥳𢨡𢩻𢱨𣁯𣂄𣖵𣜄𣧤𣨎𣯌𣱀𣲲𣻕𤀪𤄷𤇞𤉦𤖱𤘟𤜊𤝛𤠝𤭻𤵚𥆝𥇇𥓿𥘫𥝹𥞄𥞍𥞒𥞩𥟿𥡜𥭟𥭭𥹈𦃡𦆁𦑑
𦟟𦡃𦣖𦨜𦩜𦬗𦱆𦿌𧂉𧄿𧎺𧒎𧔼𧙅𧚄𧢵𧢽𧣖𧤓𧨀𧨂𧨄𧭳𧵛𧷳𧽶𧿕𧿫𧿶𨁌𨇃𨋟𨒽𨙻𨟖𨟶𨠑𨪍𨰞𨰠𨸭𨾓𩄝𩉺𩌢𩎊𩎼𩏭𩑁𩑼𩒰𩕏𩛠𩜭𩞁𩞇𩡾𩢅𩢊𩢵𩣣𩧐𩨭𩨷𩮹𩰫𩰬𩰭𩴓𩴴
𩵇𩼊𩽰𩾷𪀉𪆹𪈰𪍎𪎆𪘓𪘕𪘗㚳㤎㱒㸯㹻㽿㿆䆧䆼䈖䋍䋪䌀䔀䔅䜏䝛䤬""",
    1,
    20,
    9,
    20,
]

ma21 = [
    """㖿㗇㗬㗾㚗㛻㜘㝞㠏㠺㢉㢒㤉㦄㦊㧎㧱㪥㭉㭨㰺㱔㲚㵃㸺㽋䁟䃁䄰䅿䍓䏧䐤䑡䓉䔑䔢䔤䕒䖯䗫䛔䠍䣝䥺䦈䪗䫗䯞䯲䴥䵙䵷䶕䶗䶥丫些他伽佘侉俹倻偧偺凃划加华
叉叭吀吒吙吧吪吾呀呙呿咤咩咱咵咼哆哇哑哗哶唓唖啞啦喳嗏嗟嗻嘉嘛嘩垞塗夸夿奓奢妈妑姱娃娲婼媧媽嫅嫬孲家岈峫崋差巴幏愘扠找抯抲拁拏拿挐挓挝捈捓揢
揶搲搽摦撾擨攨斜旯晇杈杷枒枷柤查査桠桦桬梌椏椰椴椵楂槎樝樺檛歄歋毠汙汚污沙泇泟洼浾涂涯渣溛溠漄漥潖潳焻煆煱燊爬爷爹爺牙犌犘犽猳玡珈琊琶瑕瑘瓜
畖畬畭畲疤疨痂痖痧痲瘂瘑瘕癿皅皶皻睱砂砗硨硰碬碴祖秅秺窊窪笆笌笯笳筢簻粆粑紗緺纱罝羓耙耞耶胍脶腡腵膼舥艖芭花芽苩苴茄茬茶荂荼莎莗華葩葭葮蒘蒫
蔖蔴蕏蕐蕸藸虵虾蚆蚜蛇蛙蛼蜗蝦蝸蟆蟇蟼衙衺袈袓裟褨觰訍誇誽諣謯謶譁譇谺豝豭貑賒賖赊赮跏跒踻蹅車輋车迦遐遮邪釫釶釾鈀鉇鉈鉫銟鋘鋣錏鍜鍦鎁鎈鏵鐚
钯铊铔铘铧閕闍阇雅霞靫靴鞾颬騢騧驊骅髽髿魦鯊鯋鰕鲨鴉鴐鴚鵶鷨鸦麚麻鼃齄齇齖齟龃𠇗𠋗𠌮𠌶𠛒𠜲𠞊𠭯𠷉𠽫𡁑𡇚𡗢𡗷𡜁𡝙𡻤𢄄𢋚𢑓𢚌𢜲𢝅𢠭𢪎𢳛𢶌𢹓𢻷𣒄𣘟
𣘻𣚋𣚒𣢉𣢚𣣟𣧜𣩈𣪇𣮫𣱱𣲓𣴷𣶤𣸏𣸚𣻐𣻠𤓷𤔀𤕓𤘅𤘆𤜱𤞡𤟚𤠙𤳂𤶠𤹡𤺎𤽉𥀏𥁆𥂓𥄼𥈓𥉵𥍸𥑹𥕑𥝀𥝿𥡧𥡮𥥸𥮣𥯘𥹁𥹌𥿞𦀛𦐆𦕆𦕉𦙺𦛝𦞭𦧹𦬻𦭉𦯬𦰳𦱵𦳃𦳏𦳘𦴍𦽊𧉪
𧉮𧋊𧎱𧑍𧑡𧘽𧣃𧣣𧤣𧦎𧦤𧦮𧪕𧬅𧲧𧿼𨃓𨈺𨉣𨊹𨔗𨔣𨖭𨣄𨣍𨨙𨰵𨲑𨵧𨶱𨼑𩀪𩄗𩈆𩊮𩒷𩔶𩔷𩝨𩢍𩨠𩨾𩩗𩵮𩸋𩸖𩸾𪀁𪌮𪐀𪐎𪐓𪓹𪔟𪗭𪗵㚙㦋㧓㳸㸙㸭㹢㾚㿬䂟䈔䐒䠸䨟
䩖䫚䯯乫""",
    1,
    21,
    10,
    21,
]

yh22 = [
    """㐬㑌㑽㙊㙶㚂㜍㝑㝗㝩㞷㟄㟍㟵㠵㡛㢃㤃㤚㤺㥬㦂㦹㩖㫄㭻㭿㰠㱂㱢㲥㲽㵴㶓㹁㹔㼺㽘㾠㾮㾿䀚䀪䀮䁑䄱䅒䅣䅭䅯䆡䉎䉴䊗䊣䌅䍿䐠䑟䒢䒰䔗䕋䕬䗅䘕䛫䝶䞹䠆
䠙䡙䢢䣘䣼䧛䧜䨦䩕䪄䬗䭹䮖䮲䯖䯴䱶䱽䲳䳨䵃丧丬乡亡亢亾仓仧仰仺仼伒伤伥佒佯俍倀倉倡偟偿傍傏傷傹傽僙僵儅償儴光兏兦冈凉凔凰刚创剏剛創劻勆勥勷匚
匡匨匩卬厢吂吭呛咉哴唐商啷啺喤喪嗆嘗噹嚐嚢囊囔场坊坣垙垟埅堂堈堭場堽塘塲墇墒墙墴墻壃央妆妔妝妨姎姜姯娘娤娼婸媓嫎嫏嫜嫝嫦嫱嬙孀孃将將尙尚尝尣
尩尪尫岇岗岡崀崗崲崵嵢嵣嵻嶈巟帮常幇幚幫庄庆床庒庠康廂廊廧弜张張強强彊当彭彰彷彺徉徜徨徬忀忘忙忼怆恇恾惶愓愴慌慞慯慶慷戕戗戧房扬抂抢抰揚搪搶
摚摪撗攘敭斨方斻旁旸昂昌昜昻晿暘暲朚望朢杗杨杭枊枋枪柍样桁桄框桑桒桹梁梉棠棡椋楊楧楻榔榶槍様槺樑樘樟横樯橖橫橿檣欀欜欴殃殇殤殭氜汒汤汪汸沧泱
洋洭洸浆浪涼淐淓湘湟湯溏溬滂滄滳漒漟漡漮漳漿潢澢瀼灮炀炗炚炛烊烡烫烺煌煬煻熿燙爿牀牂牄牆牥牨犅犟狂狼猐猖獐獚獽王玚玱珖珜珰琅琩瑒瑝瑭瑯瑲瑺璋
璜璫瓖瓤瓨瓺甞畕當畺疅疆疒疡疮痒瘍瘡癀癢皀皇盪盲盳相眏眶眻矘砀砊硄硠碭磄磅磺礓祥禓禟禳秧稂穅穔穣穰章笀笐筐筕筜筤箱篁篖篣篬簧簹粇粧粮粱粻糃糖
糚糛糠糧紻絴綡綱緗縍繮纕纲缃缰罡羊羌羏羗羘翔翞肓肠肪肮胦胮胱胻腸膀膅膓膖膛膷臧航舱艆艎艙艡艢良芒芗芳苀苌苍茪茫荒荘荡莊莔莣莨菖萇葁葙葟蒋蒼蓈
蓎蔁蔃蔏蔣蔵蔷蕩薌薑薔薚藏蘉蘘蘠蘯蚄蚟蚢蛘蜋蜣蝆蝗蝪螀螂螃螗螪螳螿蟥蟷蠰衁行装裆裝裮裳襄襠觞觴詤詳誆諹謒謪诓详貥賍賘贓贜赃赯趪趽跄踉踼蹌蹚蹡
躟躴躿軖軠軭輄輬輰辌迒逢逿遑遧邙邝邟邡邼郎郞郷鄉鄊鄌鄕鄣鄺醣量釯鈁鉠鋃鋩鋼鋿錆錩鍚鍠鎊鎕鎗鎠鏘鏛鏜鏿鐊鐺鑜鑲鑶钖钢钫铓铛锒锖锠锵锽镑镗镶長镸
长閍閶闛闣阊阦防阳陽隍隚障雱雵霜霶霷鞅鞤鞺韁韹頏颃颺飏餦餭餹饄饟香駺騜騯騻騿驤驦骦骧髈鬤鬺魧魴鯧鰉鰑鰟鱂鱆鱑鱨鲂鲳鲿鳇鳉鳑鴋鴦鴹鵟鶬鶶鷞鷬鸉
鸘鸧鸯鹴麘麞黃黄黆鼚鼞𠂸𠃤𠆝𠑷𠑻𠒌𠒨𠔊𠕿𠗶𠘌𠢃𠥐𠮴𠹔𡁧𡈠𡉉𡑆𡜋𡝝𡠥𡺛𡾻𡿰𢁹𢇟𢈜𢈵𢋾𢍿𢏙𢐊𢕎𢕔𢧅𢪇𢪷𢭈𢰌𢴳𢻿𢼑𢽂𣂆𣉚𣐫𣗵𣞝𣦐𣮡𣰶𣴥𣺬𣻟𤃼𤆴𤉪𤎘
𤕭𤕯𤕽𤖅𤖖𤙝𤚝𤚫𤚬𤚰𤛜𤛥𤛻𤝿𤞢𤠛𤢎𤢮𤧭𤬥𤭒𤮊𤯷𤷀𤷼𤸡𤾑𥁃𥂸𥃽𥆅𥆚𥉽𥋡𥋤𥍫𥏫𥐞𥕎𥗪𥝕𥡃𥢷𥫅𥫳𥬴𥳜𥹺𥿪𦅇𦈃𦋳𦍕𦍴𦍹𦐄𦗴𦟃𦡽𦣂𦨵𦬆𦬣𦭵𦯌𦰱𦱌𦳝𦳟𦴊
𦵧𦼲𦼳𦼴𧇞𧐊𧒾𧕨𧕸𧖑𧖬𧘃𧠬𧱵𧲱𧶜𧻔𧻺𧼮𧽣𧽩𧿆𨀕𨀘𨀫𨁈𨂟𨄈𨄚𨅝𨆉𨉤𨋽𨌩𨍧𨍴𨎋𨎍𨎩𨎴𨏆𨒫𨖢𨚳𨛌𨜔𨜰𨜷𨜾𨝎𨝴𨞿𨟐𨟚𨢆𨢐𨢩𨣛𨧖𨱮𨴑𨵶𨶆𨶈𨶰𨶼𨹈𨻷𨽐𨾒
𨾔𩀞𩃕𩅅𩅪𩆶𩇴𩉰𩋬𩌬𩐷𩑇𩑝𩔘𩗧𩘁𩘜𩛡𩜒𩝞𩞩𩟈𩡌𩡠𩢯𩢼𩤟𩥁𩦌𩧉𩬹𩰱𩱀𩲌𩲹𩵭𩷕𩷗𩷸𩹶𩼉𩼒𩿄𪀞𪁘𪁜𪁸𪂇𪂼𪄲𪄹𪅂𪇁𪉨𪏍𪏒𪏙𪓅𪓛𪔬𪕃𪕇𪕓𪕫𪕹𪗜𪙎𪚻㐮㓻
㡃㢜㤀㨍㫕㭃㮜㳾㹧㼕㼚㽆㽵㿝㿶䄃䅛䅨䆲䊋䊢䌉䌮䍧䍭䏾䖱䗉䗧䗵䥊䦭䩷䮣䯑䱀䲝䵰䵼乓""",
    1,
    22,
    2,
    22,
]

gg23 = [
    """㒌㔙㘇㙚㚚㛁㜲㝁㢣㢬㣜㥊㧍㧸㨕㬹㮄㱶㲂㲆㲰㵬㶈㷀㹹㺸㼇㼩㿘㿮䁎䁐䃷䄇䄓䄘䆑䆖䆵䆸䇇䇸䈍䉚䊅䋊䋫䍔䎴䎽䐵䑉䕦䖟䗈䙀䚘䝼䞓䡩䡰䢚䣐䥰䨍䨎䨝䪯䫆䫺
䬖䬝䭢䯒䰃䲔䳟䵞丁並争亨京亰令伥伧伻佂併侊侦俓倀倂倾偀偵傖傡傾儜儝兄兵净凈凔剠劥勍匉卿名吰呈呯咣哼啨喤営嗙嘤嘭嚝嚶圊坑坪垶埂城埥埩塋声夐夝奟
妔姃姘娍娙婛婴媖媜嫇嫈嬛嬣嬫嬰嬴孆孾宏宖宬寊峥峵峸崝崢嵘嵤嶸巆帡帲平并幷庚庼廎弸彋彭征徰怔怦恲悙情惊惸憆憉憌成抢抨拧拼挣挰挳挷掁掙揁揈揘揨搒
搶摚摼撄撐撑撜擎擏擰攍攖敻旌旍明晟晠晴晶暒更朙朠朾枨枪枰柍柠柽栄栟桁桜桢梈棈棖棚棦棾椖楧楨楹榜榮槍樈横樱橕橗橙橣橩橫檉檙檠檸櫻櫿正殅殌殸氓汮
汯泓泙泟泩洐洴洺浄浈浜浤浭浾淨淸清渶渹湞湦溁潆澎濚濴瀛瀞瀠瀯瀴灜炡烆烹焭煐煢營爃爭牓牚牲牼狌狞狰猄猙猩獰玶珄珩珵珹琁琤琼瑛瑝瑩璎璚瓊瓔瓗甇甍
甖生甠甥甿畊痭盁盈盛盟盯盲眀眐眳睁睘睛睜瞏瞠瞪砊砰硁硑硜硡硻硼碀碤磞礯祊祯禎禜秔稉程稝窚竀竑竝竤笙筕筝筬箏箐箳篣簈籝籯粳精糽紘紭絣絾綋綳緓緽
縈繃纓纮绬绷缨罂罃罌羟羥羮羹翃翝耕耾聇聙聲胓胻脝脭腈膨臤艵英苹苼茎茔茕荆荊荣荿莔莖莹莺菁菮萌营萦萾葏葝蓥薨藑蘅蘡虰虻蚲蛏蜻蝧蝱蝾蟚蟛蟶蟼蠑蠳
行衡裎褮觥觪觲觵訇評誙誠請諻謍譻评诚请谹貞賏賡賯贏贞赓赢赪赬赹趟趽軣軯軽輕輣輧輷轟轰轻迎遉邟郕鄳酲醟鈜鉎鉦銵鋐鋞錋錓錚鍈鍞鍟鍠鍧鎗鎣鏗鏳鏿鐄
鐺鑅鑋鑍鑏钲铛铮铿锳锽閍閎閛闳阬阷雃霐霙靕靗韹韺頃頳顷餳饓饧駍騂騯驚骍鬇鬡鮃鯖鯨鲆鲭鲸鳴鴊鴴鶁鶄鶊鶧鶯鷪鸉鸎鸚鸣鸻鹒鹦麖麠黉黌黥鼆鼪鼱𠄙𠅖𠏧
𠕠𠠜𠧿𠪂𠰈𠴢𡇳𡊞𡚔𡝚𡞦𡺡𡽊𢁿𢄋𢆸𢈴𢌛𢏳𢐞𢘌𢤘𢥏𢮐𢶇𢼩𢽩𢾊𢿦𢿧𣀏𣞑𣢐𣢴𣥺𣨉𣨥𣫒𣬺𣲜𣸝𣻒𤂲𤆁𤏽𤕦𤘾𤙡𤚣𤜉𤜰𤟣𤟼𤡭𤣎𤪡𤭫𤮏𤰡𤷦𤹜𤹧𥉸𥋝𥌏𥌯𥌽𥍼𥐑𥒁
𥒱𥔀𥔇𥕗𥛱𥣗𥥈𥥱𥥳𥭮𥲂𥼬𦁷𦂠𦅈𦈵𦊫𦐳𦑟𦑠𦓺𦔃𦖽𦙫𦜳𦞗𦡅𦦿𦪗𦯰𦱊𦱋𦳲𦳶𦾵𦾿𧀘𧁊𧂛𧂡𧅋𧈧𧈽𧓀𧓔𧕍𧕙𧖸𧘿𧙸𧝒𧢛𧤵𧭈𧮆𧮯𧯀𧯫𧵣𧷒𨁎𨆪𨋔𨌍𨌢𨌨𨌳𨌶𨍩𨍶
𨎗𨎧𨑎𨒌𨓷𨕧𨛰𨜏𨜓𨞐𨟙𨠟𨨸𨵛𨹚𨺀𨺟𨻺𩁷𩃙𩄪𩇜𩓨𩕵𩗲𩗵𩘇𩘼𩘽𩙆𩚫𩛦𩛿𩜣𩞦𩡕𩣶𩤙𩥍𩩍𩫹𩮗𩯎𩱁𩱋𩱧𩳯𩷏𩹅𩺄𩽡𪁋𪂴𪇒𪏓𪏠𪏢𪑰𪗸㓌㙃㚾㡕㤣㧶㪅㫌㰢㵙㷣
㹴㽒䃘䊒䊔䍬䍵䎕䑫䔊䙖䟓䟫䡠䥋䦕䦫䨉䪫䱢䲼䴍䴤乒""",
    1,
    23,
    11,
    23,
]

qk24 = [
    """〇㓝㝉㝕㝠㡵㤯㦭㪮㬡㯏㯪㸳㹶㻂㻏㼗㼛㾉䁝䄙䄥䅽䆨䆩䈂䉁䉖䉹䋼䌢䍅䍈䓑䕘䖅䙥䚖䡼䡿䢛䣆䤯䤰䦺䨩䫤䯍䰱䱓䴇䴒䴫䶄丁亭仃令伶侀俜停冂冋冥刑刢厅厛叮
听呤呬咛嚀囹圊坕坙坰坽型奵姈娉娗娙婷嫇嬣孁宁寈寍寕寗寜寧屏屛嵉嵤巠帄帡帲幈庁庭廰廳廷形彾径徑惺扃拎星昤暝曐朎朾柃桯桱棂楟榠榳檙櫺欞汀泠泾涄涇
渟溟滎澪濙濴灵煋熒熲燯爧狌狑猩猽獜玎玲瑆瓴瓶甁甹町甼疔皊皨睲瞑砱硎秢竛竮笭筳箳箵篂簈紷絅経綎經经缾羚翎耓耵聆聍聠聤聴聹聼聽腥舲艼苓荓荥荧莛萍
萤葶蓂蓥蓱蕶藀蘏蘦蛉蛍蛢蛵蜓蝏螟螢衑褮訂詅諪订跉軨軿輧迳逕邒邢郉郬郱鄍酃醒醽釘鈃鈴鉎鉶鉼銒銘鋞鍟鎣鏻钉钘铃铏铭閝閮陉陘零霆霊霛霝靈靑青靪鞓頩
顈馨馫駉駖駢駫騈骈魿鮏鯖鯹鲭鴒鵛鵧鸋鸰鹷麢鼮齡齢龄龗𠀦𠄚𠆤𠏡𠛬𠟨𠠢𠬋𠱠𠷓𠻠𠾥𢂶𢄗𢆟𢌔𢖊𢩗𣂴𣅻𣌟𣍆𣓐𣕄𣨾𤃩𤖦𤗞𤘖𤜙𤣘𤧘𤫲𤬐𤳊𤿅𥌼𥑎𥠀𥤜𥤞𥥶𥩔𥭢
𥴑𥵪𥼸𥽣𦀔𦈨𦉢𦉬𦖤𦝞𦨍𦩠𦫃𦫊𦶊𦽁𧆺𧌚𧓴𧕅𧕝𧖜𧖨𧛟𧟙𧟠𧨈𧰻𧱢𧶺𧾇𧾮𨂲𨉬𨊡𨓍𨠎𨴀𨽲𩂾𩃞𩆒𩆚𩆮𩊂𩑊𩖊𩖵𩗼𩚹𩟃𩩋𩪥𩬔𩲩𩵀𩸥𩹇𪋋𪋳𪔾𪕌𪕍𪕒𪛈㓅㕔㣔㩕㭢
㽮䃏䗌䛣䩠䮐䯕""",
    1,
    24,
    11,
    24,
]

vg25 = [
    """㐩㔰㖫㛵㜴㞼㣒㥄㭁㱥㲪㴰㵗㺱䁬䄧䈊䉄䉕䋲䏻䑅䒏䒐䔖䔲䕨䚮䠮䡌䡏䡕䧙䩑䬋䮪䱭䱴䲍丞乗乘仌仍仱倗倰偁傰僌僜僧儚儯兢兴冫冯冰凌凝凭凴勝升厷噌噔噟堋
堘塍塖塴増增夌奟姮婈嬁嬹层層崚崩嵭嶒幐应庱弘征徰徴徵応恆恒惩慿憎憑憕憴應懲扔承抍掕掤揯搄敒斘昇曽曾朋栤棚棱椉楞橧殑氶氷洆淜淩渑溗滕漛漰澂澄澠
瀓灯烝焩焺熷燈爯琌璒璔畻疼症痭癥登睖瞢矒矜矝矰砯碐磳礽祾称稜稱穪竑竤竲竳篜簦籐籘絙絚綾緪縆縢繉繒繩绫绳缯罾耺肱胜能脀腾膡膯膺興艿芿苰菱蒸蓤蔆
蕄薐薨藤蘉蝇蝿螣蠅裬覴誊謄譄譍譝豋踜輘辸邆鄫錂鐙镫阩陞陵陹陾鞃鞥顭馮駦騬騰驓驣鬅鬙鯪鰧鱦鲮鵬鵿鷹鹏鹰鹶鼟𠄨𠅟𠅫𠐿𠓆𠓲𠓸𠜳𠡭𠡮𠧟𠮳𠯷𠳬𠻱𡃳𡌜𡕮
𡡑𡾽𢅋𢉁𢎴𢐒𢓞𢔁𢟱𢦑𢲰𢾧𣂤𣅍𣋢𣎎𣣋𣽨𤃫𤃶𤇶𤎯𤗓𤛢𤮘𤳘𤹤𤺌𤼁𤼶𥉋𥌾𥎅𥟎𥺙𥾋𦀓𦂅𦒃𦓬𦚝𦚦𦜎𦠇𦡪𦡼𦢧𦢻𦩱𦪝𦫀𦶙𧀆𧂋𧈜𧌇𧕄𧗆𧗲𧢐𧪣𧭔𧲅𧹈𧼔𧾊𧿘𨂃𨃗𨈓
𨋬𨌆𨌤𨞾𨟃𨲯𨸐𨻱𨿳𩋒𩍋𩖉𩜁𩞬𩩡𩯇𩴝𩴲𩶡𪋾𪌏𪒿𪙭㔁㥤㬺㮱㷥㽅䇰䎖䒱䕝䕟䗀䙞䧹䨜䳾""",
    1,
    25,
    11,
    25,
]

yz26 = [
    """㐀㐜㒡㓱㕤㕱㖄㖻㖼㗋㘜㘥㚭㚱㛏㛜㛩㝹㞗㟈㟊㡞㤑㤧㤹㥢㧨㧵㨨㨮㩅㫍㬋㭌㭝㳅㳋㳜㳺㵞㷕㺅㺫㽕㽛㽞㽥㾋㾞㿧㿵䀺䁱䂉䄛䈭䉧䊵䋷䌔䌧䍌䎧䎿䏬䐓䐹䑦䑻䒜
䓟䕱䖥䖻䗋䗔䗜䙈䚃䚧䜪䝀䝏䞀䟵䠓䡂䢊䢟䣇䤛䥐䦾䨗䨲䩳䫛䫫䬒䬟䮟䮫䯽䰆䰍䰗䰘䱕䱖䱸䱾䲖䲡䳕䳧䳼不丘丟丠丢亀亠仇休优侔侜侯侸俅俢俦修偤偷偸偻傁傮
僂儔優兜兠冘刍刘剅剹剻剾劉劺勎勠勼勾匬区區卣厹収叜叟句叴吥否吺呕呣呦周咻哞哹唒售啁啾喉喌喽嘍嘔噍嚋嚘嚠囚圳坄坵垺垼堥塸头妋妞妯姇娄婁婤婾媃媝
媮媹嬦嬼寠尢尤岣峳崷嵝嵧嶁州帱帿幬幽庥庮廀廋廔彄彪徟忧怄怞怣怮恈恘悠惆愀愁慒慪慺憂懮扏抌抔投抠抭抽挎捄捒捜掊掫揂揄揉揪揫搂搊搜摉摎摗摟摳撨收
攸敄救斿旈旒朹朻枸枹柔栦桴梂梄棷棸椆楢楸楼榴槱樇樓樛橊櫌櫙櫹櫾欧歐殏毬求汓汼沋沟沤油泃泅泑泭泵洲流浏浗浟浮涑涪淍淲渘渞游湫湬湭溇溝溲滮滺漊漚
漱潄瀀瀌瀏烌烐烰煪熡熮熰燽牏牛牞牟犙犨犫犰犹猴猶猷獀玌珘球琈琉瑈瑠瑬璆璢瓇瓯瓿甌由甴甽畄留畱畴疁疇疣痐瘊瘤瘳癅皗皳盚盩眍眗眸睺瞀瞅瞍瞗瞘瞜瞴
矁矛矦矪硫磂秋秌秞稠穋穐窭窶筄筹箁箃篌篍篓篘篝篼簍簼籌粰糇糔紌紑紬絒絿綢緅緧緰緱繆繇纋绸缑缪罘罦羞羺翏翵耧耬耰肍肬脙脜脩腬膒膢臹舟艀艘艛艽芣
芤芻苬莍莤莸菆菗萩萮葇葔蒌蒐蒥蒭蓃蓅蓚蓨蓲蔞蕕薵薷藰蘨虬虯蚘蚯蚰蛑蛔蛕蛷蜉蜖蝚蝣蝤蝥蝵蝼螋螻蟉蟊蟗蟭蟱蠤袧裒裗裘裯褛褠褸觓觩訄訅訧詶調諏謀謅
謳譸讎讐讴诌诪诹调谋貅賕賙赇赒赳趜趥跾踌蹂蹓躊軁軥輈輏輖輶辀逌逎逑逰週遊遒遛遱邮邱邹郖郮郰郵鄇鄋鄒鄹鄾酋酘酧酬醅醔醧醻釓釚鈎鉜鉤鉾銂銗銝銶鋀
錇鍒鍪鍭鍮鎀鎏鎦鎪鏂鏅鏉鏐鐂鑐钆钩锫锼镏镠阄陬雔雠雺霌鞣鞦鞧鞪鞲鞻韝頄頭颩颼飀飂飅飍飕飗餱餾餿饈馊馏馐馗駀駠駵騆騥騪騮騶驑驫驺骉骝骰骺髅髏髟
髤髹鬮魗魷鮂鮋鯄鯈鯦鯫鯸鰇鰌鰍鰡鰷鰸鰽鱃鱐鱿鲉鲦鲰鳅鳩鴀鴎鴾鵂鵃鶔鶖鶹鷔鷗鷜鸠鸥鸺鸼鹙鹠麀麍麰黀鼽齁齱齺龜龝龟𠀈𠂈𠃕𠃖𠃳𠄓𠄗𠅓𠈅𠗈𠗽𠘳𠚠𠚴𠛎
𠛩𠜉𠝽𠞭𠠐𠠳𠢔𠣘𠥨𠧠𠧴𠨦𠮫𠰋𠱑𠲴𠳴𠷎𠹝𠾇𠾉𠿈𡀑𡂛𡆏𡇀𡇧𡈰𡈵𡊣𡋧𡔨𡕐𡕪𡗁𡜨𡞥𡟞𡺖𢀙𢁀𢂁𢃱𢄠𢆶𢇕𢈝𢈾𢉕𢊒𢋣𢎥𢏝𢏭𢒒𢒝𢒯𢒷𢓕𢓿𢕦𢖟𢘄𢛃𢜥𢜴𢝊𢟅𢤐𢦎
𢭆𢯱𢴼𢷶𢽧𢿚𣀓𣁨𣁭𣂮𣂻𣏞𣔹𣕌𣘛𣙻𣞗𣟑𣠚𣣠𣣡𣧝𣪌𣪐𣫐𣫬𣭳𣮬𣱳𣲖𣹭𤂆𤄘𤆀𤕾𤘜𤙘𤙤𤚔𤝈𤟦𤤧𤥗𤪎𤫕𤫱𤳝𤳠𤴥𤴦𤴪𤶖𤸈𤾊𤾒𤾦𥀫𥀭𥃧𥄓𥅪𥆖𥆦𥈑𥉝𥋜𥌆𥏈𥑸𥒫
𥔻𥚦𥞼𥠃𥠷𥡀𥣯𥥽𥧷𥫷𥬉𥭑𥯞𥰛𥰞𥰣𥱸𥲅𥴴𥵬𥶅𥶈𥹷𥺝𥺣𥻤𥽟𥾓𥿦𥿵𥿺𦀠𦂐𦂕𦃓𦃤𦄓𦆘𦊦𦊾𦊿𦍭𦎹𦑚𦑸𦑾𦚥𦞕𦟤𦡴𦢩𦩷𦪋𦫶𦬅𦬖𦭴𦭷𦭸𦭺𦮹𦰪𦱱𦱲𦳧𦳷𦵩𦵵𦷿𦸙
𦺎𦺵𦽋𦽬𧀥𧁾𧂦𧃨𧅘𧇟𧉈𧋲𧌌𧍘𧍟𧎄𧎻𧏋𧏓𧐟𧒔𧔨𧔭𧔳𧖚𧠾𧡸𧡹𧢃𧣕𧣷𧤕𧧔𧮶𧮻𧯞𧯠𧯤𧰃𧰰𧲰𧳫𧳶𧳹𧺤𧻖𧻱𧼵𨁋𨃘𨉜𨍊𨏺𨑫𨒊𨗰𨘁𨘵𨛕𨜗𨜛𨝮𨞪𨟽𨡑𨡲𨡻𨤷𨥨𨦜
𨦞𨦰𨲒𨳊𨴍𨷁𨷩𨸙𨺧𨻻𨽁𩃺𩏶𩒔𩒮𩔡𩔸𩔻𩗕𩗚𩗩𩘈𩘋𩘓𩘠𩘭𩘿𩙡𩚭𩛢𩡎𩢞𩢫𩢮𩢸𩤹𩥘𩭓𩭘𩮃𩮄𩮶𩮷𩮸𩱼𩲍𩳈𩳎𩵍𩵠𩶢𩶣𩸐𩹊𩽀𩿬𪀖𪀪𪁞𪃂𪃶𪅳𪅺𪆱𪇘𪇯𪉘𪍗𪎣𪎨
𪑻𪓰𪕚𪘆𪚭𪚺㗀㘳㡚㥑㧃㮲㱊㱗㲣㳊㳰㴗㸨㹯㻓㻲㿡䆋䆶䉩䉱䋺䎇䏫䐐䐰䑼䗏䝗䡭䤹䦰䧓䧱䨂䬌䬲䮌䲥䲫䵸""",
    1,
    26,
    12,
    26,
]

qb27 = [
    """㓎㕂㕋㕴㖗㚞㜄㜦㝝㞤㞥㦗㩒㪛㸒㻸㽸䃡䅾䋕䋮䋻䌾䍼䑣䒞䔷䕾䘳䚾䛘䣾䤁䤃䤟䥅䥆䦦䨙䪩䫐䰼䲋临乑今任侌侵兂兓冞南参參叄叅吟唫喑噖噙噷噾埁埐壬妊姙婬
嬜寻尋岑崊崟崯嵚嵾嶔嶜幓庈廕廞心忱忴惍惏愔愖扲捦摿撍擒攳斟曑杺枔林桪梣森棽椮椹槮樳橝橬檎櫼欽歆汵沈沉浔涁涔淋淫深渖渗湛滛滲潯澿瀶灊烎煁燅燖玪
珡琛琳琴琹璕瓭甧痳瘎瘖砧碄碒碪祲禁禽穇穼笒箖箴簪簮紝紟絍綅綝纴罧耹肣臨芩芯荫荶莐菳葠葴蓡蔘蔭薓蚙蟫蟳蠄衾衿襂襑襟訡訦誛諃諶谌賝軡郴鄩酙金針鈂
鈊鈓鈙鈝銋鍖鍼鐔鑫针钦镡闇阥阴陰隂雂霃霒霖霠霪靲音韾駸骎鬵魫鮼鱏鱘鱵鲟鳹鵀鵭鷣黅黔黚𠂟𠓿𠘅𠪚𠰇𠻝𡻫𢂨𢉩𢒫𢗀𢠝𢦊𣆲𣇰𣊖𣎟𣓆𣟹𣡎𣪄𣸊𣽮𤃺𤘣𤙖𤙣𤛧
𤣶𤥓𤫨𤴽𤷏𤹛𥍯𥤷𥥍𥥿𥪘𥫹𥮍𥳍𦁍𦅀𦊃𦜊𦰸𦸂𦸮𦺘𧡬𧯃𧳉𧹩𨁊𨆃𨊳𨓮𨙽𨛣𨟏𨱼𨼔𨾰𩀿𩂢𩅌𩅨𩖣𩖰𩤿𩱬𩻛𩾽𪁏𪇳𪈁𪑙𪒭𪒯𪔏𪕁𪖼㑴㘰㝷㠁㪸㴱㾣䃢䜷䜾䨧""",
    1,
    27,
    13,
    27,
]

tj28 = [
    """㑣㓓㓧㕘㖤㜞㞩㟏㟔㨻㴷㵅㶰㷋㼨㽎㽑䅖䆱䆾䇞䈄䉡䊻䌠䍀䎏䐶䑙䔜䗝䗞䘶䜖䜙䟃䣟䣠䤴䥁䨄䨡䨬䫮䰐䳺䳻䵇䶃三佄侽倓傪儋儑儖兂函凾南厂厰厽参參叄叅含唅
啉啽喑喒嘾噡噾圅坍坛坩埮堪墰墵壜妉姏娢婒婪媅媕媣嬠岚嵁嵅嵐庵弇弎惏惔惭愖慙慚憛憨懢戡抩担探撍撖擔昙晗暔曇枏柑柟梒楠橝欦欿歛毵毶毿汵泔浛涵淦渰
湛潭澏澹灆炶燂犙玵璼瓭甔甘甝男畘疳痰痷盦盫眈瞫礛礷笒筨篮篸簪簮籃粓緂繿罈罎耼耽聃聸肣腤腩臜臢舑苷荨莮菴萳萻葊葻蓝蓡蓭蕁藍藫蘫蚕蚶蜬蝅蟫蠶蠺裺
褴襤覃誝談諳諵謲譚谈谙谭谽貪贪躭邯郯鄵酖酣醈醰鋡錟錾鏨鐔鐕鐟锬镡闇雂雸韽韾頕頜頷顃顄颌颔餤馠馣驂驔骖鬖魽鳹鵪鵭鶕鹌龕龛𠗙𠗴𠝲𠤮𠤾𠦊𠰖𠹆𠽪𠿑𡅄
𡇜𡖓𡡖𢁘𢅀𢅡𢇧𢇰𢉧𢊓𢔈𢦟𢪈𣀯𣅟𣋣𣘞𣚖𣢅𣢌𣢟𣢺𣣭𣬛𣵷𣸙𣹢𣽯𤊼𤐔𤮽𤯌𤱣𤸕𤽲𥜓𥩒𥰨𥹠𥼟𥼮𦅼𦗡𦙇𦜆𦧏𦧖𦨸𦪜𦶈𦸁𦼎𧀻𧂇𧉂𧡪𧣁𧣹𧩸𧫥𧭃𧭻𧮰𧮳𧰘𧵊𧹣𧼖𧽼𧾲
𨅏𨊔𨝸𨞷𨬒𨴘𩀧𩄙𩈖𩈣𩈵𩈻𩑟𩔞𩔵𩖦𩚣𩚵𩡝𩢨𩪺𩯑𩹴𪁟𪉷𪍵㘛㘱㚮㛺㤌㤷㰫㳩㴂㴠㽍䏥䣻♂""",
    1,
    28,
    14,
    28,
]

yj29 = [
    """㝺㡘㡨㢘㤿㦰㰊㲯㶄㶣㼓㾾㿕䀋䁠䅧䆂䈤䉷䏦䑎䑚䕭䙺䛁䪜䫇䬯䵌严亷仱佔佥偣僉兼冿劆匲匳占厃厌厭厳呥噞噡嚴堿塩壛奁奄奩妗婖嫌嬐嬚孅尖岒崦嵰嶖嶦帘幓
幨廉彡忴忺恬恹惉慊憛憸懕懨扲拈拑挦掂搛撍撏敁暹杴枏枮柟棎椠楠槏槧檐檶櫩櫼歼殗殱殲沾淹添渐湉溓漸潛潜濂濓濳瀐瀸灊炎炏煘熑熸燂燅燖燫爓猒玪甛甜痁
瘎盐瞻砭硷硽碱磏秥稴笘签箝簷簽簾籖籢籤籨粘綅縑纎纖纤缣耹肷胋腌膁臁舚苫菾蒹蔪蔹薕薝蘝蘞虃蚙蚦蚺蛅螊螹蟾蠊衻袩裣襜襝襳覘覝觇詀詹誗諚謙譣譧譫讇
讝谦谵軡酟醃針釤鈐鉗銛銽鋑鋓鋟鍁鍼鎌鐥鐮鐱鑯针钐钤钳铦锓锨镰閆閚閹閻闫阉阎阽雂霑韯韱顃餂餍饜馦髥髯鬑鬵鮎鯰鰜鲇鲶鳒鳹鵭鶼鹣鹸鹼鹽黇黏黔黚𠌲𠓌
𠔨𠝢𠟧𠠃𠫘𠬾𠯍𡝫𢁮𢅏𢉘𢋔𢌍𢓒𢖩𢘁𢤍𢦺𢧥𢹚𣀃𣝈𣞘𣡶𣰷𣲀𤉌𤍖𤎥𤖝𤱋𤲩𤾲𥕼𥖝𥟕𥡝𥤟𥭔𥲥𥴿𥶕𥶿𦆆𦋰𦕒𦖎𦖾𦢙𦧐𦧒𦳇𦴑𦷙𦺭𧂞𧊨𧐲𧔷𧞬𧣑𧨾𧵻𨎷𨐩𨗦𨣻𨦄𨨱𨬁
𨱫𨷽𩄡𩆯𩏩𩬑𩬚𩱆𪂈𪆻𪌩𪏁𪏂𪏉𪏋𪐇𪐋𪐻𪖳𪚮㔐㬲㷿㺤㽐㿌䄡䆎䊱䋬䘂䘋䦓䯭䯹""",
    1,
    29,
    14,
    29,
]

xm30 = [
    """㔆㔋㘅㘙㛾㠶㢛㮀㮭㰹㴀㺥䀐䂁䉷䒦䕔䖗䛸䜛䟰䤫䧯䪌䫡䭵䲗䶠䶢严儳凡凢凣凲函凾劖厱厳咸啣喃喦嘇嚴嚵圅壧娚尲尴尶尷岩崡崭嵌嵒嵓嶃嶄巉巌巖巗帆幓彡忛
掺揞搀摻攕攙杉杋杴柉椷檆櫼欃毚氾沨淊渢溓獑玪瑊甉监監碞磛礛礷礹稴穇站篏緘縿缄羬肷膁舤舧艬芟葴螊衔衘衫覱詀諴諵譀譧譼讒谗趈輱酁醎釤銜鍁鏩鐥鑱钐
锨镵颿饞馋髟魐鰔鰜鳒鵮鹐鹹麙麣黬黯𠆩𠣄𢖋𢽝𣔶𣗸𣢬𣢲𣤱𤘇𤟟𤥙𤪋𤿷𥊀𥌈𥻧𦑘𦨲𦳫𦽭𧇱𧈁𧕃𧛄𧛡𧥓𧦟𧬌𧴃𨂝𨊝𨏪𨙮𩁺𩃔𩆷𩈯𩌰𩓟𩖌𩝈𩤥𩩴𩪢𩽝𪂶𪒹𪓄𪔩𪖎𪗂𪚃
㗸㩥㰇䑺䘖䩂䩇䶨""",
    1,
    30,
    14,
    30,
]

ds31 = [
    """㖦㛚㢔㣚㨂㪌㬴㳆㴳㶹㷓㷯㹅䀧䂢䉥䋽䐥䞒䡁䩬䭰䳞䵔䵜侗倥偬傯働儱动動勜勭唝唪嗊嗡垌埛埲塕墥姛嬞孔嵡嵷嵸巃巄幪庬徿总悾愡愩憁懂懜懵拢挏捅捴揔搃摠
攏晎暡曚桶棇槦樬檧汞洞滃漨澒熢玤琣琫眮瞈硐空竉笼箽篭籠統綂総緫縂縦縱總繱纵统翪聬苁莑菶董蓊蓯蕫蝀蠓詷諌郺銾鞛鬷鸏鸗鹲龓𠂳𠳃𡾼𢤱𢦅𢱤𢳾𢼦𣏺𣽝𣿅
𤌏𤤲𤫬𤯻𥀂𥨐𥳘𦂌𦕷𦞡𦡂𧄓𧋔𧑑𧽿𨈹𨎢𨢣𨴏𩌌𩑚𩒓𩒴𩕉𩕱𩗴𩡓𪌢𪐈""",
    2,
    -1,
    -1,
    31,
]

ds32 = [
    """㓋㙙㡖㣫㤟㤨㦶㦷㧬㩳㭟㲝㷏㺬䂬䙕䞻䟪䢇䩸䱋俑傇傛傱冗冢勇勈喠坈垄垅埇埫塎塚壅壟壠奉媑宂宠寵尰嵱嵷嵸巩廾彮忷怂恐恟恿悀悚惥愑愯愹慂慫拥拱拲捒捧
搈搑擁栱歱氄汹洶涌淎湧湩溶漎煄珙甬瘇硧种種穁竦筩縙耸聳肿腫臃苁茸蓯蛩蛬蛹衶覂詾跫踊踴踵躘軵輁重陇隴鞏駷鮦鰫鲖𠬞𠰽𠳀𠹍𡊸𡖢𢀜𢇫𢖗𢛒𢝆𢥠𢦿𢸁𢹬𣨞
𣯍𣯏𣲽𣹞𤘺𤘻𤬳𤮪𤺄𥑅𦈩𦑝𦓈𦓳𦔉𦔋𦦧𦧁𦶇𦶐𧉡𧖇𧗴𧝮𧻹𨋑𨍅𨍷𨒆𨓨𨣂𨴭𨿿𩋮𩒘𩚗𩜳𩟀𩩳𩲧𪐃𪕎𪗴㕳㨣䘴䢆""",
    2,
    -2,
    -1,
    32,
]

jl33 = ["""㭋䁰䂜䎧䐟䖫䬕䰷傋傟勜夯庬慃控棒棓港漎玤硥稖缿耩蚌蜯講讲項顜项𠈵𠏨𠨵𢞡𢠷𢮏𢴦𣘙𣫳𥊾𦫫𦺣𪚢""", 2, -3, -2, 33]

vi34 = [
    """㓼㔳㕜㕽㖐㙼㚓㚡㚶㜫㜽㞆㞔㞛㞦㞨㠖㠧㠯㠱㠲㡶㢁㢋㢮㣥㥨㥴㧗㧡㧪㨊㩓㩘㪜㫊㫑㫖㭒㰝㱀㱟㲛㲹㵦㶴㷃㷐㸚㸵㸻㹝㹬㺭㾅㾖䂠䂡䃣䃽䃾䄎䄫䅩䇃䇛䈧䉂䉝䊓
䊼䋙䍯䍴䎣䏡䏢䐯䑛䒨䒻䓈䔂䔺䗁䘡䘣䘦䚞䚟䚦䚹䛏䛗䛶䛼䝐䝰䞨䟖䟗䠋䠑䢄䢳䣀䣥䤆䤏䤚䤥䦵䦻䧉䧧䧽䫯䭉䭧䭲䯝䰙䳅䴎䵋乨仔仕以仳企伱伲伳似佀佁佊佌你
佹使侈侎価俚俟俾俿倚偫傀傂儗儞儰兕兘几剞劧匕匜匦匭卶厎厬厽只史吇吡否吱呰咪咫哆哩唎唏唩唯啙啚喜嘴噧噽噿嚭圮址坁坘坭坻垁垑垒垝壐壘壝壨士夶奀妀
妓妣姉姊始姒委姼姽娌娝娰婍婢媄媺嬍嬟孈孊子孴宄宩寪尒尓尔屎屣履屺岿峐峙峛峞峢峲崣崥崺崻崼嵄嶉嶏嶬嶰嶲巂巋己已巳市帋庀庋庤庪庳廌弛弥弬弭彌彼徙
徛徥徴徵恀恃恉恑恥悝您惢惿愢憘憙懝戺扆扺技抁把抧抳抵拞拟拸指捶掋掎揆揣搋撱擬攦攱攺敉敼旎旑旖旨是昰晷暿朹机朼杍李杝杞杫枇枲枳枾柀柅柿栮梓梩棰
椅椯榟樏橤檓檥檷櫐欛欼歖止此歭歯死毀毁毇比氏氐水氿汜汦沇沘沚沝沵泚泤洈洍洔洠洧洱涘淽渳渼湀滍滓漇濔濢濻瀡瀢瀰灅灖煃燬爾狔狧猚玺玼珥理璻璽瓕甤
畤畾疕疻痏痔痞癸皉盀眂眎眡矖矢矣矷砋砥硊礒祀祉祪禩秄秕秠秭秲竢笖笫笶箠簋籽粃紀紙紫累絫綺縰繠纍纚纪纸绮羋美羛羠耔耜耳耻聛聻肔胏胣脴腂膸臎舐舓
舣艤芈芑芓芔芛芷苡苢茋菙菧萎葈葞葸蒍蓰蓶蔿蕊蕋蕌薳薾薿藟藢蘂蘃蘤蘬蘽虆虸蚁蚔蛫螘蟡蟢蟻被袲袳裏裡裭裿褆褫視视觜觤訨訾訿詭誃誄諀諈諟諰譩譭讄诔
诡豕豸貏起趡趾跂跐跪跬跱跽踓踦蹝蹞躧軌軹輢轨轵迆迤迩迱逘逦邇邐邔鄙鄬酏酾釃里釨釲鈘鈢鈮鈰鈶鈻鉂鉃鉨鉩鉹鋅錡铈铌锌锜镾阤阯陒雉雟靡鞁鞞頍飺餌饵
馜駛駬騃驶骩骪骫骳髀髄髓鬼魮鮪鯉鲔鲤鴙鴲鸓麂黹齒齮齿𠂔𠂕𠃭𠊤𠍨𠐌𠑾𠒃𠒅𠓡𠔒𠕝𠘪𠛔𠝨𠡸𠤘𠪙𠬈𠭋𠮡𠮯𠱓𠲿𠳎𠷏𠼠𡂗𡉗𡖳𡙑𡺓𡺮𡻭𡻱𡿉𢀪𢁓𢃯𢃰𢅟𢇨𢊁𢊚
𢊯𢏅𢒩𢒲𢓗𢖬𢘺𢙇𢛍𢞞𢦕𢩒𢰙𢳋𢷔𢷸𢸦𢹮𢻉𢽃𢽗𣆘𣔓𣖨𣛚𣡋𣡺𣢪𣣑𣥮𣯪𣲂𣲵𣷾𣸆𣻞𣿞𤆙𤆰𤉏𤉡𤌋𤘧𤙌𤜝𤜣𤜻𤝳𤟆𤟧𤡂𤡧𤡪𤢹𤣱𤤱𤨐𤱸𤵬𤶓𤸓𤹦𤺉𤼒𤿇𥀘𥄇𥅔𥉙𥊪
𥍨𥏜𥏷𥑏𥒗𥒲𥔊𥙉𥜏𥞎𥥠𥪼𥫞𥫟𥫴𥫸𥬳𥯜𥯤𥰧𥲕𥶵𥷄𥿅𦆦𦈬𦐖𦐾𦕸𦗼𦙙𦚙𦞤𦢿𦮸𦯯𦰯𦰽𦱓𦳊𦳛𦸆𦸣𦼡𦽐𦿇𧀤𧃚𧃩𧄜𧉀𧊄𧊙𧌣𧔮𧙋𧛢𧛧𧣩𧣾𧧰𧰲𧰸𧱅𧲄𧲗𧳅𧳠𧵭𧺨
𧺼𧻜𨂠𨇻𨑭𨒤𨓦𨖎𨖹𨛋𨛎𨜐𨞘𨟂𨟵𨳋𨴯𨴻𨵂𨵋𨸝𨹀𨻆𨾛𨿐𨿛𩊛𩌦𩎉𩒐𩕲𩛆𩢑𩩛𩪦𩬫𩬺𩭐𩲢𩳓𩳲𩸟𩼂𩾠𪀗𪁩𪊋𪊍𪊢𪊨𪎔𪎦𪏇𪐄𪑜𪕔𪖥𪗧𪘃𪙴㿂䡄䢎""",
    2,
    -4,
    -3,
    34,
]

ww35 = [
    """㕈㞑㠕㥱㬙㹃䅏䇻䍷䒈䔇䕁䞔䤵䪘䬿亹伟偉偯几匪卉唏喡奜娓媁尾岂幾庡徫悱愇扆斐斖暐朏梶棐椲榧泋浘炜煒玮瑋篚膹苇荱菲葦蕜蘬虮虺蚁蜚蜰螘蟣蟻誹诽豈豨
鍏陫霼韑韙韡韪顗颹餥鬼魕𠆟𡌦𢯷𢾺𣍧𣸀𤈦𤛲𤸆𥑴𥒮𥟍𥠶𦃄𧉇𧕿𧢒𨟗𩃾𩄼𩏬𩗘𩗝""",
    2,
    -5,
    -3,
    35,
]

yu36 = [
    """㐨㑏㒜㘧㜿㞰㠘㠪㤖㦛㪽㵰㷂㿾䃊䇡䍆䑕䔓䖏䘘䘢䙘䝪䠂䢹䥏䦽䰞䶙与举予伫佇作侣侶俎儢処厺去叙吕呂咀圄圉坾垿墅壴处女姖宁寍寕寗寜屿岠岨峿嶼巨序弆怇
憷所抒拒挔挙捛擧敍敔敘旅昛暑杵杼柜柠梠椇椘楀楚楮榉橣檚檸櫸欅欤歟歫汝汿沀沮泞洰渚湑溆漵潊潻濋濐炬煑煮爼疋癙盨眍眝瞘础礎祣禇禦秬稆稰穞穭竚筥篽
簴籞籹粔糈紓紵紶絽緒緖纻纾绪羜耟肗胠膂膐與舉芧苎苣苧苴茹莒著蓹薴藇蘌處虡蚷螶蟝衙袓褚許詎詓詝語諝諿讵许语谞豦貯贮跙距郘鄦醑鉅鉏銣鋙鐻钜铷铻阻
陼雨駏魣鮔鱮麮黍鼁鼠鼡齟齬齭齼龃龉𠃥𠔔𠔖𠧖𡈞𡈴𡜃𡢒𡺐𡻢𢁼𢈚𢉺𢋂𢙲𢚻𢤫𢩄𢮁𣌬𣏗𣥐𣨝𤆼𤍓𤔋𤕞𤲑𤸀𤻃𤻇𤾺𥍝𥎗𥚩𥬙𥰠𥴧𥹍𥼪𦅷𦉐𦊐𦛗𦠷𦥉𦯅𦺝𧇽𧉞𧉧𧑓𧒑
𧕼𧜊𧣒𧣻𧰴𧺹𧽟𨂀𨋾𨣦𨨶𨵉𨹘𨺿𨼪𩂫𩉸𩩘𩰤𩵎𩿕𩿝𪀏𪁥𪂕𪋰𪏮𪐧𪓐㛎㭚㾔""",
    2,
    -6,
    -4,
    36,
]

yu37 = [
    """㐅㑄㑯㒁㒇㔪㔱㕆㕮㙑㙛㝢㡰㢚㦿㨭㬳㯭㲾㵭㵲㺄㼌㾈䀇䀯䀾䁈䁉䃖䄔䅓䅡䇠䇢䋠䋨䌗䒉䔃䗂䗄䛩䜿䝂䟼䡧䣁䥈䥘䧁䨒䨞䩉䪔䫍䭸䯙䲐䲧䶚丅下丶主乕乳五亩仵
伍伛估侮俁俌俛俣俯倵偊偻傴僂僱儛冔刯剖剫努匬午卤取古吐否呒咻唋喣嘸噜噳嚕圃圑土圡坞垭埡堵塢塷墲妈妩姥娄娬婁婟媽嫵宇宔寙寠岵峔嵀嵝嵨嶁帍帾庑府
庾廡弖弣弩怃怒怙愈慺憮戶户戸扈抌抚拄拇拊捬掳撫撸擄擼敄数數斔斞斧旿昈昫普暊暏暜杜枸柱树栩棝椇楀楛楰榘槴樐樦樹橆橹櫓武殕母氇氌沪泘洿浒浦溥溩滏
滬滷滸滹潕潽炷烳焤焸煦熓熩父牡牯玝珇珝珷琥琽瑀瑦甒甫畂畆畒畝畞畮瘉瘐瘔癒皷皼盙盬睹瞴瞽矩砫砮硵碔磠祖祜祤禹秿稌窭窳窶竖竘竪竬篓簄簍簠簿籔粗組
縷组缕罜罟羖羽聚聥肚股胟脯腐腑膴舞艣艪芏芐苦荰莆莽莾萀萭萮蒌蒟蓾蔖蔞蔰薣虎虏虜虝蚥蛊蛡蜅蝺蠱补裋補褛褸覩觰詁詡誧諩謱譕譜诂诩谱豎貐貗賈賭贾赌
跓踽躌軁輔辅邬郙部郶鄅鄔鄠酤醹釜釡鈷鏀鐪钴陚隖雇雨靯靻頨頫鬴魯鯆鰸鲁鳸鵡鷜鹉鹵麁麄麆麈麌麤黼鼓鼔齲龋𠄡𠐊𠑹𠕒𠕘𠕲𠘁𠟌𠥢𠯃𠰍𠱐𠿛𡉴𡍨𡜂𡞠𡞯𡟥𡡎
𡻮𡽂𢄓𢇛𢉜𢋡𢑟𢕓𢗫𢘃𢙁𢚪𢜮𢝳𢟧𢟨𢨂𢨥𢪦𢯺𢲸𢻀𢻲𢾀𣕉𣥋𣦩𣦭𣫻𣭇𣷶𣺀𤅱𤖬𤗃𤘐𤙭𤛏𤣰𤨖𤬪𤱌𤸗𤸼𤿭𥀁𥃾𥄷𥅄𥈋𥒰𥝟𥢍𥣌𥯔𥯶𥳖𥶇𦊘𦙴𦭯𦭳𦳅𦳭𦵿𧀦𧂜𧃒𧆢𧇈
𧇿𧉊𧉭𧌧𧎷𧞫𧟣𧫓𧬏𧱬𧴇𧵎𧵑𧽋𨈫𨑑𨖴𨙭𨛵𨝘𨡡𨨜𨴪𨵐𨶇𩂎𩄽𩇵𩍥𩏮𩏵𩒊𩒙𩒺𩠟𩡨𩩮𩯜𩳐𩵱𩾿𪂀𪂾𪈜𪉖𪉣𪋄𪋬𪚹乄""",
    2,
    -7,
    -4,
    37,
]

ji38 = [
    """㒅㙄㝥㡳㪆㪏㭽㯇㼵䋛䋜䌡䍤䏶䏿䑯䕥䗍䜁䡔䢑䣌䪆䫌䭬䯗䰦䱊体劙匸卟启呇呧唘啓啔啙啟坘坻埿奃娣媞底弟弤徯悂悌抳抵拞挮掋掜斉晲晵柢梐棨欐欚汦沵泚泥
泲洗洣济涕済澧濔濟瀰牴玼璾癠盠盻眫眯瞇礼祢禮禰米綮緹缇聜肶苨茋荠菧萕蒵蔝薺蜌蟸蠡蠫袳觝觬詆諬謑诋豊趆躰軆軧递逓遆遞邸醍醴鑈鑙闙阺陛隬骵骶髀體
鮆鱧鱭鱱鱺鲚鲡鳢齊齐𠃞𠈺𠨍𠯋𢓄𢣚𣀂𣀷𣈡𣉆𣧲𤙞𤝬𤞈𤽊𥎓𥞪𥪦𥰥𥴡𥹫𥻒𥽈𦪱𦪶𦫈𦰙𦰫𧅮𧋠𧙾𧤲𧦚𧧹𧨱𨂇𨄐𨌮𨠏𩉹𩋪𩍦𩪆𩯨𩰞𩷋𩽵𪀿𪂍𪏸𪓋""",
    2,
    -8,
    -3,
    38,
]

xp39 = [
    """㔥㗗㙰㚷㡁㢊㧳㵋䇑䉏䍉䒓䲒买嘪夥奶妳娾嬭嶰廌徥抧拐捭摆擺攋枴柺楷檞洒澥灑犤猈獬疓矖矮矲箉簤罢罫罷荬蕒薢蟹蠏襬襰觟解觧豥買躧躷鉙鍇锴駭駴騃骇鷶
𠁥𠎿𠏰𠢲𠦏𠿆𡾝𢄌𢅭𤁣𤝖𤝭𤞮𤢒𥍪𥎎𥏪𥞅𥩤𥸗𦎈𦥂𦥈𦫻𦫼𧡋𧣭𧲻𨼬𩍝𩩰𪑽""",
    2,
    -9,
    -5,
    39,
]

hv40_1 = [
    """㘆㤳㥒㱰㴓䁗䂾䆀䇋䈚䈢䌽䏁䑂䣋䮨䰂乃亥倍倸凯凱唻在垲埰塏婇宰宷寀岂崽嵦廼彩待忋怠恺愷扗採改暟欸歹歺殆毐海溾烸疓睬箈紿絠綵緿绐茝蓓詒诒豈跴踩軩
輆載载迨迺酼醢采鎧铠闓闿頦颏颽駘骀鼐𠄎𠄕𠎶𠧤𠷂𢉓𢋝𢍓𣖻𣦶𣪮𤌊𤗿𤷕𤸊𥁐𥂧𦐤𦠸𦶅𦷷𧑔𨊺𨎡𨡬𨱣𨽿𩘥""",
    2,
    -10,
    -5,
    40,
]

hv40_2 = [
    """㒑㒦㚍㞂㟎㠑㠥㨃㱣㱬㱱㵏㵽㷄㼍㼏㾼䃬䇏䊫䏨䔒䕇䜸䫥䫭䲎俀俖傀僓儡凂匯喂喛囘回囬娞嵔嵬嶊嶵廆廻廽彚悔挴槯檌櫑殨毎每汇洡浼浽湏滙漼潣灅烠燘猥琣琲
璀疿痐痱瘣癗皠碨磈磊磥礧礨罪聉脮腇腲腿蕾蚘蛔蛕蜖褽詴賄贿蹆辠迴逥錞鍡鏙鑘鑸陮隗頛頠頧顝餒餧餵馁骽鮾鯘鯦黣𠡒𡚗𡼊𡼻𡽁𡽕𡾋𢊛𢮇𢳁𢶓𣍟𣍺𣯧𣯯𣿒𥑶𥗬
𥪊𥴯𥼺𦇄𦓥𦞙𦞱𦢏𦶏𧤖𨍹𨝀𨪈𨹅𨻌𩇩𩗔𩬳𩲂""",
    2,
    -10,
    -3,
    40,
]

vf41 = [
    """㐱㔼㖥㖺㣼㥸㦏㨚㩈㬆㯸㰮㽙㾙㿤䀆䀕䂦䂧䇖䇙䊶䐃䐏䐔䑐䒡䝩䟨䦮䨶䪳䪾䫰䮞䲄亃侭侰偆傊僒僢僯僶儘允冺准凖刡勄吮吲哂喗嚍囟囷埨埻堾姫婜嬧尹尽屒嶙廴
引弞弫忍悯惷惽愍愪慜憫抎抮揗撛敃敏敐敯昣暋朕棞楯榫槇槙橉殒殞沇泯渳湣準潣濜濥牝狁獜玧畛疄疹盡盾眕眹睶矤矧磒祳稇稛稹窘笉笋筍箘箟箰箺簢簨純紖紧
紾絼綧緊縝繾纯纼缜缱耣聄肾胗脤腎膑臏舛芛荵荺莙菌萶蔨蚓蜃蜄蜠螼蠠蠢袗裖覙訠診诊賑賰赈踳軫轔轸辚辴鈏鈗鋠鎨閔闵阭陨隕隼霣靷頣頵顖馻駗髌髕鬒鯅鰵
鳘鵘鶣鶽麎黰黽黾𠄈𠘱𠳁𠻨𡓣𢏈𢏦𢼖𢾎𣝌𣬻𣱽𤛎𤷌𤺖𤿕𤿳𥅘𥇘𥎪𥬐𥵧𥿜𦁄𦃢𦌡𦓾𦜜𦫮𧁋𧉃𧠝𧲃𧵬𧼒𨌲𨏤𨐐𨒦𨓇𨺠𩆆𩒈𩬖𪄴𪍁""",
    2,
    -11,
    -6,
    41,
]

wf42 = [
    """㗃㞸㥹㦩㹏㻒䆬䌍䌥䘆䞫䠴䤺䨸伆凕刎勽卺听吻呅呡喗坋坟墳夽嶾巹弅忿恽惲愤愪憤抆抎抿揾搵攈槿檃櫽歾殷漌熉瑾瘾癮磤秎粉緼縕缊聴聼肳脗膹菫蕰蕴薀藴蘊
蘟蚡褞謹讔谨賱赾近隐隠隱韞韫魵黺齓齔齫齳龀𠃊𠵮𢅯𢉦𢚅𢛦𣱉𤔌𤡕𤰪𤻘𥬼𦝮𦟕𦮶𦶚𦾻𧯷𨏈𨸩𩸂𪏔𪏚𪏴𪘩𪙟""",
    2,
    -12,
    -6,
    42,
]

rr43_1 = [
    """㔓㨴㫃㬉㱧㽜㿸䅋䅚䊎䎡䑱䘼䛀䛷䜝䜢䞁䡊䤷䩊䪭䳃仮倇偃傿匽反咺喛圈圏坂堰墕夗夘奆妴娩婉媗嬎宛寋岅巘巚幰愃愝挽揵搟攇晚晥晩晼暖朊桳梚梡楗橎沅湕烜
煗犿琬瓪畹皖盶睕箢綣綩緩绻缓脕苑菀葂薳虇蜿蝘褗踠蹇躽軬輓輽返远逺遠邧鄢鋔鋺錪鍵鑳键阪阮飯飰饭鯇鯶鰀鰋鰎鲩鶠鼴鼹𠍛𠹖𡇺𡈓𢚺𣉖𣳲𤗍𤼂𥍹𥍻𥩗𥿎𦐰𧚇
𧡩𧥛𧥜𧨸𧸿𧽉𧽞𨙨𨸘𩊁𩐘𩔃𩷑𩻖𪋅𪐂""",
    2,
    -13,
    -7,
    43,
]

rr43_2 = [
    """㖔㙥㝧㡷㤓㨧㮥㯻㵍䁚䃂䅙䅰䐣䓳䔿䙛䚠䛰䜇䠅䧰䫟䬱䵯丨伅佷倱僔刌吨呠喗噂噸坉垦墾壸壼壿奙婫峎崸庉很忖恳悃惃懇捆损掍損撙暪本桳桽梱棍棞楍氽沌泍浑
混渾滚滾潡焜狠獖畚盾眃睔睴硱碖祵稇稐稛稳穏穩笨綑緄緷绲翉翸腞苯菎蓘蔉衮袞裍觨詪譐豤趸踲躉輥辊逇遁遯錕锟閫閸阃鮌鯀鱒鲧鳟黗齦齫齳龈𠟃𠱜𡁋𡈋𡈧𡘝
𢡆𢥽𢬼𣄏𣮎𤲙𥖞𥢊𥢎𥦊𥧚𥫱𥭒𦃕𦓼𦠆𦠺𦢐𦫎𧣢𧿗𨁉𨋒𨡫𨼯𩑔𩒝𩨫𩨬𩩌𪊜𪎝""",
    2,
    -13,
    -6,
    43,
]

hj44 = [
    """㣪㦌㦖㦨㪔㫁㫜㬊㼝㼫䂎䄤䉈䉽䌣䍐䍑䏓䓍䕀䗆䘾䛞䝹䞡䠪䦎䦔䩥䩪䪀䬳䲌䵟亶伞伴但侃偘傘刐匴卵厂厰唌坢坦埦奤嬗嬾孄孏嵈忄悍悹悺惮憚憻懑懒懣懶拌捖擀
攋散断斷旱暵柦梡棵椀欵款歀泴浣浫満满滿潬潵澣灗灡焊焌煖燇狚猂玬琯璭璮瓉瓒瓚瓪畽疃疸痪痯瘅瘓癉皔皯皽盌盥睕短碗祘禶秆秚稈穳窽窾笴筦筭算管篹簳粄
糤糷綄緩繖繟繤繵纂纉纘缓缵罕脘舘芉蔊藧蛋蜑衎衦袒裋襢觛誕诞赶趕趱趲跘輐輨酇鉡錧鏋鏾靼館饊馆馓駳𠢇𠥘𡙘𢀵𢅒𢆦𢋃𢕫𢭃𢴪𢷖𣀧𣃔𣇙𣋊𣘠𣠭𣢻𣱍𣴼𣽟𤀣𤃬
𤢏𤩨𤺺𤼢𥟓𥠁𥤱𥬈𥲈𥶍𥾍𦅻𦋪𦑛𦙉𦛤𦜐𦷻𦺻𦾮𧖵𧰪𧱄𧶲𧹳𨁄𨰭𩈦𩎒𩑰𩒢𩗤䟎丆""",
    2,
    -14,
    -7,
    44,
]

uj45 = [
    """㟞㡾㦃㫱㯆㸧㹌㹽䁂䎒䐮䦘䩆䱠䴼丳产僝僩僴刬剗剷唍娨嵼嶘戁拃拣捾揀摌撊撰攌昄晘晥暕板柬栈桟棧橌浐滻潸澘版琖瓪產産皖盏盞眅眼睅睆睌矕硍碊简簅簡綰
绾羼舨莞蝂譔赧輚轏醆鈑鋎鏟钣铲闆限驏骣魬鯇鯶鰀鲩𠁷𠏇𠧫𠴡𣛷𣥞𤄒𤖆𦈻𦏹𦣾𦸰𧆏𧚁𧠆𧲮𧹞𨂪𨄉𨐦𨠹𨩧𨪑𨵬𩆤𩈑𩈶𩔊𩥮𩻝𪗙𪗤𪘪𪙞""",
    2,
    -15,
    -7,
    45,
]

xm46 = [
    """㒄㓴㔊㔵㕣㙉㛯㜊㜻㞡㠭㣤㥏㥝㦓㦚㧋㧥㨠㨵㨺㩃㬎㭠㮟㱛㲢㵷㶍㷷㸁㹂㾌䀎䁴䁵䄯䅐䆓䉸䍾䎒䏹䐌䓣䓦䓴䗺䗾䙇䚚䛇䛒䞂䟢䠄䡢䡱䢾䤄䥀䥪䧋䧖䧘䧠䩅䩙䭤䮿
䱇䱼䵐䵡䵤丏件俛俴倎偭僆僎僐僢僤免兖兗典冁冕刬剗剪剷剸劗勉勔匾单単卷吮呟咞哯唺啴善喕喘單嘽囅囝圢圳垷埍堟堾墠墡奵姺娈娊婰媆媔嫣孌孨宴寋尟尠展
岘峴嵃巘巚巻帴幝弿悿惼愐愞戩戬戭扁抁抮挸挽捲揃揙搌搴摙撚撰攓敟显晛晪枧栈桟梘梿棧椫椼楗榐槤樿橏橪檽櫣歂殄毨汅沇沔沴泫洗浅涊淟淺渳渷湎演潣瀽灦
烍熯燀燹牑犬狝狷獮琄琏琠瑌瑐瑑璉甗甽畎痶癣癬皽眄睍睓矈矊矏碝碥磰礝禒竱笕筅筧箲篆簐糄絸緛緬緶縯縳繟繭繯繾缅缱缳羂翦耎脔脟腆腨腼膞膦臇臔臠舛艑
芇茧荈莬菤萒蒃蒇蔩蕆蕇藆藊藓蘚蚬蜆蜎蜓蜵蜸蝡蟮蟺蠒蠕衍褊襈襺覑覥覵觍詃詪誢諓諞謇謭謰譂譔譱譾讌讞谝谫谳豍豣貵賟贙赻趁趂趼跈跣践踐踳踹蹇蹍蹨躎
軟転輓輦輭輲輾轉转软辇辗辡辧辨辩辫辮辯选遃遣選鄟鄻醼鉉銑銭鋔鋧錢錪鍌鍵鍽鏟鑳钱铉铣铲键閳闡阐隽雋靦鞙鞬韅顈顕顯餞饯馻鬋鮮鮸鱄鱓鱔鱣鱻鲜鳝鳣鴘
鶣黽黾齞齴𠋷𠐻𠓫𠔓𠔰𠗋𠗘𠟉𠠁𠢣𠣇𠨎𠩷𠳋𠹟𠻤𠽱𡄓𡇰𡈯𡒌𡒧𡾮𡾰𡿨𢂄𢃮𢅺𢆞𢋄𢍫𢘧𢥌𢩀𢭥𢯼𢱟𢷑𢷹𢻅𣂵𣃅𣃘𣇖𣎓𣟲𣠷𣡗𣧾𣸋𣼠𤀫𤁥𤂤𤑿𤓤𤚍𤣔𤪪𤮍𤰝𤲖𤲗𤷃𤻶
𤿶𥀹𥊶𥌭𥎘𥜦𥜲𥢇𥣝𥥾𥧬𥬫𥮏𥯦𥯬𥳐𥳟𥳫𥳷𥴐𥵶𥶷𥾝𦁆𦁙𦂇𦅋𦆀𦊌𦓝𦝏𦬛𦭶𦺍𦺲𦺾𦼱𧀇𧂍𧅆𧈪𧊔𧌎𧍒𧍢𧍿𧎰𧔡𧕇𧕲𧖉𧖙𧗸𧝑𧠒𧡚𧡢𧨩𧪯𧬫𧮈𨄔𨆁𨊼𨋚𨍞𨐾𨒄𨒩𨔢
𨙡𨟺𨡁𨡏𨴞𨵭𨷱𨹆𨹻𨺥𨼒𩃚𩈍𩉁𩉄𩉥𩊫𩋠𩎍𩏈𩘍𩝚𩟥𩠹𩨡𩩯𩳏𩶤𩸃𩽜𪉱𪍦𪍶𪐍𪖯𪘦㮒䱧""",
    2,
    -16,
    -7,
    46,
]

xc47 = [
    """㒟㜵㝋㝔㟱㟽㠡㡑㡽㣿㨄㩰㪕㫏㫐㭂㴭㵘㵱㵿㸠㹓㹛㹾䁏䂪䂽䃵䄦䄪䆞䈃䉆䍮䏚䑠䒕䒚䔸䘨䙚䙼䚩䥞䥵䦊䩍䮍䯚丿了仦仯仸佋佻偠僚兆剽剿劋勡勦吵垗墂夭娆娇
婊婹嫋嫍嫽嬈嬌嬝嬲宎宨小少尞屌岆崾巐巶悄愀慓憭扚扰抭挑挢掉摽撟擾敫敽敿旐昭晀晈晓暁暞曉曒朓朻杪杳枖柖柼标楢榚標檦殀殍沼淼渺湫湬溔煍燎爒狣璙璬
皎皛皢皦皫眇眑眧瞟瞭矫矯祒秒窅窈窕窱筱筿篎篠篻紹絩綤緲縹繚繞繳绍绕缈缥缭缴肁肇肈脿膘舀芺苭莩菬萩蓔蓼蔈藐藠藨蟜表袅袑裊褭褾訬誂諘謏譑賋赵趙蹻
遶鄝醥釕釥錶鐈钌镽闄隢顠駣騕髜鮡鰷鰾鱎鲦鳔鳥鴢鷕鸄鸟麃麅麨鼼𠄏𠒰𠒸𠞰𠠄𠧞𠬪𡘏𡙎𡛙𡝋𡝒𡡺𢁕𢄦𢄺𢅎𢒾𢖈𢶑𢸣𢹎𢻟𢿞𣎸𣏑𣟊𣧦𣳭𤃭𤕷𤙔𤱩𤲶𤽳𥉒𥎺𥕾𥗀𥤂
𥤣𥤹𥹶𥾇𦄋𦖀𦗵𦢺𦥝𦭼𦯪𦳥𦾷𧂀𧂈𧎸𧘈𧘝𧜣𧝪𧠽𧡜𧡼𧢄𧢬𧩮𧳀𧳨𧳻𧴎𧴕𨅣𨇄𨖵𨙹𨝰𨣀𨱧𨴡𨶟𨽖𩋙𩨴𩩼𩬗𩭑𩵖𪃐𪃦𪄼𪅃𪅝𪈼𪌀𪍑""",
    2,
    -17,
    -8,
    47,
]

yc48 = [
    """㑃㑤㑿㕚㚣㚹㚽㥮㩭㶤㺐㽱䀊䎐䕧䝖䝤䭋䲾䶧佼卯吵咬啮噛嚙姣媌嫹孢巧怉戼找抝拗挍挠捁搅撓撹攪昴橚櫹泖泶澩灚炒烄焣煼爪狕狡瑵笅笷筊絞緢绞臫茆虠蚫鉸
铰鞄頝飹飽饱骲鮑鲍鴢齩𠕖𠕧𡂟𡜢𢁬𢨯𢩨𢯴𣭺𤉧𤶀𥂨𥄸𥅟𥇟𥳴𦕏𦬔𦯆𧧠𨈘𨸑𨺸𩈎𩛞𩱈𩱦𪊷""",
    2,
    -18,
    -8,
    48,
]

hc49 = [
    """㑎㙅㚏㚖㚼㛐㛮㛴㝀㠀㤇㧇㧯㨶㬶㵆㺁㻄㼥㾸㿒䆃䇭䎂䒃䕩䖣䗢䝤䧚䮻䯠䯪䯫䲃䳈䳓䳰䴈䴐䴠䵏䵚丂佬保倒傐劋勽匘咾噵埽堡堢壔夭夰套好媢媪媼嫂嫐宝寚寳寶
屮岛島峼嶋嶌嶹忑怉恅恏恼悎悩惱愺憹懆懊扫抱拷捣捯掃搗擣攷早昊昦晧暠暤暭曍杲枣栲栳梍棗椺槀槁槄橑檺殀洘浩涝淏滈潦澇澔澡瀥灏灝烤煰燠燥狣狫珤瑙璅
璪皁皂皃皓皜皞皡皥皫碯祮祰祷禂禞禱稁稲稻稾稿窎窵筶簝糔絩緥縞繅繰纛缟缫缲老考聕脑腦艁艸芺草荖菒菢菿葆蓩薃薧薻藁藳藻蚤蝹衜衟袄袌褓襖討譅讨賲轑
造道郩鄗鎬镐镺隝隯靌顥颢駂駣騲鮡鰝鳵鴁鴇鷎鷱鸨𠄰𠊦𠐵𠔼𠙬𠜶𠡷𠤏𠹊𡂕𡍍𡚽𡜪𢁱𢄀𢅈𢉵𢑖𢙉𢚭𢠡𢾳𣆧𣐊𣓌𣠼𣧏𣩅𣴢𤀰𤊲𤍜𤞥𤟀𤠏𤱟𤶁𤷻𤹷𥈆𥓖𥢑𥬯𦒴𦦺𦦾𦯑
𦺋𦽀𧈹𧎮𧑫𧚡𧩣𧳦𧳺𧴙𨎮𨗓𨚮𨚰𨠬𨡤𨰦𨰻𨱵𩑤𩓢𩔇𩕍𩖔𩛋𩢿𩣜𩣻𩤘𩩀𩫺𩬱𩬷𩬽𩭼𪁾""",
    2,
    -19,
    -8,
    49,
]

ge50 = [
    """㙐㚌㛂㛆㝾㝿㞹㡅㥩㦬㦱㧴㩡㪃㪼㯐㰁㰐㰙㰤㱻㶡㻔䂳䂺䄀䅜䈗䌱䐝䑨䒳䙤䙨䠤䣔䤠䤻䩋䩔䫂䯬䰀䰈䲊䴹䵀么亸伙伿佐倮傩儺剆卵可叵哆哿唢嗩嚲坐坷垛垜埵堁
堕墮墯夥她妥妸娑娜娿婀婐婑媠嫷嬤嬷尀尛岢峨峩崜嶞左庅彵惈惢惰憜懡我扡抲拕拖挅挆挜捰掗揣播撱攞攭敤旤暛曪朵朶果柁柂棵椤椭椯楕橠橢欏毑毤毻沱沲涐
淉溑火灬炣爸爹猓琐瑣瑳痑瘅瘰癉癳睉砈砢砨硪硰碋祸禍稞笴笸箥簸粿綞綶縒缍脞臝舵舸荷菓葰蓏蚁蜾螘蟻蠃袲袳裸裹褁褍褨誃誐趓跛跥跺躱躲躶軃軻輠轲那邩
郍鈳錁鍺鎖鎯鎻鏁鐹钶锁锗锞閜阿陊陏隓頋頗顆颇颗餜馃駊騀髁鬌魺鰖鲄鵎麼麽𠂇𠄮𠆁𠑱𠛫𠜴𠝿𠪧𠰐𠵳𠶾𠻡𡆆𡑤𡓉𡖲𡛵𡺇𡽃𡽠𢃦𢅾𢓰𢡏𢦴𢫷𢬲𢱡𢼐𢿎𣂞𣃽𣄰𣄸𣆚
𣇫𣋟𣘨𣚝𣨪𣲳𣵟𣵺𣵻𣷿𤆄𤔝𤕇𤕒𤖇𤗀𤝯𤬁𤬾𤱧𤹢𤿑𥁁𥑽𥔭𥗿𥙨𥠄𥬲𥰮𥳔𥸥𥿰𦖋𦝦𧎫𧒘𧙃𧙤𧝹𧱫𧲭𧴪𧴲𧿽𨁡𨆵𨎭𨘌𨟥𨦃𨬍𨲉𨵌𨹃𨺖𨻈𩃒𩈔𩉙𩊜𩋗𩋝𩌆𩎫𩑸𩒜𩢘𩪈𩪮
𩬻𩭏𩹳𩻧𪍨𪎠𪓜𪘉𪚷""",
    2,
    -20,
    -9,
    50,
]

ma51 = [
    """㐄㕐㗿㙒㡸㨋㵔㵼㼘㿿䄕䈑䊬䋀䋾䑝䞣䟩䠚䥱䪵䬷䰩䱹䵦丅下且乜也假偖傻儍冎写冩冶剐剮厊厏厦叒叚叧吔哆哑唖啞喏嘏埜壄夏夓奲她奼姐婽媎寡寫庌廈忚惹打
扯把抯挜捨掗搲撦攨斚斝椵楇榎槚檟欛毑泻洒溤漜瀉灑灺炧炨玛瑪瓦疋痄痖瘂瘕码碼社稞粿者耍耹腂舍舎若苲苴蕥藛藞蘳蚂螞襾覀觟訯謯賈贾赭跒踝蹃輠邷野銙
錁锞閜雅雫顝飷馬騇马髁鮓鮺鰢鲊鲝鷌黊𠀃𠀇𠃟𠄟𠆣𠈊𠊰𠙼𠥇𠻦𠿜𡃂𡎬𡗸𢀘𢃳𢄳𢉃𢞇𢦚𣐎𣑃𣝒𣞐𣬕𣹶𤈩𤔙𤝉𤳅𥁹𥑥𥒶𥕇𥧓𥩙𦖍𦘵𦚩𦛐𦫪𧐓𧤐𧧏𧧝𧨊𧫝𧭠𧻧𨀄𨁶𩉆
𩤜𩤤𩴟𩸄𩻢𪄂乤""",
    2,
    -21,
    -10,
    51,
]

yh52 = [
    """㑂㒉㒳㓪㔝㔦㕫㗽㛨㟐㟠㟿㢡㤺㫤㫰㬒㬻㯍㳹㴏㶞㼒㽴㿩䁜䁳䇦䉃䋄䋞䍩䑆䑋䑗䒂䒋䒍䒎䒽䔪䖆䖮䖹䗮䟘䠀䠃䡉䡦䢍䣊䣣䥒䫙䫪䬬䭺䰣䲱䴂䴚丄丈上両两享亯仉
仗仧仰仿伖佒俇俍俩倆倘倣偒傢傥傸像僘儣儻兏党兤兩养勥勨厂厈厰向吭咉响嗓嚮嚷坱垧塽墏壌壤壾奖奘奛奨奬姎婸嬢宺岟崵嵣嶑帑幌广広廠廣弉弜強强彊彷往
徃忹忼怏怳恍惘惝想愓愰慌慡慷懩懬懭戃扄扙抢抰掌掚搡搶摤擃攁攘攮放敞旊昉昘昶晃晄晌曏曩曭朖朗朤杖枉柍档桨棢楧榔榜榥槳樃樉橡檔櫎欀欓氅氆氧汻沆泱
滉滰漭漺潒瀁瀇瀼灙灢炴烺熿爌爙爣爽牓犟犷犺獎獷璗瓬瓽痒癢皝皩盎盪眆眪瞊矘磉磢穣穰簜紡紻網緉縔繈繦纺网罒罓罔肮脏脼膙臓臦臩苍茻荡莽莾菵蒋蒡蒼蔃
蔣蕩蘯蚃蚢蛧蜽蝄蟒蟓蠁蠎蠰裲褬襁襐覫詇詤誆誏誩誷謊謽譡讜诓谎谠象賞赏躟躺軮輛輞辆辋迋逛邝鄺酐鉧銺鋹鎟鎤鏹鐌镪長镸长雵鞅鞝響顙颡飨養饗饟駔駚騯
驡驵骯髒髣魉魍魎魧鮝鯗鱌鱶鲞鶭黋黨𠅠𠏤𠓜𠕃𠙠𠞮𠠷𠻞𡑶𡕧𡗍𡢈𡻚𡻯𡾕𢁶𢐿𢓯𢙳𢠵𢠽𢡂𢩰𢼟𣄙𣆖𣊧𣎲𣓈𣞙𣢫𣩴𣮧𣯬𣶈𣻍𣾦𤅑𤍀𤓯𤖛𤞛𤟌𤢄𤰂𤰟𤸯𤾉𤿼𥀱𥇑𥓌𥔫
𥗝𥡠𥤗𥤩𥮎𥯕𥱶𥳶𥶑𥷃𥸈𥾼𥿧𦄍𦆌𦖉𦬺𦵽𦺡𦺨𦾭𧅗𧈿𧑘𧚅𧡮𧧜𧴅𨎖𨏛𨕿𨖶𨜂𨝦𨟼𨯞𨳠𩅁𩔋𩖩𩝽𩞧𩪎𩬝𩴒𩽳𪁺𪇵𪓃㒺""",
    2,
    -22,
    -2,
    52,
]

gg53 = [
    """㑟㓏㓑㗂㝭㢍㣏㨀㨘㩩㬌㮐㯳㲟㴄㹙㹚㼬㼳㾘㾪䁄䁅䁞䂔䊯䋁䋑䑍䓷䗒䚆䚇䜘䩶䭊䭗䭘䯧䴵䵃丙並丼井併侱倂倖偗傡冏冥冷勐哽囧坓埂塣境奣宑寎屏屛岭岺峺嶺
帡帲幈幜并幷幸庰庼廎廮影彾徎怲悜悻愸憬憼懭打抦挭挳掟摼撔擏擤整旲昞昺景晸暻朾杏柃柠柡栐梗梬橣檙檠檸檾氶永汬浜浧浻渻潁澋炅炳炴烱煚燛犷狰猙猛獷
璄璟璥瓾痉痙瘿癭皏皿省眚眪眳睁睈睛睜睲矿礦秉穎穬穽窉竝竫箐箳箵簈綆绠耿胻臦艋苘苪荇莄莕蛃蜢蟼袊裎誁請警请逞邴郠郢鄳鈵鉱鉼鋛鋞鐛鑛阱陃靓靖静靚
靜頃領頚頴頸顷领颈颍颕颖餅餠饼騁骋骾鮩鯁鯭鱦鲠黽黾鼆𠂷𠊧𠏫𠒝𠗊𠗝𠛥𠝟𠦋𠭗𠱛𡂚𡇤𡈼𡚛𡞞𢌦𢕙𢙾𢜫𢞚𢹘𣆳𣏀𣤵𣦪𤁽𤌌𤳭𤴀𤿆𥂂𥉔𥏎𥥊𥶹𥾚𦔄𦛟𦡺𦢆𦳗𦵸𧀙
𧊯𧋑𧍖𧏑𧑊𧚭𧡶𨓁𨙷𨜜𨥑𨥙𨨭𨲓𨵥𩂼𩇕𩈚𩒵𩔥𩖍𩘑𩶁𪍿𪘀""",
    2,
    -23,
    -11,
    53,
]

js54 = [
    """㟰㢠㫀㫥㯋㴿㷡㷫㽪䅍䒭䔛䗿䦐䳙䵺並佲併侱侹倂傡冂冋冼刭剄圢夐奵姳娗婞嫇嵿巊巠并幷庱庼廎徎惺拯挺敻朾梃榠檙檾汫泂泞涏涬溟漀濎濘濙瀴炅炯烃烴烶煛
熲珽町甼眳矃矨竝笭等絅緈耵肎肯肻胫脛脡艇艼苘茗莛蓥蘏褧訂詗誔誙謦订诇踁踜迥逈酊酩醒鋌鋞鎣鐤鑋鑏铤閮靪鞞頂頲顈顶颋颎鼎鼑𠋶𠖷𠗌𠹌𡔛𡞚𢑅𢙼𢜻𢜼𢽄
𣄿𣆍𣉡𣔲𣥤𣥻𤛙𤸲𤾢𥆑𥫙𥳥𦀝𦊓𦡲𧇷𧍮𧖿𨀧𨄇𨠸𨳑𨳝𨶙𨹹𩊖𩑙𩕳𩚱𩠑𩳍𪊵𪊶𪌷𪔂𪔶㱡""",
    2,
    -24,
    -11,
    54,
]

yz55 = [
    """㒖㓡㔚㔽㕗㕛㝅㞫㞳㥅㥉㧕㨐㪗㪷㪹㫗㫶㰴㰶㱙㶭㷆㸸㺃㺲㺵㼴㽲䂇䅎䅹䈙䈹䊆䎻䏂䏔䏽䒴䕆䖞䘀䚵䛮䛻䞜䪮䬀䬏䭭䱂䱏䳇䳎䳑䳝䴺䶇不丑丣丩久乆九乣亩佑侴
倃偩偶傁刯剖劶勏卣厚厶友取受叜叟口叩右吋后吘吜否吼呕咎唀啂喁喽嗾嘍嘔嚠坸垕垢垨垺培塸塿壽夀奺妇妞妵娄婁婄婦媀媍媨嬼守寿岣岰峊嵝嶁帚庮後忸懮懰
手扣扭抖拇授掊掫揉搝擞擻敂斗斢晭有朻朽杻杽枓枸某柳栁栯桕桺梄棷棸楢楺槱橮橾櫢欧歐殕殴毆母沑泑浏涭湡湵溇溲滫漊潃瀏灸炄煣煪熮牖牡牳犃犼狃狗玖玽
珋琇璹瓿甊畂畆畒畝畞畮疛眑睭瞍砪禸笱箁箒篓篰簍籔粈糅糔糗糺糾紂紏紐紑紤綇綬綹纠纣纽绶绺缶缹缻罶羀羐羑耇耈耉耦聈肘胟腢臼舅舏艏芶苃苟茆茩荮莠莥
莽莾菷萯葤蔀蕅薮藕藪藰蘣蚪蚴蚼蛗蜏蝜蟉誘诱負负走赱赳趣踇蹂郈部郶酉酒醙醜釦鈄鈕鉚鋀钭钮铆镹閗闘阜阝阧陡雬靵韭韮飳餢首髃鬦鬪魗鮦鯞鯦鯫鲖鲰鴀麔
黈黝齨齱龓𠂿𠃏𠃺𠖋𠙶𠛓𠜃𠥝𠪇𠪒𠴄𠴰𠷋𠹐𡆥𡖑𡗆𡚮𡜊𢄇𢈢𢔟𢣊𢫧𢼃𢼲𣅺𣏷𣙱𣢄𣢜𣢨𣣸𣤎𣤡𣧊𣧥𣲶𣳠𣸈𣸠𣿤𤉥𤍕𤘀𤘘𤘶𤘽𤛐𤝕𤣵𤭟𤱎𤵎𤵝𤷑𤽦𥈟𥍳𥐂𥕍𥖻𥙫𥜚𥝘
𥝦𥠊𥣙𥻑𥾹𦈺𦊎𦋡𦌁𦏇𦩲𦰺𦱣𦳑𦸱𧃝𧆕𧊛𧊦𧌈𧌓𧌗𧒙𧖼𧘞𧘥𧠶𧥣𧩒𧪓𧰷𧳜𧵃𧺆𧿹𨀔𨈶𨋀𨋖𨍸𨒥𨙫𨙺𨛔𨛶𨡴𨥇𨥪𨪐𨱯𨳞𨸏𨺅𨺦𨾉𩂆𩅇𩈏𩈸𩋄𩋰𩌄𩐁𩖴𩙄𩚖𩜶𩝠𩢹𩣸
𩬍𩶧𩼦𩿢𪀺𪂋𪃓𪊪𪌉𪌘𪍣𪎞𪏲𪕦乧丒""",
    2,
    -25,
    -12,
    55,
]

qb56 = [
    """㐭㔤㜤㝲㤛㨆㮳㯢㰂㱃㱈㴨㶒㶵㾕㾛䄒䇮䚓䪴䫈䫖䫬䫴䭃䭙伈凚凛凜品唫噤墋婶嬐嬸审寑寝寢審廩廪怎恁懍懔抌拰昑朕枕栚栠栣梫棯椹橝檁檩沈淰淾渖澟瀋甚瘆
瘮癛癝瞫硶碜磣禀秹稔稟箖腍荏菍菻葚蕈衽袵覾訦諗謲讅谂谉贂趛趻踸鈓銋鋟錦锓锦闇顲飪飮飲餁饪饮魫鰧𠓮𠘆𠮰𡆮𡼽𢆉𢫲𣏖𣔸𣿇𤂹𤎭𤏗𥔪𥖘𥖜𥧲𦍌𦯈𦼹𧀯𧿒𨈗
𨣔𩑉𩒪𩔟𩕌𩚕𩶇""",
    2,
    -26,
    -13,
    56,
]

gj57 = [
    """㕪㗖㙳㛦㛧㜗㜝㟛㣅㦧㧲㨔㨫㩜㯺㰖㲜㲭㸝㺂㽢䃫䃭䆦䈒䉞䊉䊖䊤䎨䏙䓿䖔䤗䨢䫩䫲䭕䭛倓傪匼参參叄叅唵啖啗啿喊喒嗿嘾噉嚪坅坎埳壈寁嵌幓忐惂惏惨感慘憯
憳憺抌掩揇揜揝揞揽撍撼擥攬敢昝晻暔朁椠椮榄槧槮橄欖欿歁歜毯浨淡湳漤澉澰澸澹灠灨燣燷爦瓭砍禫窞竷篏篢糁糂糝糣紞罯罱耽肣胆腤腩膽臽莐莟菡菼萏蓞蓡
薝蛿蜭衴襑覧覽览豃贉贑贛赣躭輡轁轗醂醈醓醰錎錾鏒鏨闇霮頜頷顄顉顑顲颌颔餤饏馣馾髧鰔鱤鳡黕黪黬黭黮黲黵𠆲𠆶𠇋𠇵𠉬𠓭𠩆𠭖𠹄𠿑𡁀𡒓𡓔𡻡𢃗𢄤𢇞𢎘𢕕𢻼
𣐺𣒷𣛱𣛴𣣒𣸄𣽌𤃷𤌐𤎥𤑸𤣟𤲭𥒬𥕵𥜙𥤴𥦝𥨎𥱷𥲄𥳸𥳹𥸡𦃖𦋣𦌪𦎌𦒝𦛜𦝧𦞞𦪧𦵹𦺽𦻁𦽜𦽫𧂃𧃏𧆐𧇦𧖺𧫿𧮤𧺟𧾔𨎹𨖋𨘄𨡍𨣕𨣝𨣸𨲱𨳼𩄕𩅾𩈴𩈼𩐬𩒃𩛎𩜱𩞀𩟺𩭥𩹸𪉿𪊄
𪒾㞄䊏""",
    2,
    -27,
    -14,
    57,
]

jm58 = [
    """㐁㓠㖭㚒㚧㚩㢂㤁㨛㪎㭺㯬㰈㱘㴸㶑㶘㸃䀹䄋䄼䇜䌞䌪䍄䎃䎦䒣䟋䠾䣍䣸䤔䤡䭑䭠䲓俨俭倹儉儼冄冉剡厣厴呥咁嗛噞垵埯夵奄奌姌婖媣嬐嬚孍崄崦嶖嶮广広弇彡
忝悿慊扂扊捡掩揜撿敛斂晱晻曮染检棪検椠槧橝檢檿歉渐渰溓漸潋澰瀲点燄猃獫玁玷珃琰疺睑睒瞼硽磹礆稴簟罨羷肷脸膁臉舔芡苒蒧蔹薟蘝蘞螹裺覢諂譣讇谄貶
贬鍩鏩閃闪陕陝险険隒險顩颭飐馣驔魇魘點黡黬黵黶鼸龑𠑡𠱞𡕢𡗏𡙶𡜉𡜫𡟨𢁧𢅠𢇘𢈂𢒉𢧦𢸴𣀁𣃳𣄉𣄑𣕎𣝎𤂠𤗎𤟇𤯇𤸹𥄘𥅑𥇒𥈚𥍀𥦍𥬕𥯃𥸣𦖈𦾶𧞣𧧵𧬦𧴭𨁹𨟹𨹊𨹌
𩃵𩆫𩉍𩑳𩢡𩶎𪒫""",
    2,
    -28,
    -14,
    58,
]

jm59 = [
    """㧄㴴㺌㺑㺖㺝䤘偡减凵啿喊堿壏崭嶃嶄巉懢払掺摻撖斩斬旵槏槛檻歉淰減湛溓滥濫瀺犯甉瘎硷碱磛笵範糮舰艦范豃豏趻軓轞醦釩鋄錽鎫钒闇闞阚鬫魙鰔鹸鹻鹼黤
黬黯𠊭𠽦𡓦𡞣𢜩𢨔𢾑𢿈𣊟𣐏𣓅𣪶𤁦𥳒𥻇𥽏𦩢𦭁𧀵𧍙𧯘𨍒𨏊𨢑𨥧𩅝𪑉𪒝𪒠""",
    2,
    -29,
    -14,
    59,
]

ss60 = [
    """㐺㑋㑝㓊㔶㖆㗢㚇㜴㝱㞲㢅㧤㮸㯯㲴㳥㸜㼯䇨䍟䏵䔈䛪䠢䠻中仲众倊倲偬傯働冻凇凍凤动動同咔哄哢唝嗊堹夢夣妕姛娻峒峝崠弄恫恸惣愡愩慟憁憅懜懵戙挊挵控
揔栋梇梦棇棟槰樬汞洚洞涷湩灨烔焨焪煈燑瓮甕痛癑眮眾瞢矒砻硦礱礲祌空筗粽糉糭絧緵繷罋羾翪胨胴腖茽菄蕻蘣蚛蝀衆衕衷詷諷謥讽貢賵贑贛贡赗赣趥迵送銃
铳閧闀霘霥霿鞚駧鬨鳯鳳鴌齆齈𠄉𠌚𠏭𠓙𠘊𠡻𠮽𠱚𠱧𡍻𡒯𡔕𡟫𡺭𢄐𢙱𢢹𢮍𣀒𣇬𣑁𣶆𣹟𣿝𤗇𥈿𥥡𥦁𥦌𥦥𥫎𥬱𥮨𥰲𦁈𦉥𦒍𦩼𦶓𦷴𧚂𧡍𧩪𧾧𨖼𨛓𨞑𨹁𩆽𩋯𩐯𩐵𩭩𩰓𩿀𪄌
𪇓𪔦㺯""",
    3,
    -1,
    -1,
    60,
]

ss61 = [
    """㙲㡝㮔㴩䃔䛦䝋从供俸偅共壅奉宋封従從徿恐憃捀揰昮湗澭灉用疭瘲碂种種統綂綘綜緃緟縙縦縫縱纵统综缝苚葑褈訟誦諥謥讼诵贚躘重錝雍雝雺頌颂龏𡇝𤚏𤡆𥁎
𥥝𦯕𧙇𧳮𧼩𨉢𨶽𩎂𩪌𩬮𩼅""",
    3,
    -2,
    -1,
    61,
]

jl62 = ["""㕩㟟㦼䎫䚎䡴䢽䣈夅巷幢憃憧戅戆戇撞洚淙漴炐絳绛肨艟虹衖袶闀降鬨𢘸𢤤𣨳𥈄𥗵𥞜𨙵𩯲""", 3, -3, -2, 62]

vi63 = [
    """㐸㑥㑧㑶㒃㒸㒾㓨㕄㘩㙺㛅㜇㞓㞖㢀㢰㢻㢽㣁㣇㣈㤦㤬㥍㥞㥡㦉㦐㦤㧘㨁㨖㩻㩼㮹㯜㰣㰷㱁㱅㱖㱲㱴㳏㳵㴃㴚㴛㵨㸍㸢㹑㻑㻽㽈㽷㾽㿙㿫㿷䀣䀿䁛䄁䄲䅆䆈䆊䆳
䇐䉅䉋䉌䉜䉾䋘䋟䎵䎶䏀䏤䏪䏯䐀䐉䑄䓌䓹䓽䔬䔹䕌䕗䕚䗹䗽䘭䙡䚳䛈䛋䜄䜐䜜䜵䜻䝯䝸䞃䞇䞈䠏䠔䠦䡵䡹䢋䢦䣦䣵䥍䥙䦙䦯䨳䨽䩀䩃䪐䫁䬥䭄䯣䯸䰎䰡䰨䰪䰯
䲀䳐为义乨乿亄亊事二亖企伎伪伵伺似佀佊位佴佽使侍侐価俐俻倚値倳值偹偽備僃僞僿儗儨儩兘其兾冀几出利刵刺刾剚劓劕勚勩匮匱卛卶厕厠叓司吏吱吹呩呬呮
咡咥哆哩唎唏唭啻喂喟嗜嗣嘳噐器嚊嚜嚱四囟地坒坔坖坠垍垝埊埴塈墍墜墬备夡夶奰妼始娡娷婎媚媿嬑嬘嬟孖字孠季孳孶寄寐寘寺尯屁屃屓屣屭岀岿峜嶳巋已帅
帔帜帥帺幟幾庇庛庳廁廙异弃弍弐弑弒彗徛徝徳德忌志忥忮忰思怬怶怼恎恚恣恴悳悴悸惎惪惴意愧憄憙懟懥懫懻懿戏戠戯戱戲扻技挚掎揓搱摯撌攰攱敡施旘旞易
晒智暨曁曬术朿杘杫枇枈柲柴柶栨桘梞棄植楴槌槜樲樻檇檍檖櫃次欬欭殔比毖毦汥沶治泌泗泪洎洓洱洷浰涙淚渍滍漬潩潪澌澻濢瀃瀡為炽煝煫熾燧燱爲牭牸犕猤
率珕珥瑞瑟璲瓃瓗甀畀畁異疐疩疪痓痢痣痵痹痺痿瘁皕眂眎眙眡眥眦眭睟睡睢睸瞆瞡知硊硾礈示礻祕祙祟祱禭禷秘积秲稚稩稺穂穉穊積穖穗穟竩笓笥筫篑篲簣籄
类粊粋粹糒糦累絘絥絫綕緻縊縋織繸纍纗织缒缢置羛義翄翅翆翠翤翨聏聭肂肄肆肞肶胒胔胾腃腄腻膇膩臂臎自臮至致芓芖芘芰茡茤茦莅莉莳莿萃萎蒉蒔蒞蔇蔧蕢
蕼藣蘎蘱蚑蚝蛓蛠蜼蝞螅螆螝螠蟌蠔衈衪袘袣被裏裡褀襚襣視覟覬视觊觗觯觶記訲訵詄詈詒詖試誀誃誋誌誶誼諅諈諉諡謉謘謚識譢譬議譵议记识诐诒试诿谇谊谥
豉貄貤貭貮貱貳賁賜賥質贀贄贔质贰贲贽赐赑赿跂跮跸踬蹕躓輊輢轛轡轾辔近迟迡遂遅遗遟遲遺避邃邔邲鄪酔酨酻醀醉里鉺鋕錗錘鍦鐀鐆鐩鐾鑆鑎铒锤閟陂陒隧
鞁鞴鞼韢顇顖類食飤飼餌餧餵餽饋饎饐饖饲饵馈馶駟駤騎騩騺驆驥驷骑骥骴髊髲髶鬁鬽鬾魅鯚鴲鵋鶅鷙鷧鷾鸷鼻龡𠁱𠊷𠋞𠋡𠑴𠔚𠕞𠚅𠚧𠛦𠞤𠡥𠢥𠤫𠦐𠨕𠨘𠭈𠰚𠲹
𠹤𠿥𡄻𡍶𡏲𡑘𡑞𡔇𡖧𡛗𡜱𡠗𡻧𡽆𡽛𡽼𡿎𢂝𢄱𢄽𢅁𢅜𢅩𢇙𢇤𢇥𢈶𢈼𢊅𢍇𢍧𢍭𢏎𢐂𢐖𢕞𢖿𢗹𢙺𢚁𢛉𢝬𢟤𢠿𢣘𢦱𢴠𢴧𢴨𢺵𢺼𢻙𢻠𢼱𢼷𣄧𣄮𣓊𣔽𣔾𣖾𣙰𣚘𣚩𣣌𣥣𣥰𣧹𣧼𣨂
𣨙𣨟𣩠𣫱𣬐𣬮𣱗𣴨𣽍𤀷𤅹𤆂𤆒𤏜𤘤𤡬𤣨𤤋𤦮𤯄𤰈𤴢𤵘𤶴𤸸𤹝𤹲𤻄𤻖𤼅𤼤𤿙𤿡𥂃𥃠𥃸𥄽𥅓𥇄𥈗𥉖𥎃𥎛𥏄𥗶𥙋𥝢𥝩𥞃𥠽𥤼𥥥𥧴𥪫𥭌𥭜𥭡𥴒𥴦𥴬𥶗𥷇𥹊𥹩𥿩𥿫𥿮𥿴𦁳𦂋
𦃘𦈦𦍺𦎚𦎸𦖢𦞝𦟔𦠞𦠻𦣢𦣥𦣹𦤢𦤫𦥊𦥎𦥐𦥻𦧉𦮼𦳙𦾲𧀩𧀳𧂠𧃞𧊒𧎃𧑖𧘧𧙁𧚥𧜱𧠎𧡫𧢾𧣛𧤡𧧃𧧅𧧒𧧕𧧟𧨧𧨴𧩴𧩼𧫜𧳙𧵋𧷥𧸙𧸲𧺧𧿲𨁐𨁷𨆏𨆧𨋰𨎉𨎌𨐛𨑤𨒉𨙳𨚓𨛉𨛑
𨞳𨣢𨧫𨪹𨫔𨬝𨲁𨳙𨶺𨷃𨸼𨽄𨽸𨽹𨽼𨾅𨿠𩈭𩉝𩊝𩊴𩋩𩍁𩍚𩍨𩏚𩐍𩔆𩚂𩚪𩛅𩛌𩛏𩜀𩝌𩟉𩢲𩣫𩥉𩩞𩪧𩫍𩯃𩰢𩱓𩲈𩲉𩴈𩴜𩷓𩹈𩻉𩾔𪁊𪁓𪂄𪏀𪏩𪐘𪐰𪑯𪒕𪖞𪙺㘘㚄㸂""",
    3,
    -4,
    -3,
    63,
]

ww64 = [
    """㒫㔗㥜㩌㫓㭑㰟㵒䀈䀟䆏䉨䊊䊠䊧䙿䛍䝘䝿䠊䤒䨾䪋䬑䬣䭳䮎䰁䲁䵝俷刉刏剕卉叞味唏喡塈墍奜媦尉屝彙彚忥忾愾慰摡攈旡既旣昲暣暨曁曊未欷毅气気氣汇汽沸
泋渭溉滊滙漑濷炁炥煟熂熨犔犚狒猬甶畏疿痱盵瞆瞶禨穊笰緭緯纬罻翡胃胇臮芔芾苿荱菋菲蔇蔚蕜藙藯蘶蛂蜚蝟螱衣誹諱謂讳诽谓豙貴費贵费鎎陫霨霼靅顡餥餼
饩髴魏鮇鯡鱀鲱黂黖𠐽𠑶𠘻𡔱𢉝𢍚𢒍𢖫𢪑𢲴𣂊𣄜𣄯𣈎𣙿𣢆𣢦𣦦𣾤𤈫𤝟𤵀𤸁𤺕𥄱𥝊𥝋𥧙𥸊𦝛𦩝𦳢𧆈𧉁𧍫𧎵𧑈𧑋𧓖𧕒𧕞𧚆𧛽𧝇𧝷𧪢𧱏𧱲𧲯𧳪𨀶𨚘𨲿𨵘𨾂𩆦𩇮𩑵𩗜𩞊𩰾
𩱎𩹂""",
    3,
    -5,
    -3,
    64,
]

yu65 = [
    """㣽㫂㫢㫹㰦㵂㾻䁦䂊䉀䎝䘄䛯䢩䬡䭖䱟与倨儊処刞助勮勴厺去呿嗻嘘噓坥壉处女如嫬庶庻御忬怚恕悆悇慮憷懅拠据據暏曙棜椐椘楚檚櫖櫡櫲欤歟沮洳淤滤滪澦澽
濖濾爈狙瘀礜秗穥竌筯箸絮署翥耝胠舁舆與茹莇著蓣蕷薯藇藷虑處覰覷覻觑詎詛誉語謯謶譽讵诅语豦豫踞躆輿轝遽醵鋁鋸鏣鐻鑢铝锯除雤預预飫饇饫馭驭鸒麆麮
𠄛𠄝𠣊𡒊𡾅𢔴𢚆𢛨𢠫𢣿𣀞𣝑𣟰𣥼𣶝𣹤𤋰𤙏𤢓𤳯𥖼𥛜𥵟𥶌𦊼𧝲𧠢𧭜𧲋𧸧𨆄𩚄𩚿𩜈𩥆𩿟𪇬𪊹㵖䥨""",
    3,
    -6,
    -4,
    65,
]

yu66 = [
    """㓃㕖㚴㛸㜐㤔㧽㨞㬬㯝㲓㳇㳍㴑㸦㹘㹥㺛㻉㽽㾟䀠䂤䇘䈮䊇䊺䍛䎷䎸䐍䑧䑰䒀䓢䔘䔯䕶䘱䛾䜑䜴䝬䝵䝾䞯䞸䟔䟭䟻䠵䠼䣱䣴䥄䦌䨁䨼䪒䮛䴁䵕亍互仆付佈住作侸
俉傃傅僫僱兎兔具冨冱凅副务務募厝句吁吐呴呼咐咮哺唋啎喥喩喻嗉噁固圃圑坿埗埠埧埾堌塐塑墓墿奦奼妇妒妪妬姁姇姹娪娶婟婦婺媀媍嫊嫗嫭嫮嬎孵孺富寓寤
尌属屡屢屦屨屬崓崮嵍布库度庫庽弖忂忢忤怐怒怖怘恶悑悞悟悪悮惡惧愫愬愳慔慕懼戍戽护抪捂捒捕捗捬措摀摢擭攎敄故数數敺斁旿昫晤暮枑柱树棝榑榡樹歝步
歨歩殬殶汙汚污沍泝注涸渡溯溸潞澍濩炷煦熃璐瓠疈疎疏疰痼瘔瘘瘺瘻盓瞀瞿祔祚祩祻禺秅秙秨秺稒穫窹篧簬簵籲素紨紸絇絝綔緅縤縸绔罜羽聚聥胍胕胙胯腧膆
舖舗芋芌芏苦茹荹莫菟葄蒟蕗蘁虂蚹蛀螙蠧蠹袝袴裋裕裤褲覦觎訃訏訴註詂詛誤誧諭謼護讣诅诉误谕豧負賂賦賻负赂赋赙赴趣足趶跗路踄踈軴輅輸辂输迕迬逪遇
遡邭酗酤酺醋鈷鉒鋪鋳錮錯鍍鏴鑄钴铸铺错锢镀阼附陚陠隃雇雨雾霔霚霧露韄頀頋顧顾颶飓飳餔饇馵駆駈駐駙騖驅驱驸驻骛骻魱鮒鮬鯝鱯鲋鲴鳠鴮鴼鵅鵏鵵鶩鷺
鸌鹜鹭鹱齭齼龥𠉧𠊪𠍄𠓱𠕦𠜙𠩈𠪻𠼘𡀿𡂡𡒍𡝜𢁻𢂆𢆰𢇴𢎎𢚑𢝴𢟽𢡎𢨦𢨫𢫸𣊃𣑂𣕃𣧃𣨲𣲑𤎧𤖮𤘔𤜷𤝔𤞉𤠚𤢊𤢕𤢘𤤐𤴱𤵊𤷢𤸒𤸵𤹣𤻱𥅁𥉁𥎈𥏒𥒀𥝾𥩣𥯖𥯸𥰻𥲉𥲗𥲛𥳲
𥴪𥸤𥹴𦀡𦆞𦊂𦊧𦋢𦌕𦎦𦒶𦔍𦡄𦦲𦬚𦱖𦳔𦵬𦺉𧃘𧅰𧉩𧊘𧋌𧏺𧐄𧐙𧑠𧔬𧗌𧘢𧙛𧥮𧥯𧦞𧩝𧪅𧰈𧶍𧻃𧻳𧼯𧿉𧿓𨂣𨅒𨋈𨋞𨐡𨔦𨛒𨜖𨡱𨧗𨭅𩊓𩊬𩊶𩜃𩝕𩝥𩢕𩣝𩣮𩣷𩴡𩷖𩽩𪍏𪏳
𪐞㴻""",
    3,
    -7,
    -4,
    66,
]

ji67 = [
    """㑜㑦㓯㓷㓹㔺㖂㗣㘑㙪㙯㛳㜆㜒㝣㡀㡂㡜㡫㡼㤡㥣㥷㦣㨅㨹㩨㪈㪒㪫㬩㬱㭡㯔㰥㲅㲊㳪㴉㵝㵩㸄㸷㹭㻰㼖㽝㾐㿃㿛䀙䀸䁹䂱䄌䄟䄿䅄䆿䇤䇧䇩䇽䋵䎈䎚䎮䎺䏅䏿
䐭䑭䓞䓲䔾䕍䗟䘈䘙䙆䙗䚉䚕䛖䛧䜞䟡䟤䟷䠘䠠䡟䡶䡺䢃䤞䤧䤱䦇䧥䨖䩘䩚䩢䫔䬅䬽䭁䰏䱥䱨䲦䲪䳏䴡䵻䶍䶏䶑䶓䶩世丗丽丿亗例係俪偈偙偰傺僀僡儶儷兿切制
刿剂剃剤劌劑劙励势勢勵医卋卫厉厲叡呓呭哕哜哾唑唳嘒噎噦噬嚌嚏嚔嚖囇囈埶埿堄墆壡壻奃契妎妻娣婯婿媂媲嫓嫕嫛嬖寭寱屉屜岁峌嵗嵽巁币帝帠帨幆幣弊弟
彆彐彑彗彘忕忚怈怟恵悘悷惠愒慀慧慸憇憏憓憩懘懠戻戾抁抴挤挩挮捙捝捩掜掣掲揥揭摕摖擠攦攭敝斃斉昋晢晣暩暳曀曞曳曵替杕枍枘枤枻柢栔栛栧栬栵栺桂梊
棙棣楴榽槥槸橇橞檅檕檵櫅櫔櫗櫘欐歲歳殢殪殹毉毙毳汭沴沵泄泥泲洟洩济浙浰涕涖涗涚淛淠淣済渧溎滞滯漈潎潓澨濔濞濟濿瀱炅炔焍熭爄犡狾猘猰獘獙玴珕珶
璏璿瓗瓥甈畷疐疠疶痸瘈瘗瘛瘞瘱癘盭盻眥眦眭眱睇睤睥睨睼睿瞉瞖矵砅砌砺磜礪祭祱祶禊禘禲离秇稅税稧穄穧竁笍第筀筮箅篲簭粝糲系紒細継綟綴締縘繋繐繫
繼细继缀缔罊罽羿翳聟脃脆脺腣膬臷艺芮茘荔葪蒂蓕蓟蓺蔕蔽蕙薊薙薜藝蘙蘮蘻蚋蛈蛎蛠蛻蜕蜧蜹蜺蝃蝭螮蟪蟿蠇蠣蠫衛衞袂袣裔裚裞裼製褅褹襼觢計詍詣詸誓
說誽諦謎譓譿讆讏讛计诣说谛谜豷貰贅贎贳赘赽趆跇跩踶蹛蹶蹷躗躛軎軑軚轊轚轪达迏迖迣迾递逓逝逮逹達遞遰遾鄨醊醫釱鈌鈗鉪銐銳銴鋭鏏鏸鐴鑖锐閇閉闭际
際隶隷隸離霁霓霽靪靾韢題题餀饚骶髢髰髻鬀鬄魝鮤鮨鮷鯯鯷鰶鱖鱥鳀鳜鶗鶙鷤鷩麗齊齌齐𠀍𠂆𠌯𠓶𠠏𠢪𠥖𠩪𠫜𠭥𠽡𠿉𡁪𡉸𡋚𡗤𡘐𡛽𡜧𡝧𡞭𡻰𡽉𡿋𢂕𢂼𢄢𢄣𢅊𢅕
𢅫𢇚𢇸𢉆𢏗𢐦𢒱𢘽𢛜𢜳𢞖𢟩𢡈𢢖𢢞𢧑𢨨𢪧𢭁𢲾𢳓𢸀𣁢𣃍𣄱𣓔𣖊𣜹𣞕𣟈𣟌𣡊𣢓𣦌𣧂𣧎𣧿𣯅𣰚𣳦𣴪𣿉𤁼𤂃𤃀𤄽𤓕𤕛𤚪𤜂𤝼𤟑𤡱𤡿𤤺𤫝𤬵𤯜𤱾𤲉𤳓𤴟𤷅𤸪𤺅𤺗𤽃𤾕𥁟𥇕
𥉆𥉻𥍭𥏰𥒢𥟒𥣩𥥴𥫵𥬭𥭫𥰫𥰰𥳈𥳠𥶽𥷙𥺜𥼛𦂑𦂖𦃝𦄑𦅵𦅺𦆡𦇀𦇧𦋋𦌗𦐧𦒎𦕓𦙨𦚨𦜋𦜏𦡕𦨢𦩣𦪊𦭮𦷲𦺶𧀱𧀶𧂨𧇜𧉛𧊣𧏧𧑎𧒈𧓓𧘉𧘓𧙟𧚃𧛒𧝆𧝐𧡎𧡏𧡯𧢂𧢝𧤍𧧋𧨰𧪇
𧬇𧲝𧹺𧺽𧺿𧻸𧼪𧾽𧿠𨂰𨇙𨊉𨊢𨋯𨑼𨒍𨒧𨜒𨞺𨡐𨢡𨢵𨣧𨧨𨧳𨪗𨳿𨵆𨵰𨷘𨻊𨻏𩇻𩎥𩎰𩏲𩔙𩗅𩗭𩘡𩬲𩯰𩻼𩿛𪀕𪊂𪊆𪍲𪔊𪗷𪘥䯻♂""",
    3,
    -8,
    -3,
    67,
]

td68_1 = [
    """㐲㘷㞧㞭㟋㥭㧩㪡㮏㯂㲕㲡䈆䊪䓶䔽䠭䡷䨠䭝䮑䯤䱞䲚丐乢亣冭刏匃匄嗐嗳噯堨壒外大太夳奈婡害巜带帯帶廗忕忦忲愒戤摕攋旝昹柰棑毻汏汰汱泰渿溙濑濭瀨瀬
狯獪瓂瘌癞癩盖瞹磕礚笩篕簤籁籟粝糩糲胈舦艜艾葢蓋蔡蔼藹藾譪賴贎赖跢軑軚轪郐鄶釱霭靄頼顂餀饚馤鬎鱠鲙鴱𠔑𠕛𠘝𠯈𡁁𡁍𡂖𡃤𡇷𡕗𡚻𡞫𡼾𢄔𢅤𢞐𢢚𢶒𢻜𢾒
𣋞𣩱𤁱𤐩𤙅𤢵𤤫𤵽𤷹𥎆𥢶𦒰𦔦𦨚𦳐𧉑𧰿𨇆𨞨𩁞𩕭𩞞𩪃𩳆𩹄𪇭𪈈𪐝𪐥𪑷𪕭㤗""",
    3,
    -9,
    -5,
    68,
]

td68_2 = [
    """㑹㙂㛝㝡㝮㣛㤄㸬㸽䔴䟺䠿䢈䬈䰽䵳伂会侩儈兊兌兑冣刉刽劊哕噦外姵娧嬒幆廥徻懀戻斾旆昁昧最會杮杸桧梖檜毤沛浍浿澮濊濻瀢犡狈狽珼璯癐眛瞺祋祱禬稡絊
絵綐繪绘翇翙翽脍膾茷荟蕞薈蛻蛽蜕裞襊襘貝贝郥酹鈗鉪鋇鋷鐬钡霈頪餯馷駾𠃐𠍗𠜑𡋭𡚙𡡔𢁖𢄸𢕺𢘀𢻵𣌭𣨅𣩡𣬪𤜋𤜲𤼚𥄔𥊴𥕸𥳣𥹲𦖦𦦣𦮷𧎹𧓽𧖢𧬨𨅎𨗥𨗼𨘇𨙶𩅣
𩆁𩊭𩖭𩛝𩾘""",
    3,
    -9,
    -3,
    68,
]

gx69_1 = [
    """㑘㒠㕟㖑㝏㞒㠔㠹㦅㧔㬠㭛㰆㰡㳗㳦㶔㾏㿄㿍䂯䅬䇒䈛䊽䒔䓒䖰䘍䚸䛺䜕䝽䢙䦏䦤䪥䯰䰺䱄䲸䴝䵘䶐丯介价佅债債劢勱卖叏吤呃呗呝咶哙唄唏喝喟嘬嘳噧噫噲囆
坏堺塧壊壞売夬妎嬇孬寨屆届嶰帴庍庎廨忦快怪恠悈惫慸憊懀懈戒拜拝攦敗斺晒曬柴械棑楐欬欯欳欼汖沠派浿湃瀣炌烗犗狤狯獪玠琾璯界畍疥瘵眥眦睉砈砦砨祄
祭稗篑簣籄粺紒繲纗聩聵膪芥蒉蒯蕢薤蘾虿蚧蠆衸袃解觧訍誡謑譺诫賣賹贁败躗躛迈邁邂阨隘韛韰餲駃骱魪鶛齂齘𠂢𠑞𠜐𠷟𠸴𠽶𠿇𡀽𡌪𡍥𡏯𡖪𡗦𡗼𢗊𢟰𢤯𢤰𢬿𢳎
𣏟𣟉𣣶𣤌𣧙𣩹𣬫𣲾𣸎𤉫𤑪𤘦𤙩𤸋𤻢𤽹𥇯𥌚𥑋𥑰𥤦𥯟𥰾𥿯𦄌𦏢𦏨𦑏𦔠𦔹𦗍𦗐𦘍𦤧𦤬𦧬𦩋𦳋𦳞𧍣𧏹𧒨𧔴𧕧𧜁𧜅𧞔𧣋𧪘𧭸𧮇𧮚𧱘𧱳𧴚𧵠𧵨𨐑𨛖𨝋𨢦𨣅𨵠𨶂𩂃𩈋𩋂𩎻𩏞𩐉
𩔀𩕕𩟮𩡺𩴇𩶦𩽍𩾴𪑹𪒪𪙏""",
    3,
    -10,
    -5,
    69,
]

gx69_2 = ["""䇈䛡卦嗄尬挂掛搾杀杷榨殺澅画畫畵瘥睚紁絓繣罣罫舙衩褂話詿諙諣譮诖话醡鎩铩閷魀黊𠒾𠣠𠳂𢕮𢛄𢟡𢴾𤆜𥝒𦁊𦧵𧏫𩂒𩂤""", 3, -10,
          -10, 69]

dv70_1 = [
    """㑷㕌㕢㙕㙗㝵㤥㧉㮣㻖㾢䒫䚅䣬䵧代佴侢儗再凷劾勓叆叇咳嘅在埭埰塞墤婇嫒嬡宷岱帒徕徠忾态怠愛愾態慨懝戴扗採摡暧曃曖杚柋栽棌棑概槩槪欬洅溉漑瀻燤爱
玳瑁瑇瑷璦皧睐睞硋碍礙簺縡縩耐菜薆蚮蝳螚袋裁褦襶貣貸賚賽贷赉赛輆載载逮酨采鎎鎧铠閡阂霴靆靉鴏鴱黛黱鼐𠌰𠕂𠰺𢙴𢟪𢣕𣇨𣉘𣝅𣫉𤮼𥃣𥉃𥴨𦓎𦙯𦞫𧓁𧯥𨀖
𨒨𨓞𨚵𩃷𩛥""",
    3,
    -11,
    -5,
    70,
]

dv70_2 = [
    """㐻㑍㑰㔨㘨㠚㣻㥆㫲㬣㲼㳃㻗㾦䀛䂕䃀䃍䈐䉪䉬䊃䋳䌆䏗䐴䒹䕠䖊䘹䚨䛛䜋䠩䣂䨴䨺䩈䮹䯟䵢乂伜佩倅偝傫儽內内刈刉刏剼北吠哱啐啛喙嚜囘回囬圚块埣塊妹姵
嬇孛对対對嶏废廃廢廻廽怢悔悖愂愦慖憒憝憞抺捘揹擂攂敦昧昩晦晬朏杮柭柹槶橃櫑櫠殨沬淬溃潰濧濻瀢瀣瀩烠焙焠燊犻獩珮琗痗癈眊眛睟砕砩硙碎碓磑礌礧祽
秽穢篃簂紣綷繀繢纇缋耒肺胇背脄脢膭苅苝茷蓌蕟薉薱蝐螝褙詯誖誨誶譈譢诲谇跊軰輩轛辈迴退逥邶鄁配酹銇錊鐓镦闠阓队隊靅靧鞼韎頪頮顪颒颣饖鮁鲅鼣鼥𠋭
𠏮𠐡𠗚𠧩𠮆𠿔𡁨𡏁𢁩𢊇𢓇𢠮𣀜𣝉𣨶𣩑𣩪𣿐𤄛𤬫𤭢𤮩𤻅𤼺𥏙𥔯𥻮𦂆𦜄𦡖𦡷𧧾𧭾𧴖𧶙𨀤𨍛𨢉𨺵𩄮𩅆𩅲𩈁𩈐𩏐𩏡𩐌𩒏𩒳𩔁𩖠𩬀𩳕𩵥𪏤𪒛𪒡𪓌""",
    3,
    -11,
    -3,
    70,
]

vf71 = [
    """㐰㑺㒞㕙㖁㝦㝻㠈㠴㢙㣀㣧㥧㧈㪦㬜㶦㶳㷠㸾㼱䀔䀢䉮䏖䏛䏰䑞䒖䕑䗯䗲䚏䚔䚱䛜䛨䜭䞋䢯䦞䨯䪿䫃䭀䴄乵亲仅仞仭伨侚侲俊信傧僅儁儐儭刃刄卂印厪吝呁嚫囟
圳垽埈堇塡塦填墐夋奞娠媇嫤孞寯寴屻岕峻帪廑廴引徇恡悋愼慎慭憖憗懏扨抻挋振捵揗搢摈擯攈敒敶昚晉晋晙朄杒枃梕楯榇橉橍橓檼櫬歏殉殡殣殯殾毥汛汮洕浚
润湚溍潤澵濥濬瀙烬焌焛煡燇燐燼牣狥猌獜琎琗瑨瑱瑾璡璶甐甽畯疄疢盹眒眘睃瞚瞤瞬瞵磷稕粦紉綧縉纫缙肕胤臸舋舜茚荩荵菣菫葰蓳蔺蕣藎藺藽蜃蜄螴螼螾衅
衬袗襯覕覙親覲觐訊訒訙訫訰診認誫諄认讯讱诊谆賐賑賮贐赆赈趁趂蹸躏躙躪軐軔軙轥轫迅进迧迿進遴酳釁鈏鋠鎭鎮鏻镇閏閠閵闰阠阵陈陖陣陳隽雋震靭靱靷韌
韧順顖顺餕饉馂馑馸駿驎骏髩鬂鬊鬓鬢鮣鵔鵕麐齓齔龀𠂧𠊫𠞱𠦎𠯄𡃦𡈏𡺲𡺽𢎕𢏤𢓈𢩲𣅉𣍃𣎳𣒅𣥇𣦫𣱐𣷩𣹯𤂶𤌎𤗷𤜢𤵯𤹩𥇜𥑓𥗒𥡣𥳞𥶒𥷖𦉝𦎷𦕽𦚧𦤟𦬄𦴌𦺸𧃮𧖔𧥺
𧦹𧭼𧳄𧴢𧴬𧶆𧸩𨋙𨌘𨛐𨝜𨟴𨲄𨳌𨴐𨶊𨷎𨺮𩂥𩄛𩊡𩊨𩒀𩒦𩣖𩬵𩴠𩵕𪐲𪔺𪕞㑓""",
    3,
    -12,
    -6,
    71,
]

wf72 = [
    """㒚㞬㟦㡈㡥㥼㨷㱵㴈㸪㼂㿎䚋䝍䩵䲰份偾僨分员員問坋垽堇奋奮妏忶忿愠慍懚抆拚挋捃攈攟斤晕暈枟桾檃檼櫽歏汶泿渂瀵焮煇珺璺秎粪糞紊絻緷縕縥聞脕腪臐莬
蓳蕰蕴薀藴蘊訓训貟賱贠运近運郓郡鄆酝醖醞鐼鑂问闻隐隠隱靳韗韵韻餫馸魵鱝鵘鶤鼤𠺔𠻫𡅙𡊄𡊅𡽅𡿼𢧝𢳃𢷍𢹔𣶌𤑕𤘝𤢦𤸫𥂙𥹻𥽒𦅿𦘶𦜓𦫯𦵼𧡡𧥿𧼐𨟸𨤘𨤚𩴉𩾧
𪇑𪍝㧆""",
    3,
    -13,
    -6,
    72,
]

yr73_1 = [
    """㜛㝃㤆㤪㪻㬅㰽㶗㸘㽹䄐䇟䉊䏍䛄䝡䡬䣲䧮万健傆傿僆券劝劷勧勸卍圈圏堰墕奿妴婏媛嫣宪建徤怨愿憲挽旔曼椻楥楦槾毽汳漹瀗牶献獌獻瓛畈番畹絭綣绻脕腱臶
萬蔓虇蟃褍褑褗褤謜販贎贩踺輓远逺遠郾鄤鋔閞隁韏願飯飰饭鬗鬳鶨𡆅𡚇𡜀𢀗𢍕𢑆𣀔𥁠𥝄𥹇𦂔𦉙𦞬𦦽𧉤𧧁𧾨𨞼𨠒𨻂𨻳𩋢𩋫𩏹𩕾""",
    3,
    -14,
    -7,
    73,
]

yr73_2 = [
    """㢲㥃㥵㧷㨰㫔㫻㯎㴫㶧䅱䍎䤜䫀䬶䭓䭡䵪伌俒喷噀噴囤困圂坌埨奔媆嫩嫰寸巺巽忳恨悶愻慁憞扥扽拵捘捹揾搵摌敦歕殙涃涽渀溣溷潠瀳炃焌焝燇犇睏睔睴硍碖艮
茛袸褪詪論諢謴论诨踲逊逩遁遜遯鈍銌鐏钝闷陯頓顐顨顿𠎻𠐢𠞬𠹀𡃝𡻨𢈛𣏔𣗁𣚪𣞇𣣞𣰘𣱂𣴞𤛁𤟢𤶕𥃩𥊭𥞘𦞢𦡵𦪔𦪚𦯀𦰭𦵣𧋕𧣵𧬪𧴺𨁇𨂱𨒼𩇇𩏅𩔂𩯄𪑒""",
    3,
    -14,
    -6,
    73,
]

hj74 = [
    """㛑㛶㜺㟁㡢㡺㢨㣓㪋㪚㪱㪵㬇㬮㮡㯘㱫㱭㲦㵄㻮㽩䀓䃹䅁䍐䎯䏎䏷䕕䕿䗰䛃䝢䝺䞼䠉䡬䥗䬤䮗䮧䯎䯘䯛乱亂仠伴侃倝偄偘傼兓冠冸判半厂厰叛叹咹哻唤喚喛喭嘆
嚾坢垸垾堓墁奂奐妧妲姅婩媻宴屵屽岸峖巏帴幔干幹弹弾彈彖忓忨怑悍悹悺惋惮愌愞憚懦懧扞抏拌按捍换捥換摊撺擹攛攤攼散断斷旦旰晏暵暺杆案桉桿梡椴榦槾
樌檊歎殩段毈毌汉汗沜泮泴洝浣涆涣淉渙湠湪溿滩漢漧漫漶潅澜澣澫澯澷濽瀚瀾灌灒灓灘灡灿炍炭烂烉焕煅煥熯熳熶燗燦爛爟爤爨牉犴狚猂獌玩瑌瑍瑖璨瓓瓘畔
疸痑皔皯盥盰看睕矔矸碝碫碳礝礶祘祼禶穳窜竄竱笇筭算簳粲糷絆緞縵绊缎缦罆罐翫翰肒胖腕腶舘葮蒜薒螒蠸衎衦褖襸覌観觀观觛詊諺謾譋讃讌讕讚谚谩谰豻貋
貚貦貫賛贊贯赞躖逭遃遦酇醼釠釬釺鉆銲錌錧鍛鏆鑚鑭鑵鑹鑽钄钎钻锻镧镩閈闬难雗雚難靽頖館餪饡馆馯駻骭鮟鱹鳱鴠鵍鶨鶾鸛鹳鼾𠈰𠡱𠦨𠯘𠰑𠺐𠻍𡄹𡅱𡘰𡛝𡞟
𡡗𡻩𢁗𢎪𢒞𢡵𢧀𢯫𢯲𢿜𢿢𣜢𣞔𣣚𣥥𣨀𣵼𣶡𣻬𣽥𤅎𤅒𤅩𤐲𤔔𤖰𤳉𤴯𤼐𤽅𤽕𤿧𥆶𥈉𥎢𥎣𥗺𥠅𥤳𥳪𥴵𦒅𦔔𦙀𦙵𦙹𦚓𦝝𦡨𧃙𧄽𧡵𧳩𨂞𨒃𨙏𨝑𨢈𨱚𨱝𨲊𨸗𨺣𩀼𩏇𩓤𩛻𩟍𩢄𩢔
𩤣𩭢𩯞𩹼𪆶𪈸𪋐丆""",
    3,
    -15,
    -7,
    74,
]

jm75 = [
    """㕕㝈㬄㵎㷳㹖㻵䁙䆠䉯䊲䋎䍺䒛䗃䘺䙪䙮䚲䳛䴮丱串偐僈刬剗剷办卝奻妟姲嫚孪孿宦幻患惯慢慣扮扳摜摱擐晏暥枧柵栅栈桟梘梙梡棧槵汕洝涧涮澋澗瓣疝盼睔瞯
瞷矔磵篡簒粯綄綰綻縵繝繯绽绾缦缳羼苋莧菚蔄薍藖虥虦裥襇襉襻覵覸訕諫謾讪谏谩豢贃贋贗赝赸輚轘辦釆銏鋬鏟鐗鐧鑻铲锏閒間间雁騴骭鳫鳱鴈鴳鷃麲𠄔𢈽𢴬
𢸥𢺟𣥃𣩔𤅲𤜵𥉀𥊫𥌊𥲏𦽞𧙧𧮺𨎫𨜌𨣇𨤄𩈬𩻘𪁡𪃛𪆿""",
    3,
    -16,
    -7,
    75,
]

xm76 = [
    """㜃㝸㞟㢧㢾㣐㧦㪇㪝㪨㬗㬫㭇㭓㯀㯠㳎㳬㴐㴜㸤㺹㼑䀎䀏䂩䄅䄠䅈䆄䈠䉵䍗䍻䏒䑶䒪䖭䛉䛹䝮䠣䡀䡓䡪䢥䢭䥖䨘䨷䪈䪻䬇䬼䴏䵖䵛传伣佃侟便俔倦倩偭傓傳僆僝
儙先刋剸劵勌勬匽卞卷县变咞咽哯唁啭善喭噮嚥囀圈圏埢堜堰塡填墕壂変夐奠姩姰娈婘婝婩媛媡嫸嬊嬿孌孨宴嵃巻帣帴庼廎弁弮彥彦徧忭怋怰恋悁悓惓惗慻戀战
戦戰扇抁抃拚拣掾揀揅援搧摙撁撰擅擶敻旋昡昪晛晵暗曫枧栫桊梋梘棈椫楝楥榗槇槙樿橂橏檈殿汌汧汳汴洊浰涀涏淀淃渲湅湔湣溅溎漩澱濺瀳灓灷炫炼烇烻煉煎
煽燕片牑牪牮牵牽狷狿猭獧玔玣现珔現琔琠瑓瑗瑱瓹甗电甸癜皘眄県眩眴眷睊睠睼瞑矎研砚硏硟硯碾禅禐禪穿竁竱箭篟籑糆糋絢絤絭絹綪綫線緣練緾縁縓縣縳縴
縼繏繕繟繾纎纏纒纞纤线练绚绢缐缘缠缮缱罥羡羨肙膳臶茜荐莚萰葕葥蒝蒨蔙蔳薦蚬蜆蜔衍衏衒袨袸裫褑褤襈見覍覵见觾諓諯諺謆譔譱譴變讌谚谴豣賎賤贙贱趼
軐転輤輾轉转辗这迿选這遍遣選鄄鄯醼釧鈿鋻錬鍊鏇鏈钏钿链镟閞閵闐阗院隌電霰靛面靣頨顫颤飬飯飰餋餞饌饍饭饯馔駨騗騙騸驠骗骟鬋鰊鱄鶨鷰麪麫麵麺鼰𠢚
𠫹𠭹𠯴𡝟𡟤𡼓𢂱𢂺𢃘𢅝𢋮𢌨𢍏𢐄𢚀𢤚𢳄𢿌𣈠𣎔𣚓𣚢𣣣𣦖𣧛𣪭𣬏𣸇𣹥𣿊𤀲𤂿𤗛𤘠𤩄𤩱𤪮𤬝𤮜𤹨𤺇𥃹𥄝𥆞𥍚𥔱𥤵𥦟𥭞𥰢𥰳𥳢𥴱𥵏𥻩𥽸𦅆𦋈𦌔𦌾𦔿𦗁𦛔𦶋𦽃𦽄𧂁𧂂𧍨𧍴
𧎥𧗳𧚫𧩅𧩰𧭦𧭽𧯦𧳿𧽫𧾩𨁁𨁍𨆈𨉥𨏉𨖠𨖱𨘙𨘞𨚕𨤑𨨰𨬔𨭖𨳲𨷓𨹵𩂵𩃀𩈹𩒖𩜇𩟁𩥇𩰍𪋁𪍧𪑈𪑩""",
    3,
    -17,
    -7,
    76,
]

xc77 = [
    """㔅㗛㙩㚁㞁㞙㢗㧼㬓㬭㰾㳮㴥㷖㿢䂃䃝䆗䆻䇌䉼䊥䊮䎆䏇䐹䔄䔙䞄䠷䢧䧂䨅䬰伄俏俵偢僄僬僺剽劁劭勡卲叫召吊呌咲哨啸嘂嘨嘯嘹嘺噍噭妙娆嫖嫽嬈嬓嬥少尞尥
尦尿峤峭嶠帩庙庿廟弔徱徼悄慓抭掉揺搖摇摽撨敫敽敿料晱曌曜朓枛樢歗氼溺漂潐炓炤烧焳焼照熎熦熮熽燎燒燳燿爑爒爝獟獠獥玅璙疗瘭瘹療眺瞾票穾窍窎窔窱
窲窵竅竗竨笑筄篍篎粜糶約絩繞约绕翏耀肖脁膫艞茑莜葽蓧蔈蔦藋藠裱要覜覞訆訋詔誂誚調譙譥讑诏诮调谯趒趭跳踃躈轎轿遶邵醮釂釣鈟銚鋽鐈鐐鑃钓铫镣闝陗
鞘鞩韒頫顅顟顠顤驃骠髚魡鷂鷣鷯鸄鹞鹩𠍩𠘣𠟋𠣫𠥑𠧙𠹑𠿕𢚋𢡰𢥚𢶡𣤹𣩢𣩰𣹝𤉎𤊽𤑗𤾛𤾫𤿨𥁮𥌺𥛰𥡤𥭝𥲟𥽁𥾯𦌒𦡱𦾾𧅈𧇠𧢢𧣌𧾐𨅋𨎬𨡃𨳀𨹸𨾾𩈮𩕐𩙒𩬏𩮳𪌪𪑊𪖷""",
    3,
    -18,
    -8,
    77,
]

xc78 = [
    """㒵㘐㯡㷹㹸㹿䈇䍜䏴䑲䔠䡚䫉䶂䶌乐仦仯俲傚儤刨効哮嗃嘋坳垇奅娋婥孝岰巧忁恔悎抝拗挍撽效敎教敩敲斅斆斍校桡棹楽樂橈櫂毃泡洨淖滘漖潲炮烄爆犦獶珓疱
皰睄砲礉礟礮稍窌窖笊箌箹緢罩羄胶膠艄袎覐覚覺觉詏豹貌趠踔軪較较酵鈔鉋鑤钞铇閙闹靤靿餃饺骲髱鬧麭𠅈𠕥𠕭𠟅𠹕𠻥𢂹𢅉𢝍𢲷𢼫𢾐𣂬𣕇𣟇𣠜𣨇𣱓𣴟𤝧𤟞𤥰𤫷
𥁒𥃺𥄹𥦢𥬓𥵦𦀸𦓴𦦛𦿃𧣪𧭤𧱐𧳒𧳝𨌬𨗡𨛍𨠖𨢪𨣙𩂞𩑴𩛨𩯆𩷹𩾡𪍈𪛀""",
    3,
    -19,
    -8,
    78,
]

hc79 = [
    """㒻㘪㙱㚐㚪㜜㜩㞻㟼㡌㥿㧌㪞㫧㬥㲒㲧㴘㺺㿋㿞䊭䋃䌦䎋䐧䒵䚽䜒䤖䪽倒傲僗冃冐冒凿到劳労勂勞叝号吿告哠喿噪噵嚗圫埽報墺套奡奥奧好媢嫪嫯导導嶅帱帽幬
悼慠慥憦懊扫扷报抱掃搞撡操擙旄暴曓曝橯檤毷氉涝漕澇澳瀑灶烄焘燠燾犒瑁璹瓙痨瘙癆盗盜眊矂祮祰祷禞禱秏竃竈糙縞纛缟翢翿耄耗耢耮膏艁艒芺芼菢菿萺蔜
藃號虣衜衟襙覒誥謟謷謸譟譹诰趮蹈躁軂軇造道郜鄵鏊鐭鑿镺隩靠驁骜髝髞鮳鯌鲓鷔鼜𠰛𠴼𡄒𡜲𡠖𢍎𢕟𢝌𢞟𢤁𢮞𢯾𢲵𢳆𢽢𣔺𣚇𣚧𣜦𣝏𣨔𣨻𣭀𤃵𤉍𤓾𤔣𤝐𤩭𤷘𤺾𥆲
𥽹𦒺𦗮𦳁𦺜𦽡𧇒𧇼𧋓𧝘𧠼𧬁𧯍𧸾𧼤𨃣𨇅𨘴𨧪𨱦𩈞𩊅𩋺𩝝𩟇𩫁𩫦𩲊𩼈𩿂𪃑𪍻䆴""",
    3,
    -20,
    -8,
    79,
]

ge80 = [
    """㖠㘞㘴㘸㞅㟇㰤㳀㵑㾧㿚䃺䇔䉓䙃䞆䟶个些亣他伿佐作侉侳俰個做刴剁剉卧吤咊和哆哪唾啊坐坷堁夎大奈娑媠嫷尮左座惒惰愞憜懦懧挅挆挫摞播攍攠敤桗椤楇欏
毤毻沎涴涶痑瘅癉盉破硰磋磨稬穤箇簸糥糯纙耱腂臥莝蓌蔢藦蚵袏袔襎訸誃課譒课貨賀货贺跢蹉軻轲过逤逻過邏那郍銼鐹锉餓饿馱駄騍驮骒髁龢𠘺𠡀𠱯𠴸𡋲𡓷𢒐
𢚂𢯽𣧷𤆏𤤸𤨗𤻌𥞛𦓢𦔭𦺞𦽅𧒖𧜲𧝂𧟌𧥵𧧇𧬂𧬱𧹐𨇽𨛏𩅡𩟂𩣵𪍌𪘐""",
    3,
    -21,
    -9,
    80,
]

ma81 = [
    """㓔㕦㖡㙈㙤㣾㰳㴬㶚㾝㾺䀅䂞䃎䃻䄍䆉䆛䉣䏑䒲䕢䖳䗪䟕䠶䢝䣕䣖䤳䧞䩗䩻䩾䵭丅下乍亚亜亞亱仛价侂侘俹借假偌傌價冴化华卸厍厙厦叭吒吓吗咤哆哋哧唬嗄嗎
嗻嚇坝坬垻壩夎夏夓夜奼姹娅婭嫁嬅宱射岔崋差帊帕廈弝徣怕愘懗把挜掗揢搲搾摦攨斚斝暇杩杷杹架柘桦椵榢榨榪榭槬樜樺欛汊泻涻渃渣溠瀉灞灹炙熫爸犸犽狛
獁疜疨睱矺砑砟祃禡稏稼笡籍紁缷罅罢罵罷耙胢胯膪舍芐華蓌蔗蕐藉蜡蝋蟅衙衩袙褯襾覀覇觟觰訍訝詐詫誜諕諣謑謝讶诈诧谢貰賈贳贾赦跁跨踷躤迓酠醡鏬閕閯
霸靶駕駡騇驾骂骻髂鬕鱯鳠鵺鷓鹧麝𠀸𠅗𠅱𠆙𠆦𠚺𠤎𠮟𠳌𡕒𡖺𡺷𢆣𢇗𢉤𢉿𢛟𢜿𢲶𢺞𣇧𣉩𣍏𣛽𣣺𣨜𣶋𤗜𤗭𤙱𤝇𤟝𤬦𤸻𤺔𥉊𥋣𥏝𥑡𥒧𥕕𥘦𥝧𥧰𥻴𥿊𦈤𦔯𦖐𦜖𦨦𧀹𧌊𧌖
𧎭𧓺𧙝𧛼𧝫𧞝𧠈𧧻𧩶𧪨𧪹𧫗𧬮𨀠𨂒𨃖𨋘𨓴𨡗𨻲𨽯𩃴𩘧𩨜𩩱𩬟𩮅𩲏𩵏𩶞𩶱𩹏𪋧𪍅𪘺乤""",
    3,
    -22,
    -10,
    81,
]

yh82 = [
    """㔀㙣㢓㤮㫛㺊㼜㼽㾗䀶䁁䅮䊑䌙䍚䕞䘮䞪䤑䦒䦳䩨䩫䬬䬺䭐䭥䵁䵮丄上両两丧亢亮仗仧仰伉伒俇俍倞倡偿傍傥儅償儻儾兏兩养况凔创刱剏剙創勥匞匟匠向吭哴唱
唴喨喪嗙噹嚮囥圵圹埌塝塟墇壙壮壯壵妄妨姎姠嫎宕将將尙尚岲嵣嵹嶂帐帳幛广広廣张張弶強强当徬忘怅怆怏恙恦悢悵愴懬懭懹戗戧扬抗挡挷掚掠揚搒摥摪摾撗
擋攩放敭旁旷旺昿晑晾暢曂曏曠望朢杖枊柍样桁桄棒楧榜様樣櫎欀汤況浪涨涱淌湯湸漡漲漾潢瀁瀇灀炀炕烫烺焋焵焻煬燙爌牓犟状犺狀獞王珦瓺畅當畺畼痮瘬瘴
盎盪盳相眖眻瞕矌砀砊碭礑糡糨絖綁緉纊纩绑羕羻胀脏脹臓臟臦舫艕荡菪萫葬蒗蔵蕩藏蘯蚢蟓蠰行訪詇誆誏誑誯諒諹謗譲讓让访诓诳谅谤貺賬賶账贶趤趽踼軦迋
逛逿邟邡鄣酱酿醠醤醬醸釀量銄鐋長镸长閌閬闶阆防障雼韔頏颃颺飏餉養饟饷鬯𠄞𠅹𠍵𠗾𠚊𠹃𠺘𡇈𡇵𡔞𡚹𡠘𡾇𡿝𢓋𢖧𢗺𢛛𢟣𢢌𢪾𢳑𣂳𣄅𣄴𣉗𣊝𣍦𣒸𣖮𣗹𣚦𣥊𣨣𣴣
𣶍𣻡𤖽𤘲𤵼𤶜𤽣𥆜𥇉𥇔𥒳𥟚𥠴𥥩𥫼𥭚𥲠𥴻𥽬𦀜𦚞𦢎𦣩𦥰𦺫𦿆𧅺𧖒𧥴𧧄𧫛𧫢𧬰𧻴𨄗𨇁𨉱𨌄𨖌𨡓𩑈𩝾𩞃𩞥𩳤𪀘𪎵𪏪""",
    3,
    -23,
    -2,
    82,
]

jk83 = [
    """㘫㡠㡧㱏㶇㼞㽀䀻䂻䈣䓝䔔䙬䛭䡖䨻䰢並令併侦倂倞倩偋偵傡儆儬净凈凊劤劲勁另命咏啈圣坓墭夐妌姃姓娉婙婧孟寎帧幀并幷庆性怲悙慶挣掅掙掽摒摬政敬敻映
晟暎曔更朾柄梷棅榜横橫檙檠正汬泳浄浧淨渹滰澃瀞瀴炩牓牚狌獍琞璥病盛盟眐矎硬碰禜穽窉竀竝竞竟竧競竸絎聖聘胻葝行証詇評詗詠詺誩請諍證证评诇诤请貹
賆賏跰踫軽輕轻迎迸逬遉邴郑鄭醟鈵鉼鋥鏡鑋锃镜阱靓靕靗靚鞕鴴鸻𠄵𠔻𠖆𠷐𡁊𡉄𡾛𢆩𢊜𢏰𢔤𢹑𣅷𣬙𤯡𤴓𥃴𥅸𥊼𥍣𥖗𥯙𥱨𦕡𦝷𦥍𦨤𦨬𧗪𧡈𧩱𧻓𨅘𨆊𨤂𩂦𩃋𩇖𩋹𩓞
𩮟𪂤𪇇""",
    3,
    -24,
    -11,
    83,
]

jk84 = [
    """㑞㓈㚺㝎㞌㣷㮓㲌㵾㹵㿦䋯䒅䒌䔭䙢䞉䠬䥌䥭䮚䮴䰝䱆䱍䱎䲛䵴乗乘亘亙佞侫俓倰偁傰僜兴冥凌凝凭凳凴剩剰勝听噟坕堋堩墱媵嬹孕宁定寍寕寗寜嶝应庭廷径徑
忊応慿應懜懵掅掕掟揯搄撜暝桱椉椗榺橙櫈殸氶泞滢濎濘濪瀅烝爯瑩甑甯症痭睲瞑瞪矴碃碇碠磬磴磸秤称稱穪経經綮经罄聴聼聽胜胫脛膡臖興芿莹蓥蕂褮覴訂誔
證譍订賸贈赠踁踜蹬蹭迳逕邆邓鄧醒釘鋞錠鎣鐙鑋钉锭镫隥霯靐靘靪顁飣饤驓鯍鱦鸋鼮𠄢𠄣𠈤𠊶𠐧𠟂𠲮𡄔𢔧𢣙𢬫𢯭𢺰𢿤𣎄𣢳𣩟𣰜𤕀𤱴𥅨𥇓𥔂𥖬𥥻𥦜𥯢𥳰𥸧𦄊𦡻𦢯
𦩩𦫭𦿅𧀧𧄼𧑗𧪝𧭭𧰩𧱴𨆪𨆱𨎤𨚱𨧭𨮒𩇝𩰹𩸀𩸎𪎻𪑬𪒘𪒟""",
    3,
    -25,
    -11,
    84,
]

yz85 = [
    """㑳㓂㓜㔌㔷㔿㕻㖃㖟㗕㗜㙀㛒㜌㝅㝊㝌㝤㠇㡱㢄㤱㦞㨌㩆㰯㲃㳶㵵㶯㹨㺠㼙㽬㾭䀁䀤䃓䄂䄈䅢䆜䇺䊘䋓䋴䌂䍍䐢䒄䓮䔏䔰䙔䛆䛠䛵䜬䝭䞥䞧䞬䟝䟬䠐䠫䤅䦣䩜䪖
䪷䬦䬨䳹仆伏伷佑佝侑候偻僂僦僽兽冑冓冦冨凁凑副匓匛匶厚厩又収受句叩右后吼呪咒咮售嗅嗕嗖嗽嗾噣囿垨堠塯壽夀复够夠奏姆姤姷娒媾嬦嬬嬼守宙宥宼宿寇
富寿就屚岫峀峟幼廄廇廏廐廖彀後復怐怞惾愗慦憱懋懤戊扣捄授揉揍搆撀擩收敂敊救斗斣旧昼晝暓构柕柚柩柾栯梄梎梪椆楙楱槈構槱櫾殠殧毭沤油洉浢湊溜溴漏
漚漱潄澑灸煣煹熰牰犹狃狖狩猚猶獸珛琇璓甃畄留畜畱疈疚疛痘痩瘘瘤瘦瘶瘺瘻癅皱皺睺瞀瞉磂祐秀究窌窛窦竇竎筘簆簉籀籒籕粈粙糅糔糗綉綬縐繆繇繍繡绉绣
绶缪耨胄脰腠膄臭臰舊茂荳蔟蔲蔻蘨蜏蜼螑袖袤袧複褎褏褔覆覯觏訽詋詬読謏謬譳讀诟读谬豆豞豧貁貿購购贸走赱蹂軁輏輮輳輶輻辏迶逅透逗遘遚郖鄇鄮酎酘酭
釉釦鈾銹鍑鍢鍭鎒鎦鏅鏉鏤鏥鏽鐂鐞铀锈镂镏閗闘陋雊雡雺霤鞣韖韝飂餖餾饾馏首駎驟骤骺鬥鬦鬪鬬鬭鬸鮈鮜鯦鱟鲎鲘鴢鷇鷚鷲鹨鹫鼬齅𠊣𠊱𠣿𠱔𠻳𡂝𡙬𡜳𡞜𡟳
𢃸𢈓𢑇𢓟𢓵𢔲𢘅𢚫𢞭𢟭𢠲𢣠𢷗𢽭𣅄𣆔𣉾𣒻𣓕𣓛𣛾𣞜𣤋𣪸𣫌𣬽𣻎𣻖𣻱𣽕𣿟𤀨𤁮𤅋𤚯𤚼𤞟𤠼𤤬𤬏𤮷𤴨𤸃𤸑𥀃𥀙𥅠𥆆𥆷𥉇𥊧𥌐𥙰𥛅𥥷𥥹𥦅𥧒𥧕𥨌𥯪𥲃𥲝𥷱𥺉𥿷𦁖𦂈𦂊𦅸
𦉉𦎯𦎼𦦅𦭻𦳩𦳿𦴎𦸢𦺀𦺒𦼪𧃛𧆘𧔅𧙏𧛸𧜃𧡑𧡣𧩨𧫞𧫾𧭍𧯼𧱓𧱪𧲿𧵈𧷡𧺢𧻁𧾻𨂡𨄋𨔙𨕦𨖏𨝢𨡭𨢇𨨯𨫒𨶜𨹜𨹟𩀫𩄢𩊄𩊪𩍧𩑣𩗪𩙷𩜷𩥋𩭺𩹀𪁮𪃆𪃺𪅡𪆩𪇂𪇞𪈀𪉮𪋺𪐺𪖛
㙧䓻䩽乧""",
    3,
    -26,
    -12,
    85,
]

qb86 = [
    """㓄㤈㯲㱽㴆㵕㼉䈜䌝䏕䑤䕃䜗䜟䧵䫴䲴䶖临任伈侺僸冞吟吢吣唚喑噖噤噾堷夦妊妗姙寖廕愖扲抋揕搇枕沁沈浸涁深淾渖渗滲濅甚瘎癊瞫祲禁窨笒紝紟絍纴罧臨荫
莐蔭衽袵訡譖譛讖谮谶賃赁赺邥酖鈂鈊鋟锓闖闯飮飲饮鴆鵀鸩齽𠗿𠜘𠢱𢊖𢋆𢙿𢬶𢱶𢱷𣖯𣨠𤘡𤵂𦧈𧆂𩂈𪔽䥠""",
    3,
    -27,
    -13,
    86,
]

kj87 = [
    """㘕㜮㤾䀍䌫䐄䐺䗊䗣䘓䟅䨵䫅䬓䯥䲺三俕倓僋儑凵勘参參叄叅唅啖啗噉嚂嚪墈壏姏婻帎惔憛憨憺憾懢担探揞撍擔暂暗暫歛汵沊浛淡淦滥漤澏澹濫灠灨爁琀甔癚瞫
瞰矙磡竷篸紺纜绀缆腅舕莟蓡蛿蜭詌誩賧贑贛赕赣蹔錎錾鏨閐闇闞阚隌霮顑顲饀馾鬫黚𠥴𢬷𢹙𣽦𤁡𤂺𤃨𤿏𤿒𥇌𥓒𥲇𥳬𥸢𦛚𦧡𧗋𧯰𧸦𧽯𨣨𩈉𩈊𩕠𩕤𩖺𩞿𩤞𩾺𪀩𪉧𪉯
𪊇𪚬""",
    3,
    -28,
    -14,
    87,
]

yj88 = [
    """㙴㛪㜞㝪㟻㣣㦔㪁㮇㱨㶺㷔㼭㾆䀡䁮䃱䃸䈴䊴䛳䠨䦲䧔䪜䯡䱤䶫佔俺傔僭兼剑剣剱劍劎劒劔占厌厭唸噞坫垫埝堑堿塩塹墊壍姭嬮嬱嶦幨店忝念惦掞敛敥斂曕棯椠
槧欠歉殓殗殮沾淹滟潋潛潜澰濳瀲灎灔灧灩焔焰煔熌熖爁爓猃猒獫玁痁盐砭硷碱稴窆羷胁脅脇舚艌艳艶艷苫菾裧裺襜覎覘觇譣豓豔贍赡趝酓酽醶釅韂頕餍饜騐験
驔驗验鰜鳒鹸鹼鹽𠊌𠘥𠚆𠶧𠷖𡄑𢕯𢕻𢖝𢜰𣃾𣄝𣟺𣣈𤅸𤒦𤗻𤬯𤴿𤽿𥇞𥜒𥣘𥮘𦁇𦁏𦑎𦒻𦩵𧠛𧸘𧻒𨡎𨡣𨢯𨸱𨼮𩅀𩅼𩆔𩉔𩟅𩟋𩩶𩪴𩳢𪙊""",
    3,
    -29,
    -14,
    88,
]

xm89 = [
    """㒈㕨㣌㦑㪠㸥㺘㽉䀀䧟䪌䱿䶟儳剑剣剱劍劎劒劔埳帆忏懴懺揞摲梵欠氾汎沨泛淹渢湛湴溓滼甉监盕監站肷膁臽艬蘸覱訉譀譼讒谗賺赚釤釩鉴錎鍳鐥鑑鑒鑬鑱钐钒
镵闞阚陥陷韽顑颿餡馅鬫𠚹𢐎𢕭𣓒𣳤𤀩𤜇𤬨𤭍𤮭𤼋𥃵𥅒𧀡𧮽𧸖𨇦𨇩𨳂𩦹𩰃𪉜𪉦""",
    3,
    -30,
    -14,
    89,
]

wu90 = [
    """㑉㑛㒔㓐㓘㕰㖨㗤㘲㙏㚆㛬㜅㜈㜙㜚㝛㞘㞺㠅㡔㣃㣎㤢㥌㥔㦇㦽㧅㩋㪖㪩㪶㬘㬼㮋㯈㯟㯷㰗㰲㲫㴼㵀㶖㷤㹼㺉㻃㼾㽇㽤㾄㾇㾥䀰䀲䃙䃚䃞䃤䄾䇍䈸䉛䊾䋭䋹䌒䍡
䎌䎑䎘䎼䏋䏱䐁䐨䐿䑁䑵䑿䔎䕮䗇䗱䘵䘻䙒䙯䛙䜡䜯䜼䞱䞽䟟䟮䟿䠞䡜䢗䢱䤋䥮䧤䨱䩮䪁䪕䫝䫳䮱䮷䱡䳱䴪䵈丵仆伏俶俼倏倐偪傗僇僕儥儵六凟剢剭副剹劅勂勎
勠匊匐匑匔匵卜叔吿告哊哭唂唃唷啄喅喌喐嗀嗖嘼噈嚛囿圥坴坶垘埱堉塶塾复夙娽婅婌媉媨嬻孰宍宓宿尗屋巈幅廘彧復忸恧惐慉戮扑拀拲掓掬搐摍摝摵撲擈攴攵
敊斀斛斣族昱暴曓曝曲服朒木朴朷柚柷栜栯栿梀梮棛棴椂椈椟椱楅楘榖槒槭槲樎樕樚樢樸橚檏櫝欎欝殐殧殰毂毓毣毩毱汋沐沑泦洑浊涋涑淑淕淗淯渎滀漉潚澓澳
濁濮濲瀆瀑瀫炑焀焂焴煜熇熝熟燠燺牍牘牧犊犕犢独獛獨玊珟珿琡琭瑴璛璹瓄甪畐畜疁疈疛痜瘯癁皾盝目睦睩矗砡碌碡磟磩礇祝祿禄福禿秃稑稢稪稶稸穀穆穋穙
竹竺笁筑箙箼築篫篴簇簌簏簶粛粥粶粷糓絥縠縬縮繆纀缩缪罜翏聏肃肅肉育腛腹膔舳艒苖苜茯茿荲莤莥菊菔菽萺葍蒮蓄蓛蓫蓻蓼蓿蔋蔌蔍蔔蔛蔟蕧薁藗蘛蘜虙虣
虪蚞蜟蝠蝮螜螰蟏蟰蠨衂衄袬袱複襆襡襥襩覆角觫觮觳觷觻誎読諊諔諨謖讀讟读谡谷豄豖贕趗趚趜趢跾踀踓踘踛踧踾踿蹗蹙蹜蹴蹵蹼躹軮軸輹輻轂轆轐轴辐辘逐
速逳遬郁鄐鄜醭鉃鉐鋉錥鍙鎐鏃鏉鏕鐭鑟镞閦閰阿陆陱陸雮霂鞠鞪鞫韇韣韥顣餗馥騳騼驌驧骕骲髑鬰鬻鮛鯥鰒鱁鱐鱳鳆鳪鴔鵚鵦鵩鵱鵴鶝鶩鷫鸔鹔鹜鹿麓麯麴麹
黩黷鼀齪齱龊龣𠁡𠁮𠅩𠇘𠋩𠐍𠣾𠤄𠨭𠩀𠩉𠬝𠮑𠱙𠷃𠸹𡄱𡎺𡒒𡔴𡕨𡖊𡖯𡞪𡡐𡻬𢄧𢈲𢌹𢌻𢒰𢞣𢫭𢬳𢯅𢲿𢷺𣈊𣋉𣒇𣖣𣖫𣞓𣡉𣢰𣣎𣤶𣥹𣨍𣨓𣩏𣫀𣰬𣱶𣵸𣶘𣹬𣼟𣽆𤌂𤗵𤘵𤛝
𤛟𤜔𤞞𤟘𤠽𤡃𤥔𤨍𤭴𤳕𤺼𤼳𤽺𤾅𤾣𤿴𥀔𥀝𥃨𥃿𥄈𥈛𥉑𥉶𥍞𥎮𥐁𥐿𥑯𥒨𥒭𥖠𥖿𥚊𥛞𥞏𥟽𥣤𥣸𥨍𥪋𥪚𥪱𥫰𥮗𥲎𥳇𥵠𥷆𥷚𥷞𥷼𥸪𥺞𥼀𥼜𥼫𥽧𦌟𦌷𦎭𦏕𦏧𦓖𦗓𦛓𦟠𦡭𦤊𦨈
𦨋𦩡𦪇𦬙𦱀𦱒𦸐𦼋𦽂𦽎𦾕𦾫𦿁𦿖𧁃𧁿𧂔𧄏𧄛𧅲𧇝𧌉𧌍𧎲𧏿𧐁𧐈𧐒𧐰𧐳𧑙𧗱𧚀𧜦𧞒𧞰𧞺𧣡𧣼𧭎𧯩𧯱𧲇𧳂𧳌𧴌𧴤𧶠𧹲𧹴𧹾𧻰𧼕𧼭𧼱𧽥𧽧𧽷𧿻𨁀𨃕𨄕𨋩𨌠𨌥𨍎𨎸𨏔𨕢𨜘
𨞓𨢋𨢤𨣗𨨳𨩬𨪎𨴰𨵟𨶝𨷙𨸰𨽂𨽍𩅄𩈇𩋟𩋨𩌫𩍔𩍸𩐡𩐫𩑒𩓪𩘰𩘹𩛭𩛺𩛼𩜲𩞈𩞾𩢰𩣱𩧈𩫴𩬜𩯏𩯱𩱌𩱙𩱫𩱱𩲠𩲬𩲾𩳒𩳥𩴍𩵦𩵬𩶖𩶩𩶫𩷌𩹱𩺯𪀣𪄑𪆀𪇗𪇰𪈅𪋝𪋡𪌓𪌬𪍂𪍄
𪍠𪍹𪐮𪒏𪒢𪔿𪕷𪖈𪖩㑐㳤䇚䔩䖡䗛䘐䚼䛢䨹䱙䶊""",
    4,
    -1,
    15,
    90,
]

wo91 = [
    """㒒㔄㙇㦺㩴㫽㮂㯮㻿㿥䅇䅶䈞䋰䌚䌵䎤䐂䑑䒼䓯䕽䙱䚄䚛䛤䜹䞖䞝䟉䠱䡞䥔䧊䧼䪅䱚䳔䴆䴰䶜仆侷促俈俗傉傶僕劅劚勂勖勗北匤吿告哫喾嗕嘱噣嚛嚳囑娽媷孎局
属屬峪幞彔录彳悎慮慾憟拲挶捁捒搙斀斣斶斸旭旮曯曲朂束梏梮檋欘欲歜毒沃泶洬浀浴淥渌溽潥澩灟烛焅熇燭燺爥牿犦狱獄玉珛琟疁瘃督瞩矚砡硲笃筁箓篤籙粟
絭綠緑縟續纛续绿缛脨臅臛菉蓐蔋薥藚虑蛐蜀蝳螸蠋蠾裻褥襆襡襥襩襮触觷觸誎贖赎趗趢趣足跼躅軉輂輍辱逯鄏酷醁鈺鋈鋊鋦錄錊錖録鏷钃钰锔镤隺頊頶顼駶騄
髷鳿鵒鵠鶮鸀鹄鹆麹𠀛𠆐𠉩𠑯𠫣𠻧𡈨𡉎𡝈𢅞𢈠𢏷𢒔𢖏𢛚𢝂𢩁𢫵𢺡𣀻𣤁𣤯𣯋𣯼𣵽𤌍𤗁𤚚𤞞𤬂𥁯𥋛𥓇𥓍𥝍𥞴𥟾𥻆𦅽𦺇𧉣𧛔𧞹𧠂𧢶𧢻𧣈𧤑𧨹𧰵𧼙𧿷𨂭𨋧𨍯𨞕𨧙𨴬𩌮𩔴𩪉
𩭊𩱨𩷐𪁕𪇆𪌶𪎤𪑌𪑾𪕝𪚯""",
    4,
    -2,
    15,
    91,
]

jt92 = [
    """㓸㙸㙾㦝㧻㩧㪬㮶㰌㰒㱋㱿㲉㴶㵡㶅㹊㹒㺟㺪㼎㿺䁷䂍䃕䃗䇶䈏䑈䓎䕴䠎䡈䥃䥤䦠䨌䨔䪨䮓䮸丵乐仢倬偓傕剝剥劅劰卓啄啅喔嗍噢噣嚗圤埆塙墣墧壆壳娕娖媉学
學岳峃嶨嶽幄悎悫愨慤懪戳捉捔捳掿握搉搠搦搻擉擢攴攵敩数數斀斅斆斈斍斠斮斲斵晫朔朴桌桷棹椓楃楽榷槊槕樂樸檏櫂欘欶殐殻殼汋泶洬浊浞涿渥澩濁濯灂炇
烞燢燩爆犖犦玨珏珿琢琸瑴璞瓁瓝甪皃眊瞀瞐瞨矟矠硞确硺確碻礐礭穛穱窇箾篧簎籗籱翯腛荦药菐菿葯蒴薬藥蠗覐覚覺觉角觮觳觷諑謈诼豰豿趵跑踔較较邈釙鋜
鎙鐲鑡钋镯隺雹鞄鞪韄韷顜颮飑駁駮驳骲髉鰒鳆鳪鴬鵫鷟鷽鸐鸑鸴齪齱齷齺龊龌龏龣𠡑𠡞𠮭𠿟𡇱𢁁𢧈𢳇𢽚𣄻𣋵𣒆𣝇𣨡𣪹𣷥𣸛𣻘𤆝𤿈𤿩𥀎𥀣𥆌𥇍𥗟𥛟𥢔𥭓𥭖𥵤𥷮𥼚
𦂗𦃗𦋞𦓐𦜰𦢊𦯏𦳹𦷵𧂒𧃔𧞐𧢼𧣚𧣺𧥋𧨳𧱰𨁿𨊿𨖮𨘷𨧧𨨺𨭂𨮸𨰆𩌊𩌭𩍪𩓥𩣡𩧏𩪛𩭟𪑱㔬""",
    4,
    -3,
    16,
    92,
]

vi93 = [
    """㑵㓖㔑㔕㔘㖅㗌㗚㗧㘉㘍㚕㜱㜼㞊㟳㢶㢸㣟㣰㤕㤜㧒㨽㪤㫘㮚㮿㰵㲺㳑㳚㳴㳼㴵㵥㺩㺷㻎㻫㻭㻶㾁䁥䄶䆝䋖䌏䎉䏄䏘䑇䒤䔁䖩䘌䘏䘤䛑䜠䟆䟈䟌䟣䡃䢕䢖䢞䢤䢦
䣛䤉䤎䩛䫕䫻䬄䬆䬛䬹䭿䮇䮡䰬䱃䱣䳀䳳䵑䵒䶡一七乙佖佚佶佾侄俼傈僁儨凓出劕劮匹卆卒卛卩卪卹厀厔叱吉呹咥咭咰唧喞囸圪堲塛壱壹夁失夶妷妼姞姪嫉嬄嬺
宓实実室宲宻密實寽尼岀峚崒崪嵂帅帙帥庢弌弻弼彃律必怭怵怷怸恄恎恤悉愱慄戌抳抶拮挃捽揤搮摔擳日昵晊暨暱曁朮术枇柒柣柫栉栗桎桼楖榓槉樒橘櫁櫍櫛欥
欪欯欰比毕汩沏沕沭泆泌洷浂淧溢溧滗滭滵漆潏潷瀄炢炪焌熚燇燏犵狤獝率珌珬琗瑟瑮璱瓆畢疋疙疾痆眣眰矞礩祇祑祗祬秖秩秪秫秷窋窒窸笔笜筆筚箤箻節篥篳
紩絀絉縪繂繘绌罼翐耴聿肀肷肸肹胇胵腟膁膝膟膣臮臷臸节芛苾茁茟荗荜蒺蓽蔤藌虱蛣蛭蜜蝍蝨螏螲蟀蟋蠠術衵衹袐袕袟袠觱訹詄詰謐诘谧豑豒貭賉質质趉趌跮
跸踤蹕蹫軼轶述逫逸遹邲郅郆釰釼鉍鉥銉銊銍銡錰鎰鏎鑕铋铚锧镒隲霱鞊鞸韠飋飶饆馝馹駜騭驆驈驲骘鬻魓鮅鮚鱊鲒鳦鴄鴓鴥鴧鴩鴪鴶鵯鶐鷅鷝鷸鹎鹬麜黜黢齣
𠇳𠋯𠌭𠓞𠘖𠚮𠜄𠞉𠞩𠟦𠡂𠦈𠦒𠨒𠩿𠮙𠯔𠲾𠷅𠷈𠷌𠹋𠹘𠻟𠽜𠽩𠿗𡀹𡂒𡆸𡇓𡈎𡉛𡉭𡊍𡚨𡛘𡠚𡻞𡿯𡿾𢀁𢀕𢁽𢍼𢑧𢔬𢕅𢕑𢘍𢟳𢧤𢪍𢯰𢯶𢱮𢴩𣁉𣆒𣎛𣏶𣘗𣘚𣛺𣢠𣢶𣨛𣸃𣻚𤂀
𤇳𤌿𤗪𤘷𤛱𤝍𤝞𤠺𤣮𤩰𤬕𤭽𤿠𥁑𥄵𥈖𥉴𥋁𥎐𥎹𥛘𥠈𥠲𥡢𥣮𥥌𥭐𥱃𥾅𦃊𦆄𦆾𦑋𦒑𦘩𦘪𦘲𦙮𦝭𦤻𦥏𦨙𦬸𦸓𦺖𧀬𧆦𧉆𧊥𧍓𧍱𧍶𧎿𧏻𧑐𧒓𧕵𧖅𧗿𧜔𧜠𧠫𧥑𧧓𧪠𧫡𧫤𧱊𧵼𧶡
𧷦𧺝𧺶𧻗𧽑𧽻𧾢𧾣𨀙𨃙𨅗𨍫𨑜𨑨𨗝𨜼𨜿𨞣𨠔𨧵𨪏𨲈𨴗𨻍𩇣𩉫𩋡𩋤𩗊𩘟𩘱𩘻𩢴𩧄𩬭𩲦𩳡𩴐𩶄𩺲𩾕𪁀𪂃𪄭𪅮𪋜𪍪𪒆𪗨𪗻㑁㓒㗭㯃䔞䜉乚乛""",
    4,
    -4,
    17,
    93,
]

wu94 = [
    """㐹㗵㠨㪄㭾㷉㻕䁌䎢䏌䒗䖇䘿䛥䞞䞷䠇䭮䯶䰴䵥不乀乞仏仡伆佛倔冹刜勿厥叞吃咈噄坲尉屈屹岉岪崛崫嶏巿帗弗弡彿忔怫惌拂掘昒昲曊柫柭欎欝欻歘汔沕沷灪炥
烼熨爩物甶砩祓笰粅紑紱紼綍绂绋翇肸肹艴芞芴芾茀莔菀蔚虳蛂袚袦訖詘誳讫诎趉迄郁釳鉘镼阢阣韍韨髴鬰鬱魆鮄鶌黦黻𠜾𠦪𠲽𠽵𡍡𡐝𡼘𡿥𢂀𢏍𢔥𢖴𢩯𢺴𣀣𣊞𣢊
𣨢𣭘𣮈𤆞𤉨𤎲𤐀𤟎𤡶𤬱𥊊𥏘𥘄𥘬𥮝𥺷𥾧𦁐𦐡𦛰𦦩𦨡𧌑𧥷𧱝𧺐𧼗𧼫𧼴𧽓𧿳𧿺𨊰𨑥𨧱𨵮𨷔𩂔𩂕𩉽𩎛𩏴𩐚𩓦𩖷𩖼𩜌𩠷𩣹𩧌𩨘𪑲𪓊""",
    4,
    -5,
    18,
    94,
]

yt95 = [
    """㐳㒴㔜㕹㖀㘺㛘㛲㜧㞽㟑㧾㨡㪍㪐㫚㬞㲞㳷㴾㵐㶿㷎㻠㽾㾶䀜䁫䇅䋐䍪䎀䎳䑔䓛䓤䖓䘚䙠䚝䞘䟜䟠䠈䡇䣹䤦䥟䦍䩐䪬䬂䬍䭯䮀䮩䯿不亅伐侓侼傠兀冹凸刖劂勃匢
匫卆卒卼厥发咄哕哱唿啒嗢噘噦嚉囝囫圽坺垏垡埣堀堗堨墢孛宊寣尳屼岄峍崒崛崪崫嶡彂忽怢怴悖惚愂愲憠戉扢扤抇抈抐挬捸捽掘掲揬揭揾搰搵摕撅昒昢暍曰曶
月朏杌杚枂柮栰核桲梲棁椊榲榾樾橃橛橜欮歇歾歿殁殟殨氒汨沒没沷泏浡淈淴渤湥滑灍熓熭牫犵犻狘猝猲獗玥琷璏瘚瘟発發瞂瞃矹矻硉碣碿礍稡突窟窣竭笏笜筏
籺粤粵糏紇絗縎纥罚罰罸羯胐脖腯腽膃舭艴荸莈葖葧蓇蕨藅蚎蚏蜶蟨蟩蠍袜襪訐訥誖謁讦讷谒貀趃趉越跀蹶蹷軏迌郣鈉鈯鉞鋍鍎鍻鐝钀钠钺镢閥閼闕阀阏阙阢韈
韤顝颰飿餑餶饳饽馉馞馧骨髪髮鱖鳜鵓鶟鶻鷢鹁鹘麧鼵鼿齀齕龁𠀚𠄌𠄍𠄑𠊲𠎮𠒄𠞀𠠶𠢤𠥰𠪶𠫓𠬛𠯲𠲎𠶹𠿋𡑚𡛌𡛟𡡕𡺴𡼿𢑢𢗉𢝀𢢒𢪃𢪏𢫫𢳙𢼁𢽨𢾬𣅚𣅝𣎚𣐋𣓗𣔻𣖬
𣢡𣦏𣧍𣧒𣩭𣭷𣯎𣰛𣲱𣿈𤇰𤚱𤛦𤟪𤣻𤦄𤶘𤷿𤸮𤼗𤿓𤿗𥁂𥈷𥌄𥐬𥕲𥗮𥝖𥞯𥠳𥧋𥨜𥩡𥩱𥯝𥾕𥾛𥾨𦁕𦍦𦎒𦎰𦏅𦔅𦖼𦗣𦛏𦜇𦝬𦠒𦤣𦤨𦨉𦩤𦪘𦬂𧈭𧛗𧢰𧤼𧩓𧬋𧳸𧽸𨀳𨁸𨉪𨊸𨋺
𨍲𨑝𨒋𨕚𨖃𨨷𨬐𨵗𩂂𩂗𩃁𩎙𩑡𩑦𩖨𩗓𩟕𩢎𩨳𩩠𩪗𩱚𩷚𩾻𩿠𪁽𪂒𪅄𪌔𪌰𪍛𪖶𪘧𪙈""",
    4,
    -6,
    18,
    95,
]

he96 = [
    """㒓㓉㔇㕲㖕㖖㣞㣵㧊㩵㭮㮫㳨㵣㵧㶬㸊㺚㻋㻝㿣㿹䀳䁊䃮䄆䄑䅥䈓䊛䌨䍨䏞䒷䕣䖧䘠䟛䟦䟯䡾䢌䣪䣮䣶䦚䦢䫘䬴䯋䯏䯦䯺䰖䱅䱫䳁䳊䳚䴲䵣䶛丐仴佸侻偺冟冭刽
剌剟割劊匃匄叐叭呾咄咱咹哒啈喇喝噠噧噶嚉囋囐坺堨夺奪奯妭妲妺姡嬒嵑嶭嶱帓幯怛懀懖抈抜抹拔拨括拶挞挩捋捝捺捾掇揦揧摋撒撥撮撻攃攋攥敓敚敠敪斡昩
昲暍曊曷末枂枺枿柭栝桚桰橃橽櫱歇毲毼汏汰汱沫沯泧泼洝活渇渴湏潑澾濊濣濶濽灒炟炥炦焥燤犮狚猲獦獭獺瓎痥瘌癶癹皌盋眓眜睕砞砸碣磆礍礤礸秡秣秳笪筈
粖粝糱糲繓缽羍聒胈胺脟脫脱臈茇茉荙莌萨萿葀葛蔎薘薩蘖蛞蛶蝎蝲螛蟽袯裰褐襊襏豁越趏跋跶蹳躂躠軷輵轕轢轹辢辣达迏迖适逹遏達酦醗醱鈸鉢鏺钵钹閼闊闥
闼阏阔靺靼鞑鞨韃頞頢頱颰餲饐馛騔驋骱髺鬎鬜鬝鬠魃魩鮁鮵鯻鱍鲅鴰鵽鶡鶷鸹鹖鼥齃齾𠅪𠔟𠛊𠜖𠞯𠟗𠥜𠯑𠯪𠰼𠱡𠱥𠱫𠳇𠷑𠸳𠾩𡀖𡄳𡊉𡊟𡌭𡎒𡾲𢂍𢃴𢆜𢇷𢉥𢉨𢗿
𢘇𢛁𢠺𢤆𢤎𢫬𢺉𢼠𣁳𣆈𣎴𣎵𣠹𣥂𣦵𣧣𣧧𣰌𣸉𣸐𣽅𣽰𣿌𤀤𤀦𤁢𤂷𤃴𤄔𤊶𤋂𤜧𤠀𤩲𤫵𤷈𤸎𤸏𤽌𤿀𤿖𤿫𥄕𥄗𥈙𥑾𥗓𥢸𥬎𥬒𥻉𥻦𥽘𥿉𦍒𦛅𦤚𦤦𦥦𦧍𦨯𦪑𦫔𦫕𦬹𦯖𦳺𦸈𦼵𧀕
𧓂𧔣𧖆𧗶𧘟𧙄𧭝𧯆𧯉𧺡𧺷𧺺𧼨𧿴𨀨𨂩𨃛𨅅𨇨𨈩𨉋𨐖𨓈𨞛𨠓𨡩𨣱𨯓𨷮𨷾𩃶𩊤𩋅𩌉𩑷𩒚𩕬𩖽𩗉𩗞𩞶𩡔𩢖𩢛𩩲𩫲𩯉𩯌𩯳𩱷𩸿𩿣𪑋𪒙𪒩𪓮𪗽𪗿𪘹𪙯㧮㩿㪂㵠䂗䑢䝆䨚䪲䯇
䴯""",
    4,
    -7,
    18,
    96,
]

xx97 = [
    """㑻㓞㓤㔍㔠㕯㗫㨸㪴㭭㮖㱜㳐䀣䀨䂒䆯䓭䕓䚴䝟䥷䦖䦪䫄䯉䰲䱻䴳䵵䶤䶪仈傄八刖刮刷刹剎劀劜劼叭咭咶哳哵嗐嗗嘎嘠圠圿妠娺察帊帓帕帴忦恝戛戞扎扒扴抜拔
挖捌捖捺捾揠揳搳摖擖擦札朳杀柭楬榝樧檫櫒歇殺汃滑煞猰猾獭獺玐痆眣睰瞎砎硈磆磍礣秳秸稭穵窡窫糪紥紮縖耫聐肭舝茁菝蔱蚻螖螛蠿袹袺詙詚詧豽貀趏跀軋
轄轧辖釛釟錣鍘鎋鎩铡铩閁閷鞂頡颉颳骱鬜鬝鮚鱊鲒鴰鴶鵽鶷鶻鸹鹘黠齾𠃉𠓣𠜵𠝚𠝛𠢆𠮜𠽹𠿡𡁌𡂠𡇼𡚟𡚭𡺧𡼛𢅑𢣼𢧖𢫢𢮊𢮌𢱴𢼣𢼤𣘤𣛶𣧖𣱺𣻑𤁪𤁫𤑣𤝒𤞠𤣸𤤒𤪆
𤪍𤫶𤳵𥇗𥉄𥌀𥎱𥐕𥐙𥑔𥔩𥤺𥯾𥰶𥴭𦉟𦉧𦎱𦤙𦧠𦧮𦰹𦳡𦵯𦸉𦸘𦸶𧈝𧔂𧕱𧞍𧶇𧷎𧽌𨋐𨳉𨵃𩉡𩊃𩎲𩏓𩖁𩝛𩟔𩡩𩥌𩨔𩨲𩭿𩮁𩮂𩮝𩳋𩴳𩷻𩿤𪄅𪆰𪇷𪈟𪑂𪑨𪒜𪒼𪖐𪗔𪗾㗶㞈㞉
㦫㵶丷""",
    4,
    -8,
    18,
    97,
]

xp98 = [
    """㐖㒝㓗㓭㓶㔃㔎㔢㕞㖏㖶㗧㘶㘿㙞㛃㜸㝂㞕㞯㢼㣯㤠㦢㧙㨝㩢㩪㫼㬚㬯㭈㭞㭩㮞㮮㯙㲳㳿㴪㴮㴽㸅㸞㸹㹟㻡㼤㽟㿱䀗䁾䂐䂼䅀䆕䆢䆷䇷䈼䊝䊦䋉䋢䌘䌩䍳䏐䏟䏲
䏳䐼䒆䒸䓆䕙䕵䖦䘁䘊䙝䙽䚢䛎䝌䞰䞵䟙䟹䟾䠥䤿䥕䥫䦑䦬䨆䨮䩏䩤䩧䪼䫎䫼䫾䭇䭱䮋䮕䯵䱑䲙丿乴亵佚偈偰傑僁僣僪决冽准凸切刔列別别刷剈剟劣劽勶卨卩卪
叕吶吷呐呭咇咥咧咽哔哲哷哾唰啘啜啠喆嗶噊噎嚞嚽囐囓圼坲坹垤埑埒埓夨奊契妜姪姴娎媟嫳孑孒孓孼孽尐屑屮岊岤峌嵥嵲嵽嶭嶻巀巁帨幭幯彆彻徶徹怢恎恱悅
悊悦惙憋憰懱戜截批抉折拙拮拽挈挒挗捌捏捩掇掜掣掲揊揑揭揲揳搣搩摕摰撆撇撤撧撷擮擳擷攦敜敠敪昳晢晣暬暼朅朳杰枿柭栔栨栵桀桔桖梲棁棙棳楔楶榍榝榤
槷樧橇櫍櫗櫭櫱歇歠歽毤毻決泄泬洁洇洌洩洯浖浙涅涰淛渫湀湼準滅滊滐潎潔潱澈瀎灭炔炦炪烈烕热烮烲焎焫煭熱燤爄爇爡狤猰玦瓞畷疀疖疦疶痥瘛瘪癟癤眓眜
眣眰睙瞥瞮瞲矞砄砓硩碟碣礍禼稧穴窃竊竭笍節篞篾籺粖糏糱糵紒紲絏結絕絜絬絰絶綴緤緳纈绁结绖绝缀缬缺罬翓耊耋聅聺胅脟腏臬臲臷舌节芵苵苶茁茢莂莭菍
蒛蔎蔑蔱蕝薎薛藒蘖虌蚗蛂蛈蛚蛞蛣蛥蛪蛭蛶蜇蜹蜺蝢螲蟞蠘蠛蠞蠥蠮蠽蠿血衊袕袺裂褉褐褻襒襭覈覕觖訐訣設詄詍說説諁譎讞讦设诀说谲谳赽趃趌趐趔趹跌跮
踅蹩軼輟轍轶辍辙辥迭迼迾逫郣鄨酫醊醛鈌鉄銕鋝鋢鍥鐅鐍鐑鐡鐵鑖铁锊锲镻閇閉閱閲闋闑闭阅阕隉雪霓靼靾頁頡页颉颲飻餟餮馛馝駃驖魝鮚鮤鱉鱊鱴鲒鳖鴂鴓
鴷鷩麧鼈齕齛齥齧龁龞𠃲𠅂𠍯𠐉𠔁𠚱𠛰𠛱𠞃𠟈𠨆𠪣𠬮𠭴𠯓𠯙𠱝𠶿𠻜𠽻𠾀𡆦𡊻𡎮𡐞𡐤𡔣𡙪𡚌𡝊𡟩𡟬𡿖𡿩𡿪𢁪𢌀𢍆𢎆𢎔𢎹𢛎𢜨𢞜𢟯𢠳𢢂𢢍𢦼𢧞𢧵𢨖𢫐𢯳𢯵𢱧𢱺𢲼𢳂𢴭
𢴲𢶅𢶋𢷿𢻮𢼺𢾔𣁷𣁻𣅡𣇢𣕋𣚃𣝸𣡌𣧈𣧌𣧵𣬎𣽒𤅊𤉤𤊵𤊾𤏿𤑄𤓦𤓿𤖺𤝱𤞊𤢺𤣼𤱃𤶚𤷗𤺓𤾵𤿵𥄎𥄴𥅧𥆟𥈾𥉓𥉺𥊯𥋚𥌨𥑇𥔄𥛯𥝔𥞲𥠹𥡁𥢹𥢻𥣫𥩓𥯣𥵒𥵞𥸴𥸸𥾌𥾮𦁛𦅄𦇪
𦐍𦒐𦓤𦗥𦚡𦛠𦞚𦠟𦤕𦪬𦴔𦵱𦵴𦺢𦼢𦼰𦿋𦿐𧀲𧀺𧀼𧁈𧂝𧃪𧆊𧇓𧈈𧉍𧉢𧋍𧍠𧍩𧎯𧎴𧏂𧏽𧐃𧑦𧑧𧑨𧒐𧓨𧔗𧔦𧝃𧝬𧞩𧣸𧤠𧥎𧧸𧸗𧻘𧻼𧽄𧾯𧿥𨁂𨁑𨁒𨂅𨅊𨐃𨑣𨑽𨒜𨕜𨖰𨡸𨥂
𨭁𨭓𨲀𨳺𨴒𨵊𨵚𨵪𨶠𨶮𨷥𨺝𨻄𨼎𨾤𩂪𩊵𩋁𩍷𩓝𩓼𩔄𩔠𩖶𩗙𩜺𩟦𩠻𩠿𩢾𩣩𩦉𩦷𩧃𩩟𩫠𩵛𩸁𪀒𪁑𪁠𪂟𪃈𪅸𪇲𪇴𪌊𪌧𪌺𪎃𪏺𪖋𪙥㧞㺴䃰䤢㓕㔡䘷䳤""",
    4,
    -9,
    18,
    98,
]

yc99 = [
    """㑅㒂㓢㓵㕁㕡㖸㖾㗁㗉㗘㗥㘀㚟㜰㟧㠋㤞㤩㤰㦍㦜㦡㨯㨼㩱㪾㬍㬦㮙㰛㱳㲋㴖㵸㷬㷾㸕㸲㹱㾡㿑䀩䁨䁻䂄䄸䅂䅴䅵䇎䇥䈅䈷䉟䋏䋤䌇䍸䎅䎊䎰䐘䐞䐾䒬䖃䖈䖋䖛
䖼䗚䙏䚥䝫䞢䟑䠯䢲䣞䣤䤕䥣䥬䧄䧿䨣䨥䨰䪇䪙䫷䬪䭦䮤䮬䯨䰊䱜䲵䳽䶅䶈䶳乐亳仛仢作佫侂偔僫凙凿削剒剫劐勺博却卻卾厝叒各咢咯喏喥嗃嗠嗼噁噋噩噱嚛嚩
嚯嚼圴坧垩堊堮塻墌墎壑妁妰娋婥婩婼嫋嬳寉寞屩屫岝岞峈崞崿幕幙度庴庹廓弱彉彍彏彠彴怍恪恶悪悫惡愕愙愨愽慔慤戄托扚扩拓拡挄挌掠搁搏搻摸撗撯擆擱擴
擽攉攊攫敫斫斮斱昔昨暯曤杓杔柝柞格棤椁楉楽槖槨樂橐檡檴櫎櫡櫮欂毭氼汋汑沢沰泊泺泽洛涸淿渃湂溹溺漠漷澤濼瀖瀹灼烁烙烵焯焲焳煿熇熦燋燺爍爑爚爝爴
爵牔犦犳狛狢猎猼獲獵玃珞琧略畧疟瘧瘼癋癨皬皭皵着瞙矆矌矍矐矡矱矺砟硌硸碏磭礡礴礿禚禴秨稓穫笮笿筰箔箨箬篗篛簙籆籗籜籥籰籱粕糳約索絡綽縒縛縸繑
繛繳纅约络绰缚缴耯肐胉胳脚腭腳膊膜臄臒臛艧芍若苲茖药莋莡莫获萚萼落葃著葯蒦蒪蒻蕚薄薬藃藥藿蘀蘁蘥虐蛒蝁蠌蠖蠚蠷蠼袥袼襮覨託詻諤諾謔謞謶讍讬诺
谑谔谻貈貉貜趞跃跅跞踋踖踱蹃蹻躇躍躒躩轢轹辵迮逪逴逽遌遻郝郤郭鄀鄂鄗鄚酌酢酪醵鈅鈬鈼鉑鉻錯鍔鎍鎛鏌鐯鐸鑊鑠鑩鑮鑰鑿钁钥铂铄铎铬错锷镆镈镬閣阁
陌隺雀雒雘霍霩靃鞒鞟鞹鞽顎颚飥飵餺饦馎馲駱骆髆鬕魄魠鮥鰐鰝鱳鱷鳄鵲鶚鶮鶴鶸鷇鸌鸖鸙鹊鹗鹤鹱齶龠龥𠄇𠊬𠔠𠕗𠗂𠘢𠞗𠠎𠢌𠢓𠣐𠰜𠶱𠶸𠹠𠻐𠾌𡁆𡁇𡅡𡈅𡈗
𡓘𡚠𡻙𡾙𢂃𢄿𢅹𢊗𢋒𢔱𢖦𢖲𢜪𢜬𢜭𢞕𢠛𢧢𢩷𢱢𢸨𢺇𢽸𢾅𣀝𣃈𣃑𣄎𣉒𣌗𣎱𣔵𣛵𣤰𣤲𣦜𣧳𣬋𣱫𣶦𣹧𣽡𤄶𤏸𤐰𤑓𤒔𤓝𤗙𤗳𤛗𤜓𤡯𤡾𤢴𤣯𤶋𤷽𤻙𤻲𤽥𤽼𤿋𥂣𥋮𥎡𥔲𥕏𥕓𥕖
𥗁𥤘𥥏𥩀𥩢𥮥𥯚𥯛𥯩𥯳𥰼𥱹𥴮𥵜𥸘𥽥𥽿𦁎𦂍𦃙𦅊𦅾𦇬𦐦𦑀𦑵𦒟𦗒𦘸𦙊𦞦𦟳𦣜𦥭𦥲𦩸𦮅𦵫𦿍𧀔𧅚𧆑𧈦𧊜𧊝𧊬𧍕𧎙𧎳𧎾𧐋𧐯𧑀𧕋𧕌𧕤𧗫𧘐𧘑𧙺𧛻𧠓𧤽𧧉𧩧𧭥𧮙𧮞𧮫𧹊
𧾵𨀝𨀟𨂫𨆅𨇕𨈋𨍭𨏒𨏫𨏹𨙄𨞩𨮿𨯟𨰜𨴚𨵫𨷲𨺨𨽏𩁯𩂣𩄸𩄻𩅿𩆀𩊚𩌈𩌏𩌧𩍜𩍿𩏯𩏺𩒕𩔈𩖀𩘝𩚈𩟓𩟧𩟰𩤈𩧡𩪭𩫏𩫖𩰨𩱪𩱲𩱾𩲃𩸇𩽛𪃅𪃒𪅅𪅴𪇱𪈃𪈴𪌂𪍔𪍟𪍡𪍤𪎇𪎒𪎲
𪏈𪏨𪖀𪙍𪚇㑼䂮䌎䛚䧐䨋""",
    4,
    -10,
    16,
    99,
]

mo100 = [
    """㑊㒀㖪㖽㗆㗲㘁㘌㜋㟙㠛㡯㡿㣂㣱㥽㦎㦦㦴㦸㧖㨲㩇㩍㭙㮝㮦㯖㳻㴁㴒㵹㶁㶠㹮㺓㼟㼣㽚㾊㿟㿭䁤䁺䂖䂝䂸䂹䃒䄷䇲䈿䊂䊞䌟䐙䐸䕉䕪䖌䖨䘑䘔䘸䙐䚂䛿䜺䞟䞦
䟄䡛䣢䤨䦴䧍䨛䨫䩹䪂䪝䬉䭆䭞䮮䮰䰜䱮䲽䳆䳭䳮䵂䶦丮乇亦伇伯佰借僻冊册冟凙划刺刾剧剨劃劇劐厄厇厏厝只呃呄呝咋咟哑哧唖唙唶啇啋啙啞啧啪啯喀嗌嗝嗼
嘀嘓嘖嚄嚇嚿圛坄坧坼垎垼埸塉塥墌墿夕奕奭婳媳嫧嫿嬕孹宅客射尺屐屰岶峄峉嵴嶧帛帞帟席帻帼幗幘庴廦廹弈役徣徦怿惜愅愬慖憡懌戟戹扸扼択拆拍择拺挀挌
捇掖掝掴掷揢搤搦搩搹摑摘摭摵撠擇擌擗擘擲擿敀敇斁斥易昔晹曎朿杔枙柏柞柵栅栢核格棤棭楁榒槅樍橶檗檘檡歝歵殬汐沢泎泽洂洓洦液湐湙湱溹滆漍潟潪澅澙
澤灻炈炙烢烾焃焟焬焲焷煂熤熫燚燡爀犱狛獈獏獥獲珀璧画畫畵疒疫痖痬瘂瘠瘷癖白百皟益眲眽眿睗睪瞁瞔矠石矺砈砉砨砶硅硕碛碦碧碩磀磔磧磶礉礊礋礔祏积
積穫穸窄窢策筞筴箣箦簀簂簎籍籷粣糪索絈絔綌緙縌繹绎绤缂罊翟翮耤耫耯聑聝聻胉胔脈脉脊脨腊腋腘膈膉膌膕臵舃舄舴舶艊苩茖茦莋莫获莿萗葃蒚蓆蓦蔮蕮薜
藉蘗虉虢虩虴蚅蚇蚱蚸蛒蛨蜴蝈蝷螫蟈蠌衇衉袹褯襀襗襞襫覇覈覛覞覤觡訳詻諎諽謋謫謮譯讁讗译谪谻豛豟貃貊貖貘責賾责赜赤赫趞跅跖跡踖踯蹃蹐蹟蹠躃躄躆
躑躤軛軶轭辟迫迮迹适逆適郄郤醳釈释釋釽鈠鉐鉻銆銏鏼鐴铬閴闢阨阸陌隔隙隟隻雃雿霡霢霸霹革韄韚頙頟額额馘馲駅騞驀驛驿骼鬲魄鮊鯣鯽鰿鱯鲌鲫鳠鳽鶒鶪
鶺鷿鸅鸊鹡麥麦鼫齚齰齸𠅃𠋲𠒱𠕁𠕋𠕐𠗼𠙆𠜗𠢹𠤴𠧚𠧵𠨾𠩔𠪮𠫛𠱘𠱨𠲱𠸺𡂓𡄴𡇠𡎳𡖶𡻟𢃍𢃲𢄶𢅰𢍰𢐚𢓜𢔔𢔠𢗎𢝇𢡍𢧏𢩞𢩦𢫦𢫰𢯹𢱁𢱣𢶉𢷾𢹖𢼛𣄺𣆑𣌧𣍸𣖷𣙵𣚔𣝍
𣝗𣢛𣤈𣤨𣤪𣨊𣬚𣬿𣮐𣶊𣻩𣽤𤁰𤁹𤆍𤈧𤊴𤑹𤖓𤖷𤖼𤗺𤜤𤜾𤟍𤠇𤡏𤡡𤥿𤳎𤸴𤹞𤺘𤻂𤽱𤾝𥃫𥄍𥅺𥆉𥆘𥆛𥇏𥉅𥊮𥋿𥍱𥎍𥏯𥐘𥐽𥑺𥒠𥒵𥙎𥜃𥟘𥧮𥨳𥩖𥬝𥬰𥰡𥳯𥴩𥻨𥻬𥼶𥽶𥾐
𥿭𥿹𦃔𦇸𦌩𦍁𦑌𦑜𦑱𦒏𦒧𦓱𦓻𦔈𦔥𦗑𦛘𦛧𦜃𦝣𦝳𦟜𦣧𦣺𦫖𦬃𦯉𦰬𦳮𦵪𦵾𦺩𦼭𧀿𧂙𧃐𧅖𧈅𧈌𧈍𧈑𧈻𧊤𧌐𧏸𧐐𧓸𧕥𧖴𧖻𧙡𧝳𧞲𧠞𧤯𧧩𧭕𧭣𧭪𧯊𧲜𧲢𧶷𧹨𧺠𧺰𧻕𧻙𧼟𧼳
𧽦𧾑𧿩𨀸𨍇𨍺𨏚𨏴𨐨𨐴𨐶𨑠𨒅𨕠𨖊𨛳𨜶𨞒𨣠𨦯𨭗𨵡𨵩𨶬𨻶𨼓𨼥𩂖𩂹𩃑𩄜𩄾𩅢𩈗𩉕𩉢𩊍𩊢𩊯𩊿𩋌𩌡𩌪𩍆𩎎𩎚𩎭𩎷𩏪𩒄𩔳𩚬𩝿𩞨𩢐𩢷𩤩𩪐𩭽𩯋𩰻𩱘𩲁𩳇𩳵𩴮𩷍𩹺𩹿𩺀
𩾼𩿪𪀥𪁛𪃭𪄎𪄳𪅍𪇊𪈊𪉗𪌟𪌣𪎺𪐏𪔋𪕶㛭㝜㫺䇿䐱䞠䟱䦝""",
    4,
    -11,
    17,
    100,
]

xi101 = [
    """㔏㢩㣙㤸㬏㰅㱸㱹㲻㷦㷴㹍㺡㻺㽁㿨䁶䂆䈪䌐䍥䍽䑀䓇䔉䖑䗩䚍䚐䚫䞶䟏䟐䢮䢰䣓䤙䤨䥶䦧䨀䨤䮥䮭䯜䰛䳬䴞䵠仢倜儥儮冖冟冪击剔劈勣历厤厯吃吊呖唽啇喫噄
嚁嚦坜塓墑墼壁壢婥嫡寂幂幎幕幙幦廦廸弔悐惁惄惕惖愵慼慽憵戚扚扸掦摘撃撽擊擽攊攦敌敫敵旳晰晳暦曆析枥栎梑椺榏樀樍檄櫟櫪欫歒歴歷殈毄氼汨沥涤淅湨
溺滌滴漃漞澼激濗瀝焃焬焱熐燩爏犑狄狊獥玓瓅瓋甋甓疬癧的皙皪盢瞁砉砳砾硩磩磿礔礕礫礰秝笛篴簚籊籴糑糴糸綼緆績繴纅纟绩羃翟肑艗苈苖荻菂菥蒚蓚蓧蓨
蔋蔐薂藡藶虉虳蚸蜥蝷裼覓覔覛覡覭覿觅觋觌觻譤讈豴赥趘趯踢踧蹢轚轢轣轹迪适逖逷適郦郹鄓酈釽銢錫鎘鏑鏚鐴锡镉镝闃阋阒雳霓霹靂靋靮頔馰鬩鬲鱳鴃鵙鶂
鶃鶪鷁鷊鸄鹝鹢鼊鼏鼜鼳𠋬𠎰𠘟𠚭𠜹𠟄𠠝𠩫𠪺𠫌𠴫𠴭𡒱𡚷𡽢𢊆𢞒𢤩𢱦𣀥𣂉𣌜𣒃𣚌𣣉𣤢𣤩𣦯𣨋𣨗𣩩𣪠𣫧𣬴𤄎𤈥𤓑𤔨𤖢𤖿𤘃𤩮𤩯𤹈𤾠𥉈𥉷𥉿𥌮𥍟𥓃𥕐𥕣𥖫𥛚𥡦𥦀𥨻𥨿
𥷅𥺚𥽗𦇔𦉹𦘊𦠓𦪾𦱜𦵦𦸗𦸡𦼷𦿓𧄻𧈼𧉲𧋐𧐎𧒕𧔝𧖷𧘫𧙉𧠪𧯏𧰡𧱻𧴠𧼊𧽨𨇗𨊛𨍮𨏬𨑩𨘸𨟑𨢌𨢎𨣯𨬑𨮹𨲎𨲞𨷦𩄞𩅩𩈢𩒛𩗱𩙖𩚮𩪸𩮜𩯺𩰲𩱇𩳧𩴣𩴺𩷎𩽏𪄱𪄸𪅼𪌫𪎗𪑸𪒄
𪒑𪓀𪔃𪕩𪕯𪖍𪗁𪙽㒪㛫㦘㭊㱤""",
    4,
    -12,
    17,
    101,
]

vi102 = [
    """㔴㔹㕵㘈㘠㚜㚤㝶㞃㞋㢞㤫㥀㥁㥂㥛㥶㥾㦯㧹㫯㭲㮨㮩㯤㯰㱄㱇㳁㵓㷵㷶㹄㻷㽣䁇䁼䁿䄩䅞䆐䈟䉢䋚䍞䎪䐈䐚䓧䖁䗷䘃䘅䘝䙷䙸䞳䣧䤭䦗䦼䧕䧗䩯䬎䮙䯆䰥䰹䱛
䳵䴬䵗䵱亟亿仂仄伵侐侙侧偪側僰億克冐冒则刻則剋副力劸劾勀勅勊勑勒勓匐北匿即卽唧啬喞嗇嘚嘿噫嚜囯囶囻国圀國垘域埴堛堲塞墄墨娔嫟嫼嬂寔尅屴崱嶷幅
庂弋式徏得徳德忆忇忑忒恜恧息恴恻悈悥悳惐惑惪惻愊愎慗慝憶懎懝或戝戠戫扐抑拭捑捗掝揊揤敕昃昗朸杙极栻棏棘棫植楅極樴檍殕殖殛氻汄泐洫测浳淂淔淢測
湜湢溭潩潶澺瀷烅烒焏煏熄熤熼爅特犆玏琙畐畟疈瘜癔皀皍皕直禃禝稄稙稫稷穑穓穡穯窢竻綕緎織繬繶纆织罭翊翌翼聀职職肊肋脦腘腷膕膱臆臸艒色艻芅茍荝菔
萴蒠蔷蕀薏薔蘵蚀蚮蛡蜮蝍蝕螚螣蟔蟘蟙蠈衋裓襋諽謋識识賊贼赩赲趩踣踾軄軾轖轼逼遈遫鄎醷釛釴鉓鉽閄閾阈阞陟隿霬食飭飾餙餝餩饬饰骮魊鯽鰂鰏鰳鱡鲗鲫
鲾鳓鳨鶝鷘黑黒黓默黙𠄹𠅔𠅡𠈸𠎸𠒧𠛳𠟩𠟻𠠵𠡠𠡤𠢠𠢳𠥦𠨠𠩥𠯉𠯭𠶷𠷙𠿤𡊁𡊶𡋩𡍫𡙋𡞢𡿿𢀋𢂑𢂗𢃎𢃜𢄏𢉗𢎀𢎉𢏞𢑏𢓀𢕚𢖛𢖺𢘋𢚮𢡀𢡃𢡑𢤋𢥛𢧧𢨗𢨳𢫯𢯩𢾇𣆽𣖿𣘱
𣚍𣛸𣣝𣦇𣨤𣮊𣮰𣲊𣲒𣽚𤎗𤗚𤙰𤛷𤜜𤠎𤡓𤨙𤬩𤳪𤷇𤷙𤺷𤼌𤼍𥅞𥇙𥇛𥈂𥈜𥈽𥊸𥌩𥏅𥔁𥜖𥟔𥠉𥡪𥣱𥫝𥮖𥰝𥷹𥺊𦄰𦄿𦈸𦊋𦋉𦎘𦎢𦑍𦑞𦔆𦔎𦔜𦔫𦗟𦤈𦱂𦺳𦽒𧃟𧄹𧈞𧉥𧊇𧊖𧎢
𧏾𧐂𧑌𧒗𧒿𧝊𧟱𧠋𧩦𧲡𧹭𧹽𧼑𧾰𨁽𨂢𨆎𨋉𨔤𨶨𨺤𨻁𨼱𩋉𩍖𩍙𩎹𩏟𩐰𩐾𩑻𩕡𩗎𩙺𩜰𩦇𩪣𩯈𩺱𩻤𩾢𩾸𪀦𪂉𪂵𪃼𪄛𪆵𪉪𪐌𪑆𪑝𪒂𪒇𪙛㩙㴧䭒䮠""",
    4,
    -13,
    17,
    102,
]

ji103 = [
    """㒆㒊㕸㗊㗩㗱㘊㙫㙷㞏㞚㠍㠎㡮㣬㤂㦻㧀㩉㱞㴔㴕㵫㽺㿇䁒䁯䅤䇼䏠䐕䒁䓃䔼䗑䙄䦹䩰䭂䲯䶘习亼什伋俋偮入十卄卌卙及叺吸咠唈啃喅噏圾執嬆孴岌岦嶯廿彶忣
急悒慹戢执拾挹揖撎楫槢檝歙歮歰汁汲泣浥涩淁湁湆湇湒湿溼漐漝潗潝澀澁濇濈濕瀒焴煜熠熻瓡皀砬礏礘立笈笠箿粒級給絷緝縶级给缉習翕翖翜艥芨苙葺蓻蕺蛰
蟄袭裛褶襲觙諿謺譅譶趇輯辑邑釞鈒鉝鍓鏶钑闟隰集雦雧雭雴霫霵飁馵馽騽驫骉鰼鳛鴔鴗鵖鷑𠀷𠈶𠓛𠟊𠦜𠦧𠦫𠬬𠯰𠲺𠴹𠶻𠽼𠿠𡁉𡁰𡂣𡃃𡅵𡅺𡈊𡍪𡏀𢃺𢔆𢙅𢜱𢡁𢡉
𢨐𣉓𣖭𣚟𣪉𣳀𤁧𤃲𤖗𤖞𤶛𥊬𥌁𥒡𥖙𥠋𥮪𥱁𥱵𥽳𦐅𦝖𦞥𦠾𦡹𦩧𦪿𦳌𦶂𦶍𦸚𦺴𧋏𧐔𧚨𧤏𧥄𧨷𧬈𧹶𧾂𧿅𨙩𨜎𨝫𨤹𨦮𨳛𨸚𨹝𩣞𩦤𩰙𩴃𩷘𩾳𪂺𪄶𪅲𪙹㪧㬛㬤㲸䉗䏉䏩䔱䮶䶋""",
    4,
    -14,
    17,
    103,
]

he104 = [
    """㔩㕇㕉㕎㗳㙮㚫㛕㛥㝓㠷㥺㧁㧺㨥㭼㯓㯚㰰㳫㷈㹺㽂㾑㿯䂰䂿䃳䆟䈋䈫䈳䌈䍇䍝䐛䑜䑥䑪䑽䓠䕹䗘䗶䙣䜚䞙䢔䨿䪏䪚䪞䪺䫦䬃䳴䵬䵽䶀䶁乢佮傝儑剳匌匎匒匝卅
卡厒合咂哈唈嗑嗒嘁噆嚃嚺囃圾塌塔墖姶岋峆峇崉帀廅抸拉拓拹搕搨搭撘敆杂枼枽柆榙榻榼欱歞殧毾沓涾溘溚溻漯濌熆爉狧畗畣痷瘩盇盍盒盖瞌矺砐砝砵硆硶碜
磕磖磣磼礘礚秴笚笝答篕納纳罨罯翋耠耷腊臘荅菈葢蒳蓋蛤蜡蝋蠟衲褟褡襍詥誻譶趿踏蹋蹹躢軜迊遝遢遪郃醘鈒鉔鉿錔鎉鎝鑉鑞钑铪镴閤闒闔阖阘雑雜雥靸鞜鞥
鞳韐韴頜颌颯飒馺魥魳魶魼鮙鮯鰈鰨鰪鲽鳎鴿鸽龖龘𠉤𠎷𠞈𠦃𠩧𠪟𠯗𠴲𠶲𠷄𠷍𠹓𠹥𠻙𠿓𡀾𡁕𡅘𡇞𡇶𡈐𡌩𡍲𡐥𡻘𢃕𢄍𢈈𢓔𢕬𢝉𢞠𢩏𢩐𢩘𢶍𢽇𢾩𣜂𣝋𣣴𣣹𣤊𣤷𣤺𣥷𣥾
𣩄𣬬𣭝𤄖𤎣𤒻𤛊𤛣𤝰𤠐𤠟𤪄𤭼𤱅𤱆𤸱𤿽𥀥𥀰𥃕𥉌𥊉𥋙𥍲𥗭𥦨𥫋𥷩𦂀𦅶𦆻𦊪𦐇𦑇𦑲𦑶𦑻𦑼𦒆𦒦𦖿𦗧𦘿𦠿𦧟𦧤𦧥𦧱𦨎𦪙𦳬𦶑𦻅𦾬𦾽𧊧𧌃𧌄𧌏𧍬𧗩𧙀𧛾𧜡𧞪𧨟𧨵𧪞𧪦𧬩
𧮑𧮵𧼎𧾁𨂁𨃚𨅔𨆂𨆰𨌣𨌧𨌭𨏿𨓬𨔯𨜴𨠿𨨹𨭛𨰏𨶀𨷆𩃜𩆅𩇠𩇺𩋊𩌇𩌐𩎕𩎽𩏒𩐅𩑮𩚛𩝣𩣯𩥑𩨞𩫊𩵢𩷽𩹾𪁍𪂌𪇹𪌅𪔕𪗝𪘁㡴㲩㿴䐦䧻""",
    4,
    -15,
    19,
    104,
]

ye105 = [
    """㑙㒤㙷㚔㚲㛍㡇㢎㢵㤲㤴㥈㥦㧜㨗㨩㩎㩶㩸㪑㫸㬪㭯㯿㰔㰼㱌㲱㲲㳧㴇㷸㸉㸎㼪㼲㽊㾜䁋䁽䇣䈉䈎䌌䌖䌜䌰䐑䐲䛟䜆䜓䜲䝃䝓䝕䠟䢡䤮䥡䧪䩞䪉䭟䯀䳖䴑䴴䵿侠
俠倢偞偼僷儠劦勰匧协協厌厭叠叶呫唊喋嗫囁埝堞墷夑妾婕寁屟屧崨巤帇帖帹弽徢怗悏惗惬惵愜慑慴慹懾折挕挟挾捷捻接揞摂摄摺擑擛擪擫擸攝敜旪昅晔曄曅曗
曡枼枽梜椄楋楪楫檝欇歙殜氎浃浹涉淁渉渫滠灄炸烨煠熀熚燁燮爕爗牃牒犣猎猒獦獵畳疉疊疌痷皣睫瞱瞸穕笈筴箑箧篋籋綊緁聂聑聗聶脥脻艓艥苶荚莢菨萐葉蓵
蓻蛱蛺蜨蝶蠂衱裛褋褶褺襵詟誱諜謵謺讋讘谍貼贴跕踂踕踗踥蹀蹑躐躞躡輒輙辄迠邋銸鋏錜鍓鍱鎑鏶鐷鑈鑷铗镊霅霎靥靨鞢韘頬頰顳颊颞饁馌鬛鬣魇魘鮿鯜鰈鱲
鲽𠗉𠗛𠙤𠝝𠟪𠠯𠲷𠴯𡁓𡂏𡂩𡄕𡏵𡑢𡒏𡜯𡞘𡽣𢂐𢈙𢈸𢈻𢣢𢫻𢬴𢹒𢺅𣀳𣈍𣋌𣋲𣌍𣐂𣚕𣛻𣝚𣠞𣠺𣡟𣮌𣮍𣰞𣰼𣶏𣹱𣻣𤁯𤏻𤐱𤖒𤗈𤗨𤙒𤚊𤝓𤢪𤫉𤮌𤱷𤷾𥀺𥆥𥌅𥍉𥓐𥞵𥤋𥪂𥬬
𥭙𥮤𥮧𥯥𥲁𥶢𥶺𥷕𥷨𦀖𦁉𦁗𦁜𦂡𦆍𦈅𦔮𦔼𦖩𦗗𦘒𦚫𦛖𦛞𦝒𦣀𦧢𦩌𦯍𦾳𧀢𧀨𧋖𧍁𧏥𧓐𧗖𧚪𧝵𧞕𧭌𧭞𧰠𨃲𨄌𨆍𨈈𨊞𨐁𨓊𨓭𨓰𨙓𨤴𨹡𨻗𩂻𩃖𩉂𩋏𩋞𩐭𩐱𩐶𩘏𩙑𩙜𩙝𩣘𩧆
𩭌𩮐𩷂𩼭𪉚𪌿𪑗𪑧𪒍𪔪㤐䝱䪓""",
    4,
    -16,
    18,
    105,
]

qx106 = [
    """㓣㕅㗼㘝㘡㙝㛼㡊㡋㭘㭱㮑㰱㱉㳒㴙㵊㵤㷅㸣㹤㽠㾀㿓䀫䀴䀷䁆䁍䂲䆘䇱䎎䕛䖎䖖䘥䛅䛽䝊䞩䤶䧨䨐䩡䬊䮜䮢䱒䲜䶎䶝业乏佱偛冾凹刦刧刼劄劫匣压厒呷呿哈唊
唼啑喋喢嗋嚈囡圔圧圶垥埉壓夹夾姂姶岬峡峽嶪嶫嶯帢帹庘怯恊恰愶扱押抾拹挿掐插揷搚搯擖昅曱柙業欱歃歰殎殗殜法洽渫湆湇澲灋炠烚煠熁燲牐狎狭狹玾珨甲
疀疺痷眨砝硖硤磼祫笚笝筪筴箑箚翈翜翣胁胛胠脅脇脋臿舺萐葜蜐袷裌譗跲邺郏郟鄴鉀鉣鉿鍤钾铪锸閘闸陜陿霅霎鞈韐餄餣饸驜魥魻魼鴨鵊鸈鸭𠄅𠓟𠕣𠗨𠜼𠝞𠩂
𠩘𠰏𠱲𠲵𠽣𡇄𡈮𡋨𡎫𡝍𡞙𡟢𢂷𢆍𢇵𢈤𢔣𢘉𢢜𢭅𣁴𣆗𣓉𣢗𣣲𣦉𣩫𣩯𣹩𣹵𤁳𤙇𤜯𤟃𤣹𤴼𤵭𥇠𥈊𥉰𥎰𥎸𥑐𥝥𥦞𥹉𦀕𦑈𦑣𦛕𦝥𦦘𦦜𦦱𦽤𧆥𧋡𧬬𧲌𧳛𧶵𧻵𧼰𧼶𧽅𧿵𨂵𨒇𨕽𨖷
𨘉𨸺𨺭𩃡𩃹𩉾𩌍𩑃𩚲𩛩𩝟𩣴𩨹𩲣𩳶𩼋𩾶𪋫𪒲𪘘𪘾㑢㥘㬁㳌㾎""",
    4,
    -17,
    19,
    106,
]

else404 = [
    """乥乪乬乭乮乯乲乶乷乸乺乻乼乽亇亪亻亽仐仒仨仩仫伔伝伡伢伩伬佤佦佧佨侤俤俥俧俬倷倽倿傣傤傦僲僳僾儎儏兙兛兝兞兡
    兣兯兺円冇冚冧冮凎凧凩凪凼剦劏匁匂匇卐厁厑厼厾叁叻叾吖呎呏呑呔呚咅咑咓咖咗咘咜咝哎哏哐哖哘哚哛哟哣唕唗唛唜唞唟唡唣唥唦唨啢啤啥啩啫啱啲啶
    啹喱喲喴喵喸喹喺喼嗧嗨嗭嗮嗯嗰嗱嗲嗴嗵嘜嘝嘞嘡嘢嘣嘥嘦嘧噗噚噝噺噻噼嚒嚓嚡嚤嚰嚸嚹囄囍囎囕囖圐圕圙圦圷圸垃垈垉垊垪垬垮垯垰垱垳垴埔埕埖堍
    堎堏堐堒堔堖塀塁塂塃塄塅塆塇塨塪塬塭塮塰塱墘墚墛墶墸墹壋壗壪壭夃夞夻夼奍娳婱婲媫媬嫑嫲嬔嬶嬽孧孭尕尜尡屗屘屲屶屷岃岙岜岻岼岽岾峁峂峅峠峧
    崁崅崬崰嵊嵖嵙嵛嵜嵵嵶嶍嶎嶥嶴嶶嶿巕巪巬巭巯巰巼幉幤幥廍廤廭弪弳彁彅彟徔徚徾怹怺怽怾恷悡悧愣愥慏慐懓懳戥扌扖抣拤挘挧捠捤掭掮掯掰掱掵掶掹
    掼揸揻揼揿搿摁摣撂撪撳撵撶擜擝攆攚敋敨敾斏旀旕晽暀暃暅曋曢曣曻朆朑朥朩朰杁杢杣杤杦杧枠枡枦枩栃栆栍桛桝桞梺梻梽椙椚椛椞椡椢椣椥椦椧椨椩椪
    椬楾楿榀榁榃榅榊榋榌榩槝槞槡樖樫樭樮樰橲橳橴橵橷橸橺橻檨檪櫊櫏櫤櫦櫴櫵櫶櫷欌欍欕欟歚歶毜毝毟毪毮氕氖氘氙氚氝氞氟氠氡氢氥氦氨氩氪氫氬氭氮
    氯氰氱氵氹氺汆汈汢汣沗沞泹洜浌浕涜涥渆渋渏渒渓溂溄溊溋溌滜滧滱漽潈潉潌澚澛澝濏濸濹瀂瀔瀭瀮灐灛炝炞炻炾炿烀烥烩烪焐焑焒焓焖焗焹焽焾焿煀煲
    煳煵煶煷煸熕熗熘熴熵燜燝燞燴燵燶爎爘爠爫爳牗牜牤牬犋犞犭狅狆狇狜猀猁猞猟猠猹獇獉獊獕獡獣獤玍玘珐珯珱琑琒琓琺琻璍璤璴瓑瓧瓩瓰瓱瓲瓸瓼甅甏
    甙甩甭甮畑畓畠畨畩疂疍瘄癌癍癦癪癷眔眤瞄瞓瞣矅矋矽砘砙砛砜砷砹砼砽砿硒硓硔硘硚硛硭硳硴碘碙碚碲碵碶碷碸碹磗磘磙磮礀礂礃礄礅礖礞礢礳礵祂祍
    禉禙禢禣秮稤稥穃穒穝窧竍竏竐竓竔竕竡竰笂笧笹笽筷筸筺筻筽篒簓簕簖簗簯簱簲籂籎籏籡籪籫籿粀粁粂粌粍粎粏粐粨粩粫粬粭粴糀糌糍糎糘糬糹紦絋綗続
    綛緔緕緮縄縅縇縨繊繌繧繨繺纃纐绗绱缼罀罉罖羙羪羰翭耂耥耪耲聁聓聢聣肏肟肼肽胩胬脌脎脒脲脳脵脷腙腚腺膤膥膵膶臌舢舮舯舾舿艈艉艍艔艝艠艹苂苄
    苆苉苊苐茐茒茓荢莯莰莶莻萖萘萙萛萜萞萟萠萡萢萣葎蒁蒄蒅蒆蒈蒊蒎蒏蓖蓗蓙蓜蓢蔶蔸蕱薡薭藔藲藵蘒蘔蘕蘰虄虅虲虼蛌蛯蝊蝻蝽螁螥螦螧螨螩蟎蟐蟑蟵
    蠬蠴衐衤袇袡袮袰裃裄裇裉裢褃褄褜褝褳襅襔襧襨襷襽覄覅覮觃觼訁訢誮謃謢讂讠賗贌贘趰趴趷踎踭踮蹦蹽蹾蹿躀躥躮躵躻躼躾軅軈軕輌轌辪辶辷辺辻込迉
    迚迲逧遖遤邎邜郒鄼酂酚酛酜酞酯酰醌釒釔釢釷釸釹釻鈣鈤鈥鈦鈧鈨鈩鈪鈫鉬鉭鉮鉯鉰鉲鉳銠銤銥銦銧銨銩銪銫銬銯銰銱鋨鋮鋯鋰鋱鋲鋴鋵鋶錳錴錵錷錸錹
    錺錻錼錿鍀鍂鍃鍄鍅鍆鎂鎃鎄鎅鎆鎇鎲鎳鎴鎵鎶鎷鎹鎺鎼鎽鎾鎿鏍鏭鏮鏯鏰鏱鏲鐒鐠鐢鐣鐦鐨鐽鐿鑀鑓鑔鑥鑦鑧钂钅钇钍钔钕钙钛钪钬钼钽铐铑铕铖铞铟铥
    铯铱铴铵铹铼铽锂锆锇锍锎锘锝锪锰锿镁镄镅镋镍镎镓镙镚镥镨镱镲閊閖閪闎闏闧陦陧隡霗霻靍靎靏靰靹鞆鞐鞡鞰鞷韕韟颪飠餎餏餷餸饂饃饝饢饣饹饻馇馍
    馕駇駲驇鬏魞魢魸魹鮖鮗鮘鮱鮲鮴鯎鯏鯐鯑鯒鯓鯱鯲鯳鯴鯵鰗鰘鰙鰚鰛鰮鰯鰰鰺鱇鱈鱙鱚鱛鱜鱩鱪鱫鱰鱾鲃鲬鲹鲺鲼鳁鳕鳚鳤鳭鳰鴫鵆鵇鵈鵣鵤鵥鶍鶎鶑鶫
    鹮麶麿齉龦龧龨龩龪龫龬龭龮龯龰龱龲龳龴龵龶龷龸龹龺龻龼龽龾龿鿀鿁鿂鿃鿄鿅鿆鿇鿈鿉鿊鿋鿌鿍鿎鿏鿐鿑鿒鿓鿔鿕鿖鿗鿘鿙鿚鿛鿜鿝鿞鿟鿠鿡鿢鿣鿤鿥
    鿦鿧鿨鿩鿪鿫鿬鿭鿮鿯鿰鿱鿲鿳鿴鿵鿶鿷鿸鿹鿺鿻鿼鿽鿾鿿㐂㐃㐆㐇㐈㐉㐊㐋㐍㐎㐏㐐㐑㐒㐓㐔㐕㐗㐘㐙㐚㐛㐝㐞㐟㐠㐢㐣㐥㐦㐧㐪㐵㐶㐷㐼㐽㐾㐿㑀㑆㑇
    㑈㑑㑒㑔㑕㑖㑠㑡㑨㑩㑪㑫㑬㑭㑱㑲㒍㒎㒏㒐㒗㒘㒛㒢㒣㒨㒩㒬㒮㒯㒱㒷㒹㓀㓁㓆㓇㓍㓥㓦㓫㓰㓿㔈㔉㔔㔖㔛㔟㔫㔲㔾㕀㕏㕝㕶㕷㕾㕿㖈㖉㖊㖋㖌㖍㖎㖙㖚
    㖛㖜㖝㖞㖣㖬㖮㖯㖰㖱㖲㖳㖴㖵㗎㗏㗐㗑㗒㗝㗞㗟㗠㗡㗮㗯㗰㗷㗹㗺㘃㘄㘎㘏㘒㘔㘗㘚㘟㘢㘬㘮㘯㘵㘻㘼㘽㘾㙆㙋㙌㙍㙖㙘㙟㙦㙭㙽㙿㚈㚎㚑㚘㚛㚨㚯㚿㛀
    㛇㛈㛉㛊㛋㛌㛞㛟㛠㛡㛢㛣㛤㛿㜀㜁㜓㜔㜟㜢㜨㜬㜭㜶㝆㝍㝨㝬㝳㝽㞇㞍㞎㞝㞞㞠㞮㟂㟃㟆㟒㟕㟖㟜㟡㟢㟣㟤㟥㟬㟮㟯㟶㟷㟸㠃㠄㠐㠗㠞㠟㠣㠤㠩㠫㠬㠰㠳
    㡆㡍㡎㡤㡪㡭㢇㢌㢐㢢㢪㢫㢭㢱㢷㢹㢿㣊㣕㣖㣗㣡㣨㣩㣮㣳㣴㣸㣹㣺㤅㤘㤭㤻㤼㤽㥐㥗㥙㥪㥫㥻㦈㦙㦠㦪㦮㦲㦳㧏㧐㧑㧚㧛㧝㧟㧠㧰㨈㨓㨦㨪㨬㨾㨿㩀㩁㩂
    㩏㩐㩑㩞㩟㩫㩷㩹㪉㪘㪙㪢㪪㪯㪲㪳㪿㫆㫇㫈㫉㫠㫣㫫㫬㫭㫮㫾㫿㬀㬑㬕㬖㬟㬧㬨㬷㬽㬾㭀㭅㭆㭍㭎㭏㭐㭖㭗㭣㭤㭥㭦㭧㭳㭴㭵㭶㭷㮆㮈㮉㮊㮠㮢㮺㮻㮼㮽
    㮾㯌㯑㯒㯞㯧㯨㯩㯴㯵㯹㯼㰓㰜㰸㱐㱑㱓㱝㱩㱮㱷㲄㲐㲑㲙㲮㲶㲷㲿㳈㳉㳓㳔㳕㳝㳠㳡㳢㳣㳯㳱㳲㳳㴊㴋㴌㴍㴎㴟㴡㴢㴣㴤㴹㴺㵁㵇㵈㵉㵚㵛㵜㵺㵻㶂㶃㶉
    㶋㶐㶕㶙㶝㶢㶩㶪㶫㶱㶲㶶㶷㶸㶽㷁㷌㷍㷗㷚㷛㷜㷝㷞㷧㷨㷩㷪㷱㷲㷺㷼㷽㸆㸇㸌㸓㸴㸿㹀㹈㹋㹩㹪㹰㺆㺍㺙㺢㺦㺧㺶㺻㺼㺽㺾㻅㻆㻇㻈㻐㻘㻙㻚㻛㻜㻢㻣
    㻤㻥㻦㻧㻨㻩㻪㻱㻳㻴㻻㻼㼀㼁㼃㼅㼆㼈㼦㽌㽏㽓㽖㽗㽶㽼㾱㾲㾳㾴㾵㿀㿁㿅㿐㿔㿜㿠䀌䀑䀝䀥䀦䁀䁖䁡䁪䂋䂘䂨䂵䂶䃃䃄䃅䃆䃇䃋䃐䃟䃠䃨䃯䃼䄊䄖䄗䄞
    䄣䄴䅉䅟䅪䅫䆆䆇䆌䆒䆮䇄䇆䇉䇊䇝䇳䇴䈨䈩䉇䉍䉤䉭䊌䊹䋅䋆䋇䋔䋝䌄䌋䌛䌶䌷䌸䌹䌺䌻䌼䌿䍁䍏䍒䍠䎓䎛䎞䎥䎬䎭䎲䎾䏜䏝䏭䏮䏺䏼䐪䑒䑖䑩䑮䑷䑸䑾
    䒇䒑䒘䒙䒮䒯䒿䓀䓁䓓䓔䓕䓖䓥䓨䓩䓪䓫䓬䔌䔍䔦䔨䔫䕂䕄䕈䕎䕐䕜䕲䖄䖬䖾䗖䗭䗳䗴䗻䘉䘗䘛䘞䘧䘲䙊䙋䙌䙍䙓䙜䙩䙫䙶䙻䚀䚁䚌䚤䛓䜀䜂䜣䜤䜥䜦䜧䜨
    䜩䜰䜳䝈䝙䝞䝨䝲䞊䞌䞍䞎䞏䞐䞲䟲䟳䠌䠖䠗䠲䠺䡎䡗䡸䡻䢀䢁䢂䢏䢘䢠䢷䢺䣃䣉䣒䣗䣭䣳䤀䤇䤌䤐䤣䤩䤪䤲䤼䥇䥑䥓䥛䥜䥥䥦䥲䥳䥹䥻䥼䥽䥾䥿䦀䦁䦂䦃
    䦄䦅䦆䦉䦛䦟䦶䦷䦸䦿䧀䧈䧎䧩䧭䨃䨕䩄䩎䪟䪠䪪䫧䫵䬚䬻䭎䭏䭜䭪䮂䮅䮺䯁䯄䯅䯔䯩䯼䰮䰳䰵䰶䰾䱦䱩䱪䲅䲇䲈䲕䲘䲞䲟䲠䲢䲣䲤䲶䳥䴋䴌䴓䴔䴕䴖䴗䴘
    䴙䴨䵉䵓䶉䶭䶮䶯䶲䶶䶷䶸䶹䶺䶻䶼䶽䶾䶿""",
    5,
    0,
    0,
    107,
]  # 其余未能分类的基本区、拓展A区汉字。包含一些日韩用字、方言用字、现代造字。
