"""
平水词林韵列表集。
汉字的平仄类别：定义平声为 1，上声为 2，去声为 3，入声为 4
平水、词林韵部按实际划分决定。
列表内容为：字、声调、平水韵部、词林韵部。
已经补充更多字。
by Huluebuji 2025.3.19
"""

ds1 = [
    """风中空红同东翁公通宫穷功雄工丛鸿蓬终融濛虹丰童虫弓桐蒙匆戎崇忠隆珑衷穹躬栊笼攻篷骢葱筒聋逢枫充铜瞳熊聪胧洪忡烘嵩峒砻
嵷冲悤窿昽僮菘茏芃癃茸恫梦幪曈艟讧矇筩仝瀜冯䧺蝀潨绒盅騣崧璁沨瞢雺朦藭烽翀螽狨霳咙潼谼侗鬉嵏荭棕穜葓饛懵巃氃罿蠓爞豵豅䓗痌拢曚螉
疯潀衕芎韸酆蚣䃧朣悾艨駥㤝泷髼葼总愡逄沣娀匑緵哄崆种麷珫茙髳埄懜涷酮漴肜囱翪釭堫㠉蓊鯼㰍犝氋罞篊䕺䮾硿㚇烔蕫涳洚檬烿稯鼨渱玒鲖塳
汎庞艐䖝膧篵絧橦鬷菶䵄箜眮鍐叿惾䒠浺鸫襱茼菄檧㝟䲨䧆鬔䈵埪靀懞蠪嗡谾倥柊哃狪茺漎蘴鏓漨摓秱龓靇憽㢥爖鵼魟鉷朡蝬獴猦蓪詷蔠霟鎓靊倲
碽䁓䟥灴浲䉺娂偑鑨獞㒶埬棇蕯楤錝䍶葻繱㼧㮬勭焢䴀熜餇仹䰒幊粡㼿䪦㲁䝦糿崠鹲㸗鹟䴿䯷䘪囲䡫䈡㕼㦀湰䆪篢㥖嘃㓽鄸檒䏊䫹䤓熢碂疘揔屸䗓
㦕濍䰸䡯瓨䆔娻㣝愩䑃㹣㣉痋䙦樥䱵㠮樋熍粠杛寷鯟嵡㕬㨑䰤㭜䤝㩚徖㵯㒥漗曧汷䲲䪊䂫焪艂爜堸㝘㠓㜴䈺㴦熥䆍闂㣭䮵㓚仜䩺䧷㖓硹䥂䐋鴤㺋䆚
㳘鸗䈦䀄㙹㚅㠦赨䞑猣㝫䅝䴶㳞""",
    1,
    1,
    1,
    1,
]

ds2 = [
    """峰龙容钟松重浓踪鐘封从宗蓉逢胸鍾冬农慵筇舂锋庸凶侬茸供恭冲溶雍悰蛩蜂墉鬆缝秾淙烽佣镕兇镛醲忪邕邛淞琮龚鼕纵颙憧饔喁笼
汹彤榕鬃眬跫共卭痈茏嗈蛬噰賨丰壅匈鳙讻葑廱脓憃枞艟鄘咚恟禺鏦熔瑽瑢摏吽舼嫞䡮蕹䯳蹱苁籦佟灉褣蹖鬞瞛銎䗤憹䂌㲨磫哝橦躘凇浵妐㙡襛桻
彸犎媶䡴澭庝穁㤏齈衳崶䥢䘬詾䃔䗥蚣傛摓伀緟蝩滽臃鏧倯蕽捀夆㺎妦䗦䢼褈苳搈倧驡徸䅊㴩漨鉵媀㿈鑫㸼䌬㲇炂鷛䣏䙂鉖锶堼㟾孮䠜㬝㢕緃㜡㣠
䈶㼸銿縙㜂赨㡣䰌㹐䤊痋㫒榵䡆暰㶻鸗䳍䡥㣑䊄䗸蚒䐫㠽欁䝑㫡熧䳷龏䂈㮤䳋䧡刣髸䇯炵䀱㧭䅃㝐槦隀鰫䇗慒笗誴檂㷭䢨賩㚵嫆篈㮪郺嵱䆹䢉㻾䗬
㜉髶䶱㐯浲䩼䳯㽫䇀䳉婃桏㞱禯""",
    1,
    2,
    1,
    2,
]

jl3 = [
    """江窗双邦降缸幢腔撞庞淙杠扛艭釭矼厖泷摐桩哤尨跫茳鏦狵駹瑽憃㟅庬䆫逄䎫谾玒悾肛䉶洚梆愯橦囱漎枞椌噇娏羫痝舽䵨鬃豇蛖䝄刅
垹䜫欆瓨㼻哝讧啌栙涳跭牻胦魟憹㤶佭舡鹲㟌堫䄝䚒䃥浝䤸㧿孇䉘䜶䚗峕㒕㼹䚎䭚膧䁸䢶㾤䓼""",
    1,
    3,
    2,
    3,
]

vi4 = [
    """时诗知枝期迟之奇思悲丝师姿池离移为宜垂辞疑眉谁儿随词持驰衰吹卮痴碑仪夷旗斯危私滋祠披巵饥篱支兹遗欺差湄棋窥帷施墀涯追
规漪嬉疲资基颐芝卑羁亏怡岐司皮陲脂嗤炊慈熙医陂肌维漓麾璃蕤茨其咨曦龟螭伊髭累迤歧欹姬脾缁雌锥彝尸葵推釐骑飔贻疵饴治巇縻赀糜痍罴箕
尼夔羸梨鹂篪萎楣隳弥狸而绥逵䍦鸱攲蓠肢羲澌麋噫洏洟椎裨綦媸屍孜嘻崎笞蛇匙陴醨罹猗齐玆骊罳比禧菑瓷嫠丽胝咿坻淄居罢蓍鹚毗耔萁姨蚩怩
筛嵋狮嵫惟鬐貔书耆锤牺榱訾寅醾鸶祁絺輀緌蘼㕒睢匜祺隋骓䂓祇犁氏提槌扅嶷魑僛缡眵埼酾孳踟摛褷瓻祗圯崖琦凘葹丕倕坯邳蜊埤敧戏埘熹琪氂
厮鳍磁痿鎚跜畸栀簃撝诒蜞锱垒骐粢馗辎黐蠡踦壝漦玼鲕甤淇娭餈妫铍脽犄僖㜷缧虒偲鸃鲥鸸箠觺椸赍眙觿嚱剞祎戣厘厓骴伾骙纰茈坨鼒諆鵻麒栭
胹髵庳呞椅咦台褫絁黧黟襹蓰倛㮰锜虽逶劘桤耏峗轜娸耛欙㬢㒿蚳劙宧翍稘秠䴊疧荠犠缌妮唲泜镃鍉委䲭甀㕧犛貤薋纚蕲訑椑趑荽潍郿郫魌禔箄禆
椔罙暆䙰媐剂唯仔被琵觯酏鲻駓榰蔂覗濉跠䄜錤峓厜跂呢觜猕沩蛳鉟蛦嗞剺梩倠簛頯蚭㰚腄洢㱆䧅摫䕻旇嵯吱诐蚍黴狉齍觭胔鸤榯甾鍦爢熺鰦虆羠
噅頄㩼齹澬樆岯㶟陑恞糦丌耚㖇䂀㔣阰䬐魾湤䨨枱胰饎蜘鈚謻禠孋鹎轙龇鳷崥蜲隹狓偨蚾虮衼䔟齝鯬廲瓵豾桵芪掑䴧蕬柂柌仳陭柅蠝藄茌攗䳢㯅沘
䟸怶阺鶀㱦秪䆅䎩㩾蚽㲠秜蟣㾨芓䅑㽻钚箷䨏㠌寪䱌䶵㮃穲菭㞾鹛呰茬蚑栘蠵螷呲枇踑蜱呸圌姼鵹嫢騩鮧濝躨犪鲏苤嫘蟕愢姕萓瞡跢蘪蓷悂诶膍蛜""",
    1,
    4,
    3,
    4,
]

ww5 = [
    """归飞衣微稀非扉机违晖機依肥辉围矶威霏挥闱饥薇菲希帏畿几徽妃晞讥玑㣲巍欷旂騑祈鞿圻韦绯腓沂俙馡翚唏豨睎颀诽煇淝蝛埼㱕蜚
葳禨袆痱囗叽狶溦皈岿婓鐖㵟溰悕鵗譩㟪餥厞湋犩騛耭烯郗蜰裶浠騩僟刏㙨䢜䬠鬿楎蟣蘬楲莃郼蚚鰴䧇肵婔㚻玂灳琋靟㟓㠻屄䈈渄瀈㫎岓鲱禈䒾媁
椲涠䓅㙎䥩䉠蟦㫵癓奜鍏㩣媈鰄㥋飝䪰䇵䙟魕㹆矀䟇䩁㳖虮㹷喡㛄䖷隇覹媙猆""",
    1,
    5,
    3,
    5,
]

yu6 = [
    """书馀居如疏鱼初庐虚车除舒渠裾墟闾予锄舆余蔬渔徐诸躇欤胥储驴梳蕖嘘歔琚誉蜍于摅玙畬於蘧鉏猪旟茹与樗狙纾袪趄祛菹淤篨蛆胪
潴且苴沮雎据疽榈挐滁洳妤鶋袽蒢魖驉箊砠㠊舁阹磲虑糈蝫呿鴽綀畲璩铻龉屠槠䃴谞帤咀岨腒藘䱉醵湑胠橥籧涂唹鸒衙䱷㞐蝑曥疋藷摴鐻鵌㭬㻬䕡
雓伃筡耝䠧蒘艅䟊䱬䈝䏣䋈懙瘀崌鴡椐楈蚷䐗俆蜛豦匷抾鷠䰕憈螶淭爈蕠㯉狳瑹䝣䪶䂛㾒鱋鮽㭕䈌豠坥郚䥚伹䣷㣄偦涺菃謯揟㶛䰻娪㠠䧾籅婮捒硢
㽰䣰藇䘫捓侞䮉䐳㝒櫖䓚䡤鵨稌㡹㱺䒧䬔䆽桇䔡䊰蕏䁩麆㥠㶆筎䗨劯䍱㯫㧧嬩捈䝻䅕蒣㺞邚魼䢸璷紶""",
    1,
    6,
    4,
    6,
]

yu7 = [
    """无图湖夫孤珠都殊隅徒途壶呼枯须儒苏娱俱芜符愚扶乌衢趋躯区驱吴奴株虞吾雏乎蒲糊腴炉纡驹徂肤梧吁蹰凫臾胡粗姑厨涂塗迂铺敷模芦
濡垆沽谟朱卢诬诛逋襦枢癯拘租姝渝榆晡竽鲈瑚输岖酥狐摹辜盂弧需鸪臞劬铢颅孥孚趺刍愉于毹污舻觚呜屠巫菟轳谀踰俞揄醐菰酤瑜逾萸殳俘雩痡桴盱
蛛郛繻歈殂鼯嵎嚅蛄驽荼酺蒱貙呱瘏蚨禺餔觎褕刳玞苻矑幮㬰跗窬趍莩鈇栌镂瓠洙泸瞿罛㪺纑絇唔駼鹕阇牾喁媭柎稣圩䰅摸恶毋於枹荂圬笯玗芙洿趣麸
邾娄瘉罦母橱菇羭蒌杅砮醹懦诹旴䛕句膜稃帑硃孺娵蝓牏葫龉瓿鼩欨莆痀玈喻驺趎幠戵嘑茱稌軥嫫鰅柧膴㥚陬鸲姁跔蒩軱媰救䒀芋侏滹呕嵞腢楰㢝箍蠕
匍猢酴跦騟堣氍颥溇瓐邘獹䧢葡嘟鸬蝴喣虖朐胊癒浯箛齵鮬鋘籚鈲躣鄜獳澞䱐鴸䖘嚧菩殍謼峿轱荴欋慺庯膢睮蘛氀釪呋鯆灈峬咮枸臑陓鍝珸箶斪粰㠸祦
雽陎垺䉉㼶堬泒忂㭰鑺䍢愈軗怃盓媀邞䅳㟺雐㻍苸峹䈻鶦䢐湡㸡娄咕隃歍孵蜈裯钨謣蠼榑扜鱬犓鰞鑐蠦攎䰰嶀櫯杸怤氁鵌袾魱哌冔鸆廔枎橭钸鹀誧骷黸
陠鴮鵏薷鷋楜跿絑醏虶窏螐胕鷡歑㮧鮢璷䭅捗莁懯轷萮瞜曘庩鷜嬬麆譕衧鷵柨鳺蕍瑦㼋郚䜽㦆颫㿖䇕㭪萭酑䞮廜䭍翑㽳㭸捈豧䆰㹳䮏燸㻀䣯幁駯㻯㼡䡍
荹釫筟㢳㫙秼姇瘘禂㱠胍扝譃㢏瑹箁蓃㩤潳麌鰸䖚袧墲㝼岣㚢娐恗䋶緰㷒㔧䄮㗙橾跍䅷玸䩣郙貗鮕䢓䮃嫴彋虍䓵㓬㣘䴸紑䣄䞤葄鵵眗糐桍㾰䎍㲗墿㧣緅
㜹㕊䓊䝒䵶䵾弙䃿䉐䩲䂂崳䇬䉿晇豠郀垀䫱㻌㷻㖩䩱穻骬䟞䊸䮒蒤㡏茣瞴抭䄨㲎綒䧸㐡畉梌踙蕦㚥㪀䞛淲䈬䦜䊿䞕洖聥䩒㸖㪭㺏娪喖䉑鮈葋祩䣿㬂邭鄃
㳛檡㥥䏏㰭䣚䴣䓏䔕䩴䐻桙媩䎔璑㺮紨㗅伮衭䇓挎瓳馟蛷㭔䠒妋钴䭌㯛㦵䎁螸䰧翵蜅鯂啚""",
    1,
    7,
    4,
    7,
]

qi8 = [
    """西低啼迷溪齐栖泥兮题鸡堤携蹄梯凄嘶蹊藜畦萋稽跻妻闺黎提鼙倪悽霓犀圭犁齑脐鹥荑瓈鲵鞮猊梨赍暌奚挤笄睽蜺奎稊篦羝嵇隮鹂黧绨徯醯
儿批鹈麛鎞撕騠刲觿麑氐鞞黳輗禔骊臡韲枅䨑鼷狴诋㩦袿齯磾蠡缇蛴蠵澌粞樨傒坭折䬾乩䃜㙠懠罤烓繄缔恓崹㜎窐媞褆婗瑿㼰遆柢醍鑴巂霋砒鶗邽桋椑鮧
㡗緀鲑鸂锑鷉膍偍䯓酅㯕櫅㔒㦒郳㩗亝卟䘽渧䉫瑅㡙㿽蜺鳀蝭趧邌鵹螇棿屖蝰蒾貕袛崥肶嫛梋鴺騱胿盠榽豍謧廲艩麡藈彽郪厗鶈橀㓾猰碮嗘䖙豯䫣鑗㯇眱
㓳䐎聧㖒㾷屔㔸奃䠁齌㰿睳㢴驨㮷鑙䚷㣢儶釮䅅䧑䄢䔣䤍㫝斊鼶銈趆㸄蛂錍㰀黊䪢㨒䗗睼媂䳶蒵磃㴝䀘螕焍鍗鍷燍㽯謑湀淣珶梐郋䵩䛊殹䔶䐡禵啙忚䝴䱱
錅䒊䂑㛷䚣觬腣鷤䶒纗鑇䙵䛱茥徲徆䄺玭刕檕眭㕃笓楏䛏鬶䮘䍕瓗惿䬫䚜䪡""",
    1,
    8,
    3,
    8,
]

ja9_1 = [
    """怀佳斋阶谐崖排乖埋街偕钗淮鞋骸涯侪霾柴皆牌揩槐喈荄豺差俳挨筛鲑楷湝䕸薶褢齐秸稭痎歪捱䨪膎櫰啀睚徘螷㠢箄䡨瀤祡喍榸篺㔞䃶棑崽
搋龇蘹徍摨㥟㾬䍲䬩薢掜犤䚑煯啡䳸㜳㩄猅蝔䠹鶛麡擓䱝夈猈㦟淣㾹腉䴜䃈㪰䯐徥䙎㜥䁲㾩䔝㨤䓱䡡㪓娾慀㗍䂷䓙媘㗨誽膗捚諰榽輫唻瑎㨙㼮溾""",
    1,
    9,
    5,
    9,
]

ja9_2 = ["""佳涯厓蛙娃哇蜗娲鲑騧靫䦱緺㰪芆唲徍猚""", 1, 9, 10, 9]

hv10_1 = [
    """来开台臺才哀苔哉埃莱材猜裁栽胎灾垓腮孩财咍皑该荄纔骀毸陔䑓呆徕抬儓鲐能赅炱颏菭䰄鳃騋侅邰崃唉欸思挼菑騃薹峐咳偲硙籉㶼剀絯毐郲檯胲跆
倈䋱斄箂䅘颱麳鯠毢敱㰩郂猍䐩涞隑祴鶆揌䚡梾懛庲箈嵦烗溾啋旲輫琜睵㒲愢㰧嬯䀭㙵䪱䠕婡㾍䱺㚊㸀䯮㜾賳䶣㾂䞗㱾䬵䤤䴭㱯㬃豥㱼唻俫珆䧒孻㷘奒㨟䠽渽㯁""",
    1,
    10,
    5,
    10,
]

hv10_2 = [
    """回杯催梅雷徊灰堆隈嵬摧陪颓媒罍魁醅瑰枚培洄槐恢豗推煤隤巍桅诙偎煨崔佪裴坏胚莓䨓隗禖缞漼搥尵柸抔霉虺魋䍙鋂脢玫徘赔盔蓷敦䝇啡悝衃焞䋿
塺磓傀酶崴轠捼毰嗺鮰䭔阫㷇碨慛頧擂椳蘈檑㿉㟴㵢紑䀃鎚蛔櫑镭恛儡咴蹪羧腜墔茴熣诶畾鏙弚僓愄磪渨葨鑘瓃彽痦㻁陫凗荋讉鐜㜠坆棓䝅陮鞼鸓鴭㾯鼿䙑櫆䂙妚㢈詴㛱湈㺳阢䣙脧缋䊈烠䫊螚㚰錑䤂膭䜃㷟廆謘㿗簂鮠燘洃䖶鳂㞜橔㮎藱痽顝㟝晆揋藬䍣㙁槯㕍""",
    1,
    10,
    3,
    10,
]

vf11 = [
    """人春尘新身真神亲臣邻贫津频民辰巾滨轮陈宾因伦珍仁鳞辛秦晨旬巡沦伸麟纶嗔宸薪匀茵银绅均峋驯颦醇申蘋钧旻淳唇论榛闉循筠囷垠寅屯粼臻莼闽纯皴
缗椿呻询蓴珉磷嚬遵振谆湮瞋姻漘禋岷裀燐鹑彬恂堙迍纫甄踆濒嫔泯辚莘狺蓁訚畇豳龂缤荀抡驎诜嚚氤璘信珣輴歅竣潾駪㕙畛麇窀逡䑳贞殷嶙骃侁甡鄞溱夤桭菌斌矉邠肫
洵奫絪娠龟兟獜轃紃旼郇錞螓蠙玢忞犉僎䄄麐㻞瞵諲礥矜袀镔杶填籸鞇輑罠殥眴螾赟侲瞤䟴箘笢囵鷷蜦鶞㽦橁翷柛墐㲀筃䞭瑧珢傧槟抻栒慇捘盿峮洇頵霦份珅琎湣朲荺䰠
繗䎙揗䔚禛壣鏻䖜鈱盹玭瑸忳眒嗪訔玟衠暋碅蔯鯩䐜莙磌厸棆麎茞峾螴驞痻㾕鷐緸欭昀檭阌㨉䢻凐䅸帪駨殝碖䙉䈁縜䣩錀姰猌䋋陙暽搸胂䖲鯙䞺瀙嫀搷杊䢅㙬㭄㵌蒖蛝姺
㡦抿汮蜠䍰敒踚曟覠苠迿䃌馻駗嫃浾燊盷㞶莀鵢瑃竴㝇栶怋䘩鷏壿敐䡅狋鋆㘦偱㖘籈䈯魜屒捪䋸裑敃蚐姄鳼猵㡄槙㵮膞鴖䓐䚬珒屾㡒馪㟗礗訰顮䁕㚬㝄䊁檈圳樄䪸㫩㛛䘜
甐峷䨈㫳穦䣅疄䇹㟩陯㰋䝧砏㰉䆣䠳䯂䓰芢䥎宒灥憌閺椕蔩㰬暙媋妽鍲䡑秵腀璌耣圁咰囩鏔訷泿阠䮼䧣秂䳲㔂扟䧬毥㥲囜䐇斴㑗薽鰆㛙汃㧢攽㝙夋䀼堻薼""",
    1,
    11,
    6,
    11,
]

wf12 = [
    """云雲君闻分文群军纷勤曛勋氛芬裙坟薰纹氲焚欣醺濆纭熏耘斤芹殷沄蚊懃芸汾筋棼垠荤忻雯枌昕蕡缊雰纁龈员皲贲麇煴矄縕黂狺焄筠饙羵鼖慇慬蒀觔帉磤
幩廑蝹翂棻鼢訚筼豮瘽獯郧炘䈥馧㷊臐釿鄞汶妘餴瘟羒㥯宭涢轒彣衯橨馚桾蒶熉嚑䵫㜏㹞蕓馩昐㚃䦩㶏溵濦萉鳻蒑鴍阌妢岎蕲眃芠鍕歏揾弅䓄耺朌梤魰䢵肦拚煇訜縜䎹䭽
蚚䉙䌲堇橒䙧鼤錀鴖䩿懄斦㸮囩敃閺㞣邤䭻隫䘇䰚妏䒺鈖葐秎畃盺蒷㪊菫魵炆妡䗼䖐鳼㮗玟砏鐼馼䈽䴦愪鲪㯣㹜""",
    1,
    12,
    6,
    12,
]

yr13_1 = [
    """言园喧源原轩翻繁元垣烦猿冤暄藩辕樊幡蕃鶱援谖萱番掀璠轓燔湲諠鼋蘩反鸳鞬沅鹓袁媛宛蹯膰墦爰籓矾眢怨洹蜿暖蚖袢嫄晅騵㠾犍貆䁔甗薠攑煊蠜䋣煖
樠阮䪤拚䭈芫羱裷笲鶢喛䲮噃㟲槾䞿㱪螈謜鐇杬僠咺犿蓒蒝楥蒬襎笎瀪榞勫帵琂溒榬䡝臗邧䪃䠝愃妴翧㦥攐褑喯喰㩮摱㓺佡靬娮䮳䪛䫶抃㨜昍梡㸋䋦袸駌䩩㹉愋睷鱕葾豲
䚭䥉吅媗㤋䇾䳦㺕㓩䓂惌䖠橎㹇鎱嬎㪟羳䊟䊕䉒媴䕰䖤瀿䚙蝖箮瀳㥳鷭""",
    1,
    13,
    7,
    13,
]

yr13_2 = [
    """门存村昏魂尊痕恩根孙论温樽坤奔吞盆浑昆暾屯阍藩敦豚扪飧崙蹲荪墩髡婚鲲裈琨仑喷埙䰟鹍跟惇垠惛黁贲臀抡燉沄缊亹䑳芚狲啍㹠焞嶟璊饨囤辒縕湓蕴
拫蜳纯们鲀弴瘟鼲㛰搎棔忳穈虋軘㬈焜炖溷㖧吨混蜫馄噋憣墫鷷䟂䫒䐊韫殙鞎貇㸑噸渀汶锟吩涒庉锛涽繜㡓旽驐騉豱鶤葐殟珲菎薞睯槂撴瑥惀瘒菛蒽猑倴瓫蟦湣霕䊐㻊
䮝睧䆭餫喰惃朜㮯棞㒭䝠㑮闦䡣轋暋芲㱎澊憞泍㼔顐㻹橔䊩煾䴷黗䵍䕖㢯婨㩔坉㯊禤䖵拵㖹泿陯䃦㬿婫䎜踚䴅䔻玧鐼緷痻䗕囩訰㼊怋忶瀳犜""",
    1,
    13,
    6,
    13,
]

hj14 = [
    """寒看难安欢残宽端官阑盘冠干丹餐澜乾兰竿观栏坛鞍漫滩团酸翰鸾弹峦肝湍玕桓丸叹完蟠单珊攒韩銮岏殚槃刊般栾棺纨漙抟檀郸圞瞒跚瘢杆箪驩谩刓
繁磐钻姗潘拦讙汗剜胖敦摊鞶拚柈襕曼奸磻顸番汍巑鼾啴萑羱掸髋慱鳗莞狻獾谰拌鑚倌瘅墁判滦樠馒芄弁鬗眢鞔瘫镘襌犴峘邗貆矸鏄㠝瓛嬗洹雈媻豌
渜颟驙耑㨏搬剸豻蹒涫驒悗痑縏剬籣荁㡩塼幋絙㿻芉迀槫曫撺皖桉钎烷酇抏垸嚾囒獌豲貒羉睕捖鴅躝慲繵跘忓槾灡鳱忨煓貚鷒婠帵韊灓䜌雗匰㐤䗕㒼
䗙蠸㠆嫨螌綄暕㱍䝳䦡吅㩛檲椯蒰篅䪍羦䒟鍴䯈萈臗媏窤䬧荌㫨搫㗄㟨毌㥇䙁䜱欗竱䕊褍躜虷䊜䵊㣋㱚㙔䧲䒥鷤繟䵎灒喰䖂䈲酄聅㘓䉔㿪䊡雃靬㢖䃪
䮧㗈䴟䡽㸩䱗臤䝎㙢䃲鱄䆺褩䢿偳犿㛽唌䐽䀂嫥瀊馯砃梡穳㶥㽃䐷䝔矕䝜攼寏糷嬏鋑䑌帴䈀""",
    1,
    14,
    7,
    14,
]

uj15 = [
    """山间关还颜閒闲攀斑湾环班艰寰顽悭鬟蛮删湲潺弯潸殷菅颁奸鹇患扳阛孱镮娴斓鳏般瘝鬘讪锾纶跧圜蕳澴黫豩憪擐虨㘖鬝僝豻闩嬛䰉痫轘獌眅葌㻞瞯
虤藖澖覵攽䅼糫狠矕螌矜朌羴㘤詽鳻䤽硍䂅掔䚪顅漹䔵邖䃑㦨譠睔馯曫㰑䰋䓸㸶䦥䘎㯗㹕蛝肦䚲黰䭴靬㗴䴉䡲婜羟狦㐴楌㡲㶎臤㣶㺗""",
    1,
    15,
    7,
    15,
]

xm16 = [
    """年天然烟前边仙眠船泉贤传煙田怜篇川钱缘连圆弦筵妍悬先全颠禅鲜偏迁鞭莲千肩绵编旋坚巅渊娟玄牵笺宣蝉翩权捐毡延便联缠穿椽煎鹃焉拳阡专镌愆
骞廛涟旃燕虔躔涎钿僊诠还鸢涓膻筌燃芊鞯跹痊铅蠲邅蜒壖阗研乾砖沿舷甄埏湲鋋填堧溅员舡湔骈荃县棉挛悁韆铨笾鹯饘鳊褰嫣鳣佺遄悛翾搴軿咽瀍平蔫蜷畋滇圈蚿癫
漩戋篯卷儇圜棬颧胼鬈潺篿萹犍颛璇櫋惓㫋跧蠙璿湮綖箯零朘牷弮䳌蝝楩鼘塼嬛孱蜎扁瘨键挻睊肰扇佃揎籼蹎豜諓褼蹁㳙单菸㾓獧鲢竣梴歅蟺垠婵祆攧鋗汧谝嘕瞑瓀瑄
媊燀滨眩煽蠉橼拴澶仟撋沺譞磌潫楄枅剸駽捲䏈輧胭蝙幵䅌脧猭鬋扦辁窴攓㙻懁篅縓狿岍栴廯玹䰓絟纯駩攐栓嗹儃孪甂䳒耑騝骿婘觠噒痃梿鐉脠帴鱄蜁烻姩䃉豣絭莚玭
勌䀽㘋㳬䡒峑玆䒶媔碝鞙缏唌蝒餰齻琁鄢矊鵳琕輲㕙翴蠸謰嫥蹥㼐䢴孉諯鲣葲馢巏猵犏盷湶阏鶣鷏叀驙媥苮茾㲔稨郔蟤蚈縺楥齤羴鰬嫙鄟㢟珚揙㳄妶檰臱縳㟫矎僆膞辿
狋傿梋䲻㢆繟汘㩊䑏䔐奾菺忓㮍璳棩牑酄熞嫾㝚䮄矏䙭碊㫟嬵臤恮䀬頨杄䱲䌑鍽䗎薽鶰㳭㮌㭹䮁鯅㾫奱瞏䔳漹驠䶬鷒肙灒賆掔䌯瞤㔯弲顅虇䠰奷暶䲂䨊瑸瑼䁢䉦㥕跰㹡
娹糄瑏誸䃛鋻䳿䉳䥧黇玧裫㒰屇䟒䙲㡉䆤㶜珗䊙椯瓹䙴㘣摼䚈䟧䋗籈㒙芇䳣矔暷锩騚䧃吅䀖㩲葥㮵䁣䘰颴㢺䥖䂴圌剶䚶䚊㢧圱瑔橪酀冿惤娫䚯繵葏㓲囨㝰䲆雃㗔厧䀒䢬
㿼硟姾䗡胘㟀鍹䏃㼷㨎㷑䇂詽裐㛹貚䡘㵪焆搷䄳箞槫䗠㶌䋌檈䳪鋑㦁癴鳈宀腃㰃謜翧䛲犈剈繎䕼愃閍链㜣䣺篶䟍㿊瀳锟槙媗銒㒽""",
    1,
    16,
    7,
    16,
]

xn17 = [
    """遥朝桥消潮霄寥招条宵萧腰飘骄箫摇销饶樵凋苗谣娇瓢迢桡聊标邀焦绡峣椒飙韶蕉烧貂调寮乔超瑶嚣尧翘潇雕僚浇轺嶤描昭姚辽镳妖要杓娆彫苕飖枭
跳挑撩憀髫蜩谯鹩歊鸮漂猫荛枵夭窑刁翛徭陶祧料骁侨㵳哓佻漻么缲晁瀌魈幺徼弨趫彯恌猺痟侥繇岧幖峤荞臕硝熛膋碉剽祅劭猋憔鹪橇鳐喓熇穮燋跷鲦獠礁嘹怊缭飂
蛸薸轿瞧锹憍虈葽燎橑獢鹞膘龆珧嶕锚镖箾鷮镣荍鐎愮鞗爂撨豂褕噍钊敹趬儦襓䖴毊嗂鱎摽逍痨铫訞嶛嵺翲鞒蟏叼揱膮暸鮹僄篍哨嫖蟟蛲髟蟭䱔櫹蟂媱踃簥㲈幧翏怮
柖鄡脁簝餆佋尞䂏呺䮽䬙䁘䩦䩌膲票炤吆撬笤鼌藨嘄榣嫽虭潚麃飉憭嘌骠蔈鹋枖憿嫶膫鲷颵蛁瘭憢骉鋚髎隃劁㨱嘺癄暚廫岹螵烑䖢撽䶰㝯㶾璙蓨朷蔋䫞䘟䚻盄䳩啋緢
㓮瞗篻㟹緰㶮犥焇㡻穚㲬弴狣鴁䱁䙅鉊庣䏆皽鍣刟橚㲖莜㕥橾鐈䁃楆磦㸈㑸䆙鸄祒贆䵲瞍顟蓧熮敫䁧婤䌃䒒㑾駋穘䯾褿㲵鄵鎥㚋䴛繑欩筄獥莦㟘㯱䌭彇䚺䉼卲䀉㠒菬
佬牊藃孂玿䴩窷㴅䖺㼼燆刂䨭㪣灬䠛㹦狕㬸䅺䳂䎗魒旫喿镽萩匋䁭䍃謤䢪䨅䄏顠䫿旚㚠㸛妱聎鮡䜍奝宎屪鎐顤䕯䎄""",
    1,
    17,
    8,
    17,
]

yc18 = [
    """交巢郊梢茅嘲敲抛坳胶包蛟苞庖爻匏肴抄淆呶胞钞殽教筲嘐捎铙茆泡旓崤硗蛸鞘稍茭哮譊凹鲛髾炰咬跑抓弰聱骹怓虓髇烋炮庨磝咆啁䫜麃謷瓟筊艄轇
颵姣窼挠剿㠂窌脬媌犛詨樔轈罺䜈鄛䬘嗃䘯鵁鸼窙摎漅罞䫸倄飑捊枹嚆誵䈰鞄莦䢒笣爮㹲䞴㤊刨嘮跤婋嵺訬吵硇鮹龅狍猇鴢謧髐涍賿痚墽梎軪挍鶜窲䈾硣䅦䋂頝耖摮
礉䃩䄻焇㿰㫴尥顟䂭鄗㬵㺒䂚繷觘嚗泑㶀䍖輎獿㕭柪䍊宯顤渵侾䰫摷穘娋䉰藃掊䴃骲蹘㮁䟁脟緢洨佼芁䩝郩䮦軳嵪勽灱㤍""",
    1,
    18,
    8,
    18,
]

hc19 = [
    """高劳豪涛毛曹袍刀骚皋毫桃醪逃蒿号遭牢鳌陶膏旄舠韬滔操髦搔遨褒篙螯饕槽萄猱艘绦嘈嗷鏖糟壕嗥槔熬翱忉叨敖糕璈濠臊羔櫜嚣缫淘洮嘷薅尻咷颾
獒醄挠绹挑慆螬鼛漕嶅艚鼗捞謷慅嶆嚎骜翿芼簩蚝啕廒鱽裯䬞謟溞咎绸掏氂梼蟧駣騊轑釖裪蜪謈哰牦幍呺峱酕崂㺜椮爊睾搯鷔臑䓘鏊䝁橾䑹祹䥝慒涝䆁耗㹗痨唠蹧椃
匋夲鷎浶憹軞髝䑬諕饀獋傮㯾㠙䜮䯌䮯䜊㜖鏪蕔褿㲏㫞㟉㗦蔜枆鱢鄋㥰夵抭岕嶩嵍䬭蝚㞵憥䕅䈱翢巎鳋籇㤒䫽䦋㺀槄滶䛌髛㫦詜訄覒䵅䲏䛬鋾䤾蓸䬢䄚摮䝥朷䧫瑫鄵
䛝䫨㞪㩝䀞䜎䭷㰏㷮㮘嫍㩠㡟獓㯥隞聎膫䐬㬔簝嵪""",
    1,
    19,
    8,
    19,
]

ge20 = [
    """多何歌波过河和罗萝磨阿峨柯跎戈坡科娑蓑荷摩哦讹娥梭珂魔皤螺窠窝沱禾陀鹅他蛾驼酡莎呵婆鼍那挲诃么痾颇轲疴涡苛哥莪佗磋它驮拖靴骡牁俄薖
蛇搓瘥锅陁傞蹉傩劘迤蝌瑳鹾锣舸啰箩矬紽倭囮睋娿嶓婀鮀醝吪蠃挼詑蠡挪覼沲䯢屙趖髿番伽艖牺猧迦茄难砣嵯碆鄱緺玻献唆痤瘸儸椤喎菏濄逻饠鈋㗻䋪嗦驒堶砢硪
埚鸁騀哪她岮㽨㜑牱阤䑘踒啵蘑稞繁捼盉桫莏覶䒩齹䌴戨簻袉柁鈛䝛㹻䯊㸰䃺枷菠猡鸵莴攞髁遳涹哬皒滒鮻脶渮萪鼧紴㢦虘迗鴚咃髍䣜蒫枙䤬攠鉫㭫誐㛖姀虆魤鲄吔
蔖橠䆼钷侳䡐睉犐㚳䍫攎梛䌀䴱喛㛗狏踻䴾尛剆㼠涶㰙啝钶戂搫唩䓾㿆崜抲氇㱒跢妿䜏㸯䆧㤎䪑庹䖕㸫㨇珴柇澕戓涐䳗楇櫇䈖呙䋍䊨鐹㔮䔀䭩摞䄉䐆䔅躜酇嘙䖸锕痑
䠡蚵覣㽿㑚䰿翗㩯""",
    1,
    20,
    9,
    20,
]

ma21 = [
    """花家华斜霞涯沙赊鸦茶嗟车纱誇槎加麻芽遮嘉瓜牙哗蛇葩笳差遐衙砂邪叉蛙奢琶瑕耶夸葭挝拿虾巴裟些洼娃騧
查枒蟆他蜗丫呀爬窪爷楂哑芭谺哇娲笆罝艖麚伽铘迦桠髽髿琊畬珈岈窊挐笯跏痂靴姱緺杈杷垞檛茄雅枷鲨豭骅䴥莎爹阇豝渣喳
羓猳柤污椰揶騢倻耞瘕苴奓吧疤畲㲚妈搽涂吒靫秅蕸划鍜碬䗫塗荼耙荂煆嘛齇鴐釾佘椴玡茬溠铧幏䨟䵷䃁咱痧钯铊貑颬犘砗蚆
嗏吾妑鎈龃啦叭呿桦粑蹅皻咩袈䔑釶㧓舥䯯㗇㧎鷨㭨笌吙哆䓉㸙碴蚜痲旯揢嗻唓孲鍦謯蒘瘑畖踻泇挓铔溛閕袓譇捓桬蛼筢犌抯
莗觰硰潖胍膼䍓誽蔖諣䫗㖿摦㸺簻腵吪㦋䖯搲浾䶕䂟䐤跒㭉褨䈔䏧夿疨㦄銟䔤䩖㰺抲㠺焻皅蕏䵙䫚脶鉫㗾睱俹䦈梌䛔犽煱歄峫
䄰癿㚙䔢㪥㠏䅿䠸㢉咤㵃䐒鴚捈婼㾚㛻䶗䣝䶥㳸鋘䯲嫅䠍苩蟼㽋謶潳䯞秺㚗㝞䑡蒫㹢㸭侉㦊訍燊愘䁟㜘找䕒哶呙粆椵㤉晇釫嫬
㢒䪗祖㿬㗬""",
    1,
    21,
    10,
    21,
]

yh22 = [
    """香长光阳凉乡堂霜方黄章肠忘茫忙郎场芳狂伤觞苍床荒行裳王常梁藏墙房妆翔桑亡塘扬央皇傍良强量张囊尝冈羊庄唐当旁昌装浆康将廊浪商湘杨祥航疆
望芒妨汤昂凰粮鸯详徨洋棠娘琅坊狼偿箱徉粱纲刚煌僵防仓珰彰簧遑篁骧樯殃臧慷襄筐铓飏穰姜缰鋩殇秧滂锵肓阊糠旸羌榔厢疮璋枪潢螀颃戕惶杭缃庠相岗猖跄匡彊吭
隍邙攘倡薑鲂漳丧璜肪汪骦艎裆钢蝗筜泱瀼鹴眶创庆獐蘉伥尪螂芗禳螗嫜枋霶糖勷嫱孀硠娼鸧沧湟㫄斨障佯踉樟纕怆盲稂铛横蹡赃偟鎗瓤粻逢筤雱镗蒋帮殭疡牂鄣洸苌
喤痒卬蜣亢镶抢餭恇舱罡杗螳搪砀桹膀鲿鴹慌鞅菖玱膛炀礓磅鳇桁瑭彭框锽胱畺肮迒辌磺鉠鬤蔷廧玚钖趪嫦荡昜忼样䀪䀚尚艡莨劻軖蘠鞺鬺桄衁鼚蛘䍧堈䵼㝗仰獚傏枊
徬笐㡛烺㽘呛橿溏慞鲳餦蚄洭粇堭彺䭹䀮崀膷僙恾墒戗镑锒棡螃踼汸樘蟷嶈蓈烊煻弜薚䣼篖蝪熿獽垙䲳闣糃䠙漒㽵䵃媓䨦䕬䄱斻㱂䄃葟䊗烫诓啷饟囔彷蹚鳑蟥闛躟蘘俍
蔏爿嫏傽椋儴徜蠰抰滳筕欀槺愓牄魧篣螪篬黆韹翞葙癀忀犅垟朚磄蓎胦禓鎕䩕珖钫佒躿茪鳉鷬苀匨蚟锖柍琩艆蔃裮砊䳨鶶蔁傹躴鴋姎崲摪㭻瓨撗鑶㨍㶓䯴㜍莔㢜嵣鰑㫕
姯䩷䮲珜淐勆㤺㐬謒㚂䒢㿝䌉絴暲㼚䌮㡃㙶䪄梉䍿䗉㹧㝑䊣㤚羘諹仼榶騜鵟鄌眏䠆㟄㩖鼞䯑㥬皀㑽駺漟紻咉哴㲥澢趽邝㼕牨嫎欜䬗㳾嫝㹁埅牥疒䔗㾠邼妔㱢䖱㲽吂䅛䣘
㭃䍭䗧䛫㦹匚氜綡䵰瓺閍矘㹔䒰凔摚䱀䗵㭿鱆霷㝩䅨晿䢢㾿䏾騯㾮嵢䅣䆲羏䁑鸉崵瑝㞷岇䦭膅婸䯖䧛禟䗅抂䆡葁䘕䅭莣欴䉎㤃䮖䉴笀锠炚㢃鋿㽆䝶䡙邟䮣䐠䑟㑌雵䅯詤
䧜蚢㵴赯䌅軭眻䕋䞹逿䥊貥穔邡㰠胻橖㙊盳嵻硄㦂㟍漮騿㮜㿶㼺㠵縍瑺""",
    1,
    22,
    2,
    22,
]

gg23 = [
    """生情声明清城名行成平鸣轻晴惊横兵荣程倾京英营更迎耕卿精盈争盟缨兄旌征诚莺嵘楹瀛并荆羹评衡笙茎烹鲸萦觥萌呈氓婴贞庚檠筝酲琼晶撑亨眀擎赢
坑泓枰茔罂赪赓甍狞睛正怦撄铛宏粳籯甥嘤铿轰茕钲蘅盛盲嬴琤丁坪饧樱纮莹铮霙菁牲彭伧祯桢橙瑛棚鲭闳珩枪苹瞠訇勍虻韺鼪绷令鍧黥峥猩硁黉骍净鹦鶄祊璎枨鹒瞪
柽抨伻璚潆砰鎗脝儜弸吰抢翃麖侦蛏裎喤鬡桁谹絣䪫怔蜻榜睁搒顷嫇珵掁䖟薨瀯浜浤哼趟輣宬罃牼澎箐焭泙渹鬇閛请䎕禜锽輷鐄嬛䳟鈜睘膨洺蟛栟藑媖䦕䃘䄇拧姘硡軯
狰晟巆浈䟫帲䲔夐䋫拼盯咣溁蝾鼱匉駍蠳觲锳鉎佂鶁狌竑眳諻宖䬝擏撜筬嚝碀䆖庼脭猄峸竀䟓浾珹霐䉚鑅䆵揁鴊醟韹䍔硼圊挣洴磞柠嫈篣娙耾恲謍虰鋐牚鄳瞏騯揘蘡汯
眐筕誙腈郕賏棦鲆啨炡瀴閍彋憉朾悙鸻奟橩濴聇䨎爃㹴㙃痭挰媜嵤䃷㼇䊒䁐䣐㥊姃劥葏䐵䥰朠泩渶摼邟蚲臤埩䨝稝䭢赹䔊䵞蓥㼩䆑鑍殸憌㽒䗈䫺娍麠䚘鶧㢬砊鑏䡠錋䴍
㱶㵬蟼䑉㿮橗琁䍵胻㚚嘭殅㛁㒌棾䊅胓䥋埂䝼妔莔鋞䄓䎴䴤萾㡕䇇荿㔙洐䄘䋊靗攍㶈棈箳㮄䊔絾䍬柍玶鑋俓埥呯㿘艵㹹䡩䇸䎽㧸儝䱢㝁㨕煐㓌樈雃䨉䑫椖㲂銵葝寊趽㤣
䞓㲆阷䯒嬫湦㧶嬣䈍婛㬹帡殌䫆礯䦫㺸菮㘇㷣㙚饓瑝聙梈羟汮輧䡰凔硑䨍䰃蝧㚾䲼㣜嗙伥錓䢚櫿碤鸉䆸揨褮㲰硻苼䪯䁎䕦鼆珄浭㰢垶烆㧍瓗䙖摚糽㢣""",
    1,
    23,
    11,
    23,
]

qk24 = [
    """青亭星经灵听冥庭醒形屏停扃零宁馨萍溟龄铭腥汀瓶泠刑廷萤坰棂翎霆丁铃苓荧舲婷型厅硎惺軿蓂泾瓴俜聆伶鸰玲陉蜓醽渟仃竮暝蛉钉邢咛螟铏町令莛
囹瞑鲭径鞓駉筳軨鯹箵玎篂輧荥蓱鼮娉拎猩羚濙綎聍酃蘦㹶嵉叮桯钘頩狑嵤昤骈订詅呤葶娙楟鉼爧䋼笭竛甹箳霝侀娗嫇蕶蝏坽姈䫤䖅䈂冂㣔跉藀瑆魿䁝絅鉎䴇睲圊疔帲
蛢狌駖鋞榠荓鄍砱䄙聤朎鵧帄䓑耵靪蛵柃鸋郬㓅㸳䤯㝕褮濴閝彾紷䉹㯪䡼閮艼㤯庁桱䌢䯕㡵巠銒鹷秢䣆䦺煋涄㽮㾉䤰䕘奵顈獜㼗帡㦭榳朾㯏䢛䯍耓㼛㩕坙㻂䗌蓥龗㭢䶄
猽㪮䱓䩠熲聠鏻䃏䆨孁邒䉁䉖䛣衑諪䚖嬣䅽鵛䙥澪呬郱䡿""",
    1,
    24,
    11,
    24,
]

vg25 = [
    """灯僧冰陵能登层凭升兴腾曾增朋藤憑澄蒸胜棱凝乘称绳憎仍徵应鹰膺蝇承嶒丞鹏肱崩矜兢昇塍罾渑镫譍绫惩恒鬙菱缯凌弘縢烝矰簦滕縆誊崚淩棚楞幐征
冯艿瞢礽㲪疼薨鼟豋輘症堋鄫磳淜鲮絙橧砯鞃儚脀搄掤譝僜憕殑陾夌䎖䡌漰噌芿蕄畻扔螣姮㥄碐薐䔲㭁掕穪䒱鬅睖騬竲冫辸䚮䕟䒏䧹氶䁬塴祾鰧䔖㱥㵗噔竳憴倗邆䙞儯
焺奟厷洆竑抍嬁漛䈊璔傰焩㞼耺敒䄧䕝譄䩑僌庱鞥溗䧙裬䳾㖫䲍䱭痭䉕栤錂仱㛵璒陹䡏㷥㺱䉄㐩䨜䠮䬋覴㴰䮪嵭熷鵿顭䱆膡䕨鹶鱦㔰驓㣒㔁㥤㮱蘉㜴䒐篜倰䗀踜婈苰膯
䇰""",
    1,
    25,
    11,
    25,
]

yz26 = [
    """秋流游头愁楼遊舟州留休忧浮收洲幽求侯丘悠谋牛裘酬钩鸥周由羞俦修稠投筹柔优眸不讴畴尤沟邱猷瓯囚缪搜虬脩旒雠遒刘陬油沤仇邮飕鸠辀犹楸侔啾抽
骝喉瘳矛讎球湫偷驺毬篌蝣猴锼飗榴篝貅篘疣耰酋咻牟髅斿区鍪邹庥裯诹璆否呦韝缑抔樛欧莸娄蒐鞲鹠彪蜉兜鯈繇麰帱勾逑嚘攸媮罘桴瘤槱輶飂糇裒遛售詶蟊刍鹙鞦泅
䲡馐艘镠鳅赒齁廋啁涪揉搂阄蛑绸浏褠髹揫蟉蹂窭叟觓抠偻句调䬟溲鍭愀鲰赇卣琉惆彄鞧絿崷蝼搊骰掊漱蝥浟丢枹滮麀侜罦懮勠䬒揄揪蒌馊菆掫嵝鱐救帿吺呕烰魗
㡚瞀蝤诌踌诪鸺鍮俅輖棷廔鞻㗋䨲䤹篓馏酘厹冘牏摎龟膢鱿翏萩醅㬋䜪瑈馗瞅盩犨艛逌飍瀌塸艽妯琈睺庮䋺㗀篍脙㱊銶硫泵赳耧篼妞鼽蓲泃慺醧梂鄹淲楢怞镏鯄銗
峳騪莤嵧䑼葇鍒鰽瑬㽕䏬緅鏉纋椆紑䗋羺䳼䞀艀㵞瀀苬䝏䙈淍䑦䚧噍軥㳅䊵穋腬䎿锫寠紬喽雺颩瓿蚰蝚鲦芣蚯㺅喌鯸芤鞣瘊髟鴾眍鸼怮堥恈骺蛷叴鎏哞鏂鲉獀頄秞
骉怄吥鉜緰沋蟗䫫鷜葔媃薵枸鄋撨鞪蒥裗藰鮂朹鰡蟱菗侸䳕摗鶔黀剹遱㘥鷔疁犰莍㳺溇渞瞗剾婤嬼㴗趥㖼臹㥑䤛䱸櫹㥢箁郮㾋銂䒜䝗䬌䎧䉩䆶䫛跾犙趜䏫嚋瞜䰆㻲
筄燽坄䱕㕤紌嬦䑻䌧㟈㹯霌䖻䦾㛩褛㝹糔㷕渘鄇肍䩳䚃䁱翵哹鴀岣䵸㟊㮲䬲箃蟭慒䕱瞍湭㫍䮟䟵醔㘜鱃䰍䉧䗏䲖雔汼㾞熰恘㐀訄钆殏䗔㳋㸨䲥䂉駀磂㖄䥐䉱剻䡭䄛
樇劺䨗㩅㿧䰘㺫䮫鋀鰇㧨玌䡂烐䎇㿡鄾傮涑㤑㱗䣇鑐珘䗜垺䲫熮䋷䈭瞴徟騥媝㓱䧓釚蓃䨂㚱浗㛏鰸㭝矪蓨麍㖻棸敄郖薷䝀鯦匬䢟㘳唒挎㛜㤹蛔剅圳栦櫙袧䐐眗蓅䱖
烌㤧㨮盚訅㒡亠捒脜煪姇牞揂䐰皗抭妋䯽櫾㡞㚭䓟䱾熡鎀膒朻萮銝䖥䍌鏅㧃䌔㕱䰗㳜偤䀺齺㞗㐜㽥䐓抌䧱㭌㻓騆㽛䠓齱扏粰媹絒䐹䢊泑""",
    1,
    26,
    12,
    26,
]

qb27 = [
    """心深林阴吟音寻金琴今襟侵临岑沉沈禽簪斟禁森霖任浔钦砧衾淫箴骎针衿参琳忱愔瘖涔嵚擒歆谌琛崟唫淋鬵壬喑黔蟫霪南蔘㴱镡祲纴湛燖荫芩椮檎鲟郴
妊灊霃鵀椹煁蟳綅嵾㑴曑紟肣芯廞噙渗䘳罧棽襂綝梣愖痳䤃靲䰼撍䑣闇澿䔷㕋嬜㞥䤁䪩噷黅惏鍖鄩碄嶜㠁䃡攳汵崊蚙莐桪銋箖穇耹訦䛘鈂菳忴㽸烎鈙䣾枔櫼䕾䥅幓䒞䫐
䚾㾣埁㸒鑫橬㞤笒㕴㕂瓭㦗䅾襑䜾璕玪諃瀶誛㩒蠄橝㚞䦦䋕瘎㜦荶㓎埐䋮㻸䨧鈝甧黚摿惍㝝䥆䍼㪸䃢㪛鈊扲韾穼葴䋻鮼䜷兓乑㜄鱵㖗䨙鳹庈杺䤟魫鷣""",
    1,
    27,
    13,
    27,
]

tj28 = [
    """南谈三酣堪潭甘庵参岚惭蓝探骖谙龛蚕含贪男涵毵簪耽昙函柑覃憨楠篮鬖谭担聃戡眈惔甔湛篸婪驔諵儋蟫镡醰馣韽蚶盦坛泔嵁痰锬郯鹌壜喑弇
䳺錾褴谽䤴邯媅坍燂甝渰酖媕颔坩藫鐕餤唅䣻傪苷㟏罈澹䆱蜬舑㽎欦啽倓䰐馠闇疳腤啉䟃莮浛䈄䑙㘱㴂厂䊻蘫筨歛淦憛惏荨臜䐶噡痷裺儖佄埮肣喒笒嵅礛䉡韾
䥁䆾謲㼨撍汵䵇婒暔姏㞩弎鋡䇞䗞䗝䎏懢萻橝畘媣葻㽑㵅䨄㳩瞫玵璼㤌醈顃㰫㷋㑣颌䨬䅖欿㽍䜙㶰䳻㜞鳹聸㘛䫮䶃犙鄵炶瓭頕㚮梒緂䘶㛺厽㨻儑㓓灆嘾嬠㖤雸
䜖䌠㴷㓧腩䣟撖愖萳娢晗㰫㤷""",
    1,
    28,
    14,
    28,
]

yj29 = [
    """帘檐簾添尖簷纤兼严盐嫌廉沾髯炎甜潜淹瞻霑拈蟾签占奁恬厌籤缣黏阎谦钳砭镰歼铦觇忺黔粘钤襜詹渐餍恹鲇暹鹣佥幨蒹苫噞痁憸崦挦簽熸燖阉櫩腌
阽鬑谵湉蔪蚺濂蔹鬵磏灊奄瀸爓惉枮佔䬯綅针楠杴襳餂裣䫇孅呥馦舚椠鳒锓笘蠊袩譣酟䪜掂詀锨韱櫼㡘棎薕劆䆎䛁彡噡稴鑯臁憛嵰蛅燂薝讝搛㲯䑎敁
螹菾䕭扲岒鐱壛熑黇胋㿌煘䊱黚䦓玪殗㿕覝䁠㶄㦰撍婖㡨忴耹㾾諚秥瘎慊虃硽闫肷㰊偣䘋嬐䆂螊䅧幓㤿䉷䯹槏閚㺤㶣讇㬲鋑溓檶䯭䋬䈤鋓䵌厃㷿碱㼓
㝺衻仱冿蚙㽐嬚䘂鳹顃妗䏦誗钐㔐嶦䑚""",
    1,
    29,
    14,
    29,
]

xm30 = [
    """岩衫帆衔凡缄咸杉函喃芟馋谗鹹监嵌巉镵劖諴严掺搀嵓椷攕毚瑊欃碞縿髟諵羬黬衘杴鹐儳崭崡詀獑嚵礛䜛杋氾䉷黯沨彡嘇㩥穇幓螊淊㰹艬站锨櫼尴柉
㺥輱厱㔋鳒譀䑺玪溓葴䲗㢛䕔㘅㛾鰔㮭㴀䟰趈䒦舤揞麣覱酁肷䫡䂁㘙䧯䪌䖗䭵鏩礹㔆甉䀐䤫䩇稴钐䩂䶨䶠""",
    1,
    30,
    14,
    30,
]

ds31 = [
    """孔董总笼蠓滃懂动菶桶蓊澒琫幪拢塕唪垌嵷洞挏侗硐汞空纵偬曚蕫竉懵捅埲暡莑墥䩬䉥愡统諌蝀巃懜唝儱翪眮聬揔晎倥嵡瞈檧㹅憁勜悾詷㨂琣䡁㶹槦
龓䞒姛玤㳆㬴銾庬㖦熢愩䋽㷯㢔㷓㴳嬞䳞棇鸗鬷㛚漨䵔苁㣚嗡䐥㪌䵜繱䀧徿郺箽鹲䂢勭䭰""",
    2,
    -1,
    -1,
    31,
]

ds32 = [
    """宠冢涌勇拥耸陇垄拱踵汹捧冗竦壅肿踊悚种重巩俑恐栱蛹茸氄珙奉甬恿尰拲䢇溶覂蛬愯嵷詾湩恟傱駷蛩䢆軵㩳輁䂬鲖跫怂悀䱋㤨淎䙕埇搑硧苁躘臃坈
嵱漎塎埫㷏䩸䞻捒㣫衶㨣搈㧬㕳媑喠傇䘴㦶㺬愑鰫縙㦷㲝㤟傛䢇㓋䟪筩㙙㡖煄㭟穁彮""",
    2,
    -2,
    -1,
    32,
]

jl33 = ["""讲港项蚌缿耩棒傋玤控䎧夯棓硥漎顜䐟稖䬕䰷慃㭋䂜䁰庬䖫勜""", 2, -3, -2, 33]

vi34 = [
    """水子起士此里死耳喜理美矣市是史尔止己李紫指纸齿履已纪旨氏绮裏始垒蕊视耻蚁祀拟恃髓轨滓靡鲤驶矢毁峙比鄙趾迩仕徙委梓以涘雉彼屣豕似芷址
几咫砥晷巳俟诡倚沚妓侈婢杞圮徵兕祉姊弛企耜使旎觜弭汜豸泚玺鬼珥逦箠舣枳诔跪揆戺嘴秕否苡匕燬你迤簋畤揣姒俚唯痏癸藟累薿駬裡屺只褫宄技
蓰被阯柿耔瀡訾匦芑洧蘤薾鲔跽痞捶笫舐妣骳枲庋跬廌纚柅饵髀抵厎麂崺屎棰掎儗酾嶬巂萎痔椅酏嚭秭仔敉庀㠖諟机跱扆籽苢疻胏跂弥偫俾骫锜峞橤
葸樏蔿庤壝黹蟢踦佹轵娌芈啚礒玼漇舓氐攺蹝縰憙頍渼坻庳躧傀跐垝旖骪佌佁氿秠鞞崣葈歭狔哆俿匜咪洱啙杝您繠姼岿趡栮庪傂骩梩坁恀胣嶉騃㵦哩
呰齮扺剞把沵鸓憘仳吇伲毇䠑峛薳讄恑菙抳朹㧗䗁䚹秄褆馜㧡蟡䃾㱟㚶枾渳娰㸵噽䃣㣥㞦垑㢋䉂唏锌吡阤姽鞁魮孴硊甤輢悝㠯羠疕虸矖孊諰檷崥柀瀢
貏䓈寪厽滍觤蓶杍蘬湀雟嬟灖攱拸坭䝐婍䔺洔㢮諀聻㸻沝枇灅䐯懝㭒㠲䚞䂡䭲沇䍯䘡䞨䳅䘣㠱葞㜫瀰藢㥨秲㜽鈘䟖鈶䤥煃䍴䘦䛶㹬䴎皉嶰㲛峐䢄嶏䄎
奀䋙㔳沘䣀蚔䅩泤㹝㲹㷐諈虆䦻㕜䣥娝惿䊼徥䭉㪜噿䚦䇃㷃㞔䛼釨佊矷砋䢎攦峲㞛䃽䇛譩㡶羛䚟惢欼朼㿂敼䉝逘㚡㧪狧菧㾅瓕䒨䎣㞨妀畾洈鉃杫厬㥴
搋䟗鴲䊓䏢䢳㚓釲㨊䦵鉂撱䤚蛫芛劧铈椯笖弬㖐芔檓訨㰝䰙䝰䤏䧉鉹䵋猚臎㸚裿㶴䂠抧䛏芓䭧㫊儰璻袳䤆㠧㫑孈吱䒻抁嵄濢唩䠋聛䛗踓愢㓼噧飺祪㩓
㺭䈧暿誃㞆铌䏡䔂盀㙼鄬崼徛㕽腂邔鈻㱀䧧䧽淽袲卶㾖""",
    2,
    -4,
    -3,
    34,
]

ww35 = [
    """尾卉伟苇亹篚虺斐炜娓韪韡鬼玮悱几菲岂匪顗棐蚁豨朏榧虮蟣扆诽偯颹浘䔇唏霼蜚蜰䤵蘬魕餥㥱㕈䕁庡愇㬙梶泋膹韑䒈媁椲䞔荱䇻㹃㠕鍏喡㞑䪘䅏䬿
陫蕜徫䍷奜""",
    2,
    -5,
    -3,
    35,
]

yu36 = [
    """许侣渚举暑所汝阻绪旅处序黍鼠语伫雨屿俎墅煮杵炬吕杼醑去贮拒禦龉纻叙楮女苧础溆与距楚籞膂予圉筥巨钜圄弆褚簴抒莒糈苎咀羜鱮湑梠苣宁虡峿
籹駏芧敔谞耟秬篽沮癙茹跙稆怇濋岨讵稰著柜纾榉蚷铻岠衙蓹鼁苴歫泞作龃儢眝潻䶙詝㦛汿憷䰞欤鐻齼詓椇藇洰魣粔郘㐨㞰絽䢹䇡豦楀紶鮔㛎㾔㲾䍆
㜿㷂㘧壴昛䔓鉏麮柠铷盨坾㭚眍疋㪽肗㿾挔䠂䦽䘢䝪䙘䘘䥏㒜諿䃊螶姖袓垿㵰㤖胠""",
    2,
    -6,
    -4,
    36,
]

yu37 = [
    """古土主舞户府虎鼓浦宇取羽武补吐父缕午五谱母睹雨坞乳苦斧鲁伍祖数堵杜甫虏辅组橹麈鹉侮腑妩弩腐釜浒抚矩股竖禹簿庑否俯脯拄愈罟卤圃姥普莽
扈庾诩蛊聚肚瞽贾溥树祜部偻栩怒窭踽怙拊赌下窳柱诂估努盬岵亩膴怃牯黼稌㝢羖貐甒瑀煦伛簠㺄掳粗喣楛琥酤沪龋褛剖仵寠瘉頫拇俣炷咻嵝醹荰珷
弣俛砮麌鄠冔珇簄瘐昈謱鳸癒旿撸牡滏斞祤㼌莆籔邬裋珝雇篓枸垭噳砫橆帍楰暏氇薣瑦斔妈䲧瞴鐪槴㦿嵀宔寙䛩㑯嵨蒌䥈䩉萀帾䇢娄噜蒟钴呒捬偊蛡
靻郙椇潕竘蔰䀇蜅萭硵罜蚥頨蝺婟跓䣁㔪烳倵䒉溩㕆麆䋨䀯慺抌楀墲㒇峔㔱鷜暊丶㬳躌䨒陚熩貗䭸㲾㙛䀾㢚玝樦芐㨭鯆㑄弖䅡蓾䨞鄅竬芏㒁䌗㕮熓䟼
䶚剫㵲敄㡰譕䔃䲐靯殕䪔焸滹聥秿琽䁈㵭䗂蔖䯙䇠潽棝萮䥘䡧㙑䝂䄔䃖䧁觰䅓洿㾈誧匬鰸㐅䗄""",
    2,
    -7,
    -4,
    37,
]

ji38 = [
    """底礼体米启洗陛醴邸蠡荠悌眯盻诋祢棨弟抵觝澧泚癠济牴鲚㡳涕柢递鳢鮆綮徯髀齐苨醍軧䏶謑鲡玼蔝晲洣聜泥缇坻欐啙骶沵梐䏿䭬掜泲䱊菧挮㭽䍤䑯
鑙㪆㒅䫌卟䪆蜌眫䢑䋜袳弤䰦璾㼵䋛遆䌡䕥㪏㙄瀰阺盠呇匸趆㝥肶媞䯗蒵娣抳觬㯇鑈欚隬悂奃䡔晵劙""",
    2,
    -8,
    -3,
    38,
]

xp39 = [
    """买骇蟹解楷澥洒矮摆奶罢獬妳駴騃锴拐捭罫㡁夥躧嶰柺廌薢矲矖觟荬徥檞䇑㙰疓抧箉襰䍉鉙㢊㧳攋䉏簤娾豥㔥㗗䲒猈嘪䒓㵋犤鷶㚷""",
    2,
    -9,
    -5,
    39,
]

hv40_1 = [
    """在海改待彩宰载倍䌽乃亥凯采茝醢殆垲铠绐寀恺怠颏迨蓓鼐骀闿欸䈚睬䰂诒歹岂䏁崽颽毐唻踩輆酼軩箈婇䂾忋暟䣋疓㴓溾㤳䇋絠䆀䁗埰㱰䮨㘆烸嵦㥒䈢
䑂""",
    2,
    -10,
    -5,
    40,
]

hv40_2 = [
    """罪馁蕾磊汇琲浼悔磈儡贿隗每猥腿璀皠嵬瘣㠑磥頠㠥漼櫑鮾礧癗嵔㞂腇廆礨錞䃬碨喂嶊黣㱣俀褽蛔僓傀腲鏙鍡挴㟎鑘鑸聉灅洡頧詴烠䇏䏨俖㒦䜸琣㚍
㱬槯娞殨嶵䊫㼍回潣㒑喛浽㾼䫭䕇䫥檌㨃顝頛痱燘䲎㼏㵏䔒㵽鯦湏陮㱱㷄
""",
    2,
    -10,
    -3,
    40,
]

vf41 = [
    """尽笋忍紧尹泯轸哂窘陨敏隼准蜃悯畛菌蚓牝殒允蠢闵引肾靷鬒霣膑稹疹眹狁诊惷盾箘纼脤吮嶙楯辴囷缜朕黾簨眕矧稛辚胗埻僯紾僶纯舛慜僒鳘弞䀆潣
撛芛㰮暋赈榫湣抎缱袗濜偆黰獜嚍鶽抮螼荵吲綧蠠麎笉髌駗㔼萶玧荺㣼囟䟨簢埨䐏嬧莙刡㖺濜䊶馻䲄㦏䝩㨚䑐槙㬆濥渳鈗婜敐鯅㾙鶣蔨䪳疄鎨䒡㯸㩈
廴䐔鈏棞敃箺䨶愪蜠睶䇖㽙䇙揗㖥亃㐱㥸沇姫喗㿤頣頵䪾䮞傊橉鵘䦮屒昣聄鋠耣弫䂦阭裖䀕䐃䂧""",
    2,
    -11,
    -6,
    41,
]

wf42 = [
    """粉愤谨吻蕴槿忿殷韫恽卺近隐抆听刎坋缊瘾揾坟抿嶾弅菫讔䘆黺䌥㻒瑾抎攈磤蘟龀檃膹呡凕秎齳歾䠴赾魵漌愪夽熉縕喗㥹㹏䤺㦩䞫賱㗃勽䨸䆬䌍伆蚡""",
    2,
    -12,
    -6,
    42,
]

rr43_1 = [
    """晚暖返苑蹇挽坂偃绻阮远饭婉阪反幰宛娩巘畹㬉琬烜踠蜿堰揵鼹楗键蝘鶠菀晼缓圈夘咺鰋躽沅寋䜝㽜虇匽皖箢軬鄢妴夗愝朊㫃䎡鲩鋺攇倇媗邧睕脕䳃
䪭䊎褗㿸䅚鰎梚䩊桳㔓搟奆䞁梡㨴傿䘼愃喛綩䑱瓪䤷湕橎嬎錪䡊䅋葂䮿䜢犿盶㱧薳䛀䛷""",
    2,
    -13,
    -7,
    43,
]

rr43_2 = [
    """稳本损衮沌混阃悃滚恳垦忖壸遁畚蓘浑梱鲧狠笨䔿噂很辊刌焜捆撙鳟棍趸盾暪吨噸獖硱掍稛䐣龈㯻坉䫟苯绲裍豤僔緷庉詪倱腞潡碖伅氽䃂逇峎㵍喗㝧
翸桳眃菎齳㡷稐壿丨㖔䬱䓳翉䅙䜇䛰觨䵯㮥惃睴婫䚠睔㙥黗䙛䅰㤓䠅锟崸呠㨧棞䁚桽泍䧰""",
    2,
    -13,
    -6,
    43,
]

hj44 = [
    """满短馆管懒缓旱碗款煖诞罕坦伞纂琯瓒断懑袒窾侃筦散疃卵嬗伴浣但缵亶蜑秆算蛋痯盥趱潬笴赶瘅悍馓䍐暵疸篹脘䂎厂䟎輨蔊匴簳䬳䓍衎柦䠪焌悹惮
焊擀錧痪奤梡坢皯拌䩥輐㫁埦潵瓪狚酇芉刐㼝粄䕀浫䛞糷䝹䪀䲌繟藧繵忄䞡靼鏋㼫㣪䩪䏓䦎唌鏾衦睕灡禶玬璮棵跘䉈皽㫜䦔駳捖皔䵟嵈攋觛䗆䉽㦨䘾
㪔裋鉡穳䄤䌣秚㬊㦌綄""",
    2,
    -14,
    -7,
    44,
]

uj45 = [
    """眼简限盏产板版撰赧拣莞睆柬嵼浐潸僩刬丳睅蝂栈绾铲輚矕戁僝钣昄眅䎒撊轏䱠㟞闆拃骣摌嶘瓪唍舨㦃䦘㸧鋎羼橌㹌睌硍魬㯆碊捾㡾晘㫱㹽皖䴼䐮䁂
攌暕娨簅鲩䩆""",
    2,
    -15,
    -7,
    45,
]

xm46 = [
    """浅辨展典软剪免犬显篆巘辇藓茧衍冕捲勉践翦辩卷泫喘缅转脔岘鲜扁善燹遣阐演铉腆蒇殄选琏腼湎沔撚舛荈褊畎蹇笕謇狝艑谳跣鳝戬搴辫墠癣兖蚬匾
宴件睍冁缱涊饯娈俛眄铣瑑韅栈键隽贙洗钱趼蜓吮鳣撰谫揃单毨狷耎甗齴觍㥏勔蟺丏鞬挽辗燀筅襺晛僎䱇嵃碥愞愐沴㾌㜻蠕剸楗淟戭墡羂㬎垷鬋蹍惼
黾谝偭沇琄碝蟮幝緛鋧鞙圳攓㩃䠄刬趁铲踹嫣蜎檽俴詃諓緶揙橪鴘錪輲竱媆瀽臔齞痶菤鮸臇灦蜸呟賟譂囝枧䡢腨磰橏啴摙繟堟姺僤榐藊蕇搌晪䵤䆓㨠
膞貵㥝禒㭠㮒㧋䤄㠭寋抮覵䩅莬瑐蹨芇咞哯僐㷷簐誢脟䥀㛯椼縳㦓㶍萒僆䮿㸁唺䗾馻謰鄟䓴䙇喕鶣㔵糄渷㓴孨䐌鄻睓襈㮟㧥䭤㵷豍琠蔩鱄䅐㦚䛇顈㱛
跈鍌䞂㢧悿㹂䧠詪䉸烍㙉歂䄯㣤㨵藆媔矏䀎㞡潣豣䵡矊遃㔊抁膦䍾缳牑㨺䚚䢾䱼㒄䵐䥪鍽娊㕣䓣埍䧘䏹㜊圢椫䩙婰渳皽䧋䧖䁴䁵熯弿覑㲢䗺䡱帴䓦挸
躎䎒奵梿""",
    2,
    -16,
    -7,
    46,
]

xn47 = [
    """鸟了晓小表杳渺杪扰袅少沼兆窕皎缈矫赵筱眇褭绕窈绍窅淼旐悄蓼朓嫋肇醥皦皛藐殍瞭缭嬲秒缥剿溔夭标麨愀挢掉挑摽㟽蹻莩湫燎窱缴鷕謏䙚㵿昭褾
佋佻娆僚䑠鳔剽娇舀㒟晀璬吵蟜眑膘䂪垗錶鲦麃钌鱎劋䘨㵘䍮㨄䯚㝔瞟訬嫽憭騕婹偠駣枖婊屌敫苭闄宨袑譑抭䚩誂檦髜㹓㫐皫䄪㡽祒篎篻嫍岆㝋釥賋
柖㪕䒚䃵㣿巐諘鸄㹾絩煍䩍䂽扚㜵䄦䆞肁宎鴢㵱丿鄝䒕尞崾鮡芺䦊萩镽眧䙼䏚敿蔈藠鼼㭂仸㹛㴭仯隢䁏楢柼璙㟱鐈㠡䥵䈃㡑䥞朻菬㩰䔸㫏顠蓔狣榚藨
䉆""",
    2,
    -17,
    -8,
    47,
]

yc48 = [
    """饱爪卯鲍搅啮挠狡昴泖咬姣绞佼炒煼巧铰瑵茆找筊拗媌孢鞄吵骲㶤䎐䲾㺐虠㕚㚽䕧䶧㥮㩭狕䝖笷㑃㚹怉䝤頝櫹䀊鴢灚臫烄焣緢泶橚挍㑤㑿捁㽱㚣""",
    2,
    -18,
    -8,
    48,
]

hc49 = [
    """老草早扫抱道岛好宝藻保恼槁讨考浩稿稻昊潦枣皓祷倒蚤捣脑缟杲葆燥藁媪堡皂造嫂褓袄皞镐颢瑙澡埽涝灏懆夭栳鸨橑璅薧媢缫纛懊恅栲碯拷璪燠烤
缲㛴狫䕩袌暤轑䴠䝤䎂佬駣愺䆃蝹滈鄗蓩套皃㿒夰嫐捯薃芺菒荖筶堢镺鰝壔禂䯠祮㺁皫㑎㤇䒃㛮㧇淏賲絩悎䳓槄丂傐糔䯫㵆䮻譅䲃䯪鴁䗢䵚椺㚼忑䵏
恏䴈䧚㚖駂㬶簝怉㻄鷎㙅郩勽㼥窎鮡㾸檺峼聕屮䴐憹䳰䖣狣菿咾劋祰洘䇭梍㧯㨶䳈""",
    2,
    -19,
    -8,
    49,
]

ge50 = [
    """我火可果堕锁墮祸朵裹颗琐舸妥娜坐左坷亸荷么裸柁颇砢跛夥笴舵瑳惰垛蠃躲簸沱鬌蓏柂椭叵堁轲輠那峨脞沲哿播騀陊硪哆瘅㦬佐娑拖傩埵蜾㰤髁婐
閜卵揣嶞媠惈䴹駊伙猓爸阿㝾爹嬷棵瘰㛂懡䅜碋婀㝿㰐䑨䂺蚁墯跺笸岢婑鎯唢粿捰馃缍䰀鵎䰈毑涐㰁䩔攭崜攞㡅灬㥩㱻褍邩锞袲挆隓毻誐䯬陏䈗㚌㶡
䵀綶㪼锗頋䂳㞹稞葰尛扡䲊撱㪃䙨痑鲄㰙硰䒳褨㙐鐹炣䤻㻔䫂㧴㯐䌱淉砈㛆誃橠袳娿钶敤睉䐝㦱溑縒抲剆椤曪䣔暛椯她䩋䙤挜䠤㩡彵惢""",
    2,
    -20,
    -9,
    50,
]

ma51 = [
    """者马野社写洒也雅瓦下寡冶舍把捨赭假泻惹灺斝夏哑且槚打嘏鲊踝若厦苴贾扯姐耍奼銙剐庌閜哆輠瘕䰩码髁傻壄叚厊疋玛喏奲跒䱹痄婽飷㗿椵蚂乜邷
忚毑苲厏藞藛挜䄕㿿蹃䑝稞蕥鰢搲䈑䪵㙒蘳耹腂抯䟩黊㼘顝訯㐄漜䋀吔雫謯㕐㵔㡸楇䬷鷌偖锞溤䊬粿䋾騇㨋鲝她䥱䠚䵦觟襾""",
    2,
    -21,
    -10,
    51,
]

yh52 = [
    """赏往响想象丈荡爽网掌壤像莽朗上桨党幌敞长鞅仰享广枉奖养恍氅两惘漭仿痒曩罔飨俩怏苍脏颡杖晃魉榜攘倣坱蚃强盎昉放沆傥帑蒋瀁仗慷橡穰蟒谠
向晌襁瀼纺镪簜彊厂昶辆緉辋驵泱魍滉抢鲞吭誷䣊嚮榥磢髣奘倘迋蜽愰档懩磉犷彷惝駚忼谎嗓厈曭㬻慌㟿潒旊瓬愓䁳鋹嚷肮塽瓽灢㟐䋄㫤氧躺爣欓搡
襐矘蒡蝄璗漺灙仉䡦扙榔佒傸墏㬒䖹扄逛诓垧攮饟傢瀇酐抰菵岟黋柍儣氆䒽裲掚咉膙蟓茻弜犺懭䠀䒍覫䬬爌䴂㔝䫙騯䴚縔㯍紻䟘㟠䡉䖮㗽懬躟姎䑗嶑
欀鱌䉃䒂鶭䗮詤魧褬邝臦宺蔃銺䑆皝奛㕫䫪㔦烺㫰㴏䇦䖆㼒誏慡㶞曏眪婸汻爙䒎䍩炴攁䭺脼雵軮忹鎤詇櫎㓪鐌䢍偒謽俍㿩䔪㽴㢡㒳㤺䲱䠃㑂嵣鞝㒉崵
蚢樉壾䑋勨誩䒋樃熿俇瞊滰臩㳹蠰驡䁜㛨䥒""",
    2,
    -22,
    -2,
    52,
]

gg53 = [
    """影静冷景境岭永井省幸顷领警梗整耿骋饼颖猛屏杏靖颈绠炳阱逞颍瘿秉倖郢荇请矿艋鲠哽眚黾丙怲并囧烱冏冥皿箵靓蜢璟犷憬悻箐㾪打檠邴埂䴵浻裎
袊懭蛃梬渻煚痉竫悜挭䚇奣峺暻苪䵃倖睁穬狰勐睈庰瓾鯭浧蟼苘澋憼掟㑟㹙䗒柠䭊㝭㗂炅䋑㾘眳莄㲟䭗㼬郠炴㬌䭘胻摼寎㓏柃䩶璥䚆廮箳䑍氶栐䓷帡
鉼䁞䋁鈵䁄㴄浜鱦臦䊯㩩擤鄳侱旲帲朾䜘㓑䯧㼳㮐㨀㣏鼆窉皏眪䂔陃擏䁅鮩睛睲塣晸㯳撔誁鋞㢍幜偗庼㹚彾徎""",
    2,
    -23,
    -11,
    53,
]

js54 = [
    """迥顶鼎艇茗等酊炯肯挺醒涬町拯梃謦铤褧泂并溟絅惺颎熲艼刭脡侹莛珽酩嵿胫颋冂泞婞濙矃冼奵诇订佲㽪夐烃笭鞞炅圢榠涏䔛眳濎巊娗嫇汫㱡耵㷫苘
庱㫀矨姳㫥㟰鋞䗿庼䅍煛巠烶鑏顈侱閮誔㷡瀴䦐㴿徎㯋緈踜漀朾靪䵺鑋蓥誙䳙""",
    2,
    -24,
    -11,
    54,
]

yz55 = [
    """酒后後手久有柳友口寿厚首叟朽负九牖偶亩右否丑走斗醜狗守绶薮垢阜肘帚剖咎吼臼藕酉缶受韭取玖苟母纽耦妇某诱纠舅塿莠耇黝瓿蚪陡牡擞笱不浏
杻揉嵝蔀罶扣呕嗾蹂钮卣忸叩赳狃纣掊糗授蟉莽桕槱绺趣部糺滫瞍抖篓黈拇釦㪷棷殴醙甊掫䳇㝅欧糅籔扭灸琇枓懰羑郈茩垕眑庮紏篰茆魗娄蚴苃麔䬀
䭭禸喁溲佑鲰楺劶妵溇䏂培枸萯搝䈙㸸玽䳑偩橾㱙㪹㰶䅎岰䪮钭鋀犼涭䛮䊆铆蚼艏懮睭岣鯞塸栯腢缹櫢峊蜏蝜餢踇蛗砪勏飳糔齱䶇㕗厶䕆嬼㫶㕛䞜珋
㽲媀㓡䬏㶭㺃䱂炄㞫鲖箁熮䒴㷆奺䳝䏽煣荮泑䴺鴀殕吋龓䏔啂鯦齨䎻䚵棸雬䖞杽妞紤紑煪羐媨倃犃沑聈㼴吜喽莥垺䳎疛䈹婄綇侴㥉璹朻㰴㺲㝊䅹㞳楢
舏㔚㨐㺵㥅㪗㧕蘣䱏㔽牳䘀斢䂇湡湵吘藰㒖""",
    2,
    -25,
    -12,
    55,
]

qb56 = [
    """甚锦品寝稔凛廪审饮枕禀衽噤谂沈懔饪恁葚荏蕈淰锓瀋朕踸椹碜㾕凚怎檩墋腍婶伈㾛䪴唫䭃瘆瞫㶒䫈訦菻顲㰂魫梫趻菍覾銋㱃䄒㶵趛棯䇮䫬䫴鰧㝲䫖
㴨㱈㔤㨆贂抌㮳䚓拰栚謲秹䭙㐭橝闇昑㯢栣箖嬐㜤㤛""",
    2,
    -26,
    -13,
    56,
]

gj57 = [
    """感胆览惨敢萏揽坎颔糁撼毯壈菼黮榄窞紞匼髧黕黪憯歜啖餤欿禫澹嵌椮淡掩嗿闇贉罱椠菡霮䃭轗顉醰耽砍黭醓馣寁䉞喊憺赣錾澉傪㯺㩜燣惂晻橄莟䫩
颌䫲輡鳡㨔䃫㙳埳唵忐黵揞昝竷歁黬啿腩醂湳䈒䖔顑朁饏鏒豃揝爦䊤㞄腤幓䓿坅㰖䤗轁䏙㲜参瓭蜭㜗罯襑篢顲䭛薝䊏䆦㟛㽢㸝浨莐喒揇澸抌臽㜝錎㛧
䎨䭕䊖惏䊉䨢肣澰馾倓㛦醈衴撍㣅暔㺂㧲㕪嘾漤鰔
""",
    2,
    -27,
    -14,
    57,
]

jm58 = [
    """险点染敛簟忝冉俭检脸歉燄闪苒玷琰渐崦贬飐剡崄芡陕潋俨谄掩慊捡睒嗛罨广㶑魇猃黡隒磹渰扂奄檿㴸厣埯弇覢睑讇椠晻䀹舔蔹顩扊晱䎃蒧噞黵薟譣
棪肷驔溓鏩黬鼸䲓螹曮䎦䣸䭑䤔㢂䇜稴㤁硽䒣馣媣㱘澰礆䌪㭺䄋珃㓠㚧㐁嬐羷䣍裺䄼㰈䤡䭠䍄疺嬚㯬㨛龑婖孍㚩䟋彡䌞呥㪎鍩䠾悿㶘夵礆㚒橝咁鍩""",
    2,
    -28,
    -14,
    58,
]

jm59 = [
    """减槛范黯範犯舰斩掺湛黤淰轞豏瀺巉錽軓㺑崭㺌阚甉旵滥碱歉闇鹻喊豃趻溓壏懢㺝撖凵钒㧄䤘㴴㺖偡魙瘎黬鰔啿払槏醦""",
    2,
    -29,
    -14,
    59,
]

ss60 = [
    """梦凤洞送弄冻痛众瓮仲贡栋恸鞚讽中哢动鬨控閧粽霿㝱哄衷空峒羾砻恫偬凇同瞢赗蝀蕻湩涷㔶赣齆汞铳㚇戙倊㑋胴衕緵絧懜咔迵唝懵㢅㓊翪憁蚛洚駧
眮霘詷烔菄惣胨茽愡㑝䏵蘣㼯倲㞲䇨㗢䠢㲴䛪筗䠻愩䍟齈妕崠癑棇梇㳥㮸謥㖆㜴揔焨槰煈堹䔈趥祌娻霥姛繷㐺㸜焪㯯硦㧤""",
    3,
    -1,
    -1,
    60,
]

ss61 = [
    """用共颂诵宋供从统讼俸缝综葑重种雍纵封恐憃奉雺疭䃔壅捀灉㙲躘徿揰偅緟苚謥湗㴩䝋褈錝䛦㮔縙贚碂緃龏㡝昮諥澭""",
    3,
    -2,
    -1,
    61,
]

jl62 = ["""巷降戆绛撞虹鬨幢淙洚䎫憧憃肨艟漴袶䢽㟟䡴㦼䣈䚎炐㕩""", 3, -3, -2, 62]

vi63 = [
    """事地意醉至泪字志寺异翠寐思义睡寄吏记致器利戏弃坠媚骑二避愧悴瑞议位试类置赐次遂秘备臂辔智忌吹四易骥饵谊治翅侍值季腻肆邃鼻瘁閟笥穗自
祟嗣稚祕魅伪嗜炽帜示泗馈萃驷匮粹庇喟冀悸燧渍踬恣里誌刺施芰累贰屃帔隧畀挚彗谥为伎懿鸷遗厕伺识贽譬詈视帅轾惴裏使緻觊迟被胾瞆恚莅饲肄
豉贲勚啻似觯痹莉穟知积寘莳诿出比已鞴始怼食几植劓䆳赑芘洎篑毖糒诐骴泌牸倚质企缒屣奰忮惎陂技弑织穊跂襚眙暨缢裡翆璲膇德眦俐饎澻司跸痢
胔佽僿痣蒉廙樻孳近晒屁髲饐攰繸珥睢谇咡懫嚱憙锤痿鐀硾柲禭其萎瑟率毦岿塈笓疐懥瓃旞埴畁铒肂觗㩻㒃敡垍蚑翨儗澌掎庳欬睟檖咥樲倳剚懻柶甀
术呬糦坒駤儩騩尯蘱柴㘩帺刵䇐鵋侐螠㨖扻槌喂唏哩貤蜼洱諈杘鷾鬾蝞皕衈鍦髶鞼瀡蛓謘庛䉋亄邲嚊嘳錗峜蔧杫槜呮揓螆絘滍㽈痓貱袣鯚蔇攱螅猤謉
騺㩼諅鄪贀䋘燱㨁㞖䲀怶潪韢孖跮徛䓽㒸夡徝㸢䁛㧘㢀㳵潩䬥䕌痵嬟覟䏯䪐䙡瀃牭嬘垝㻽䰡穖䯣䏤筫珕吱䢋硊㣇㴚邔絥賥訵䎶䭄䘭囟䨳芖㯜䄁㢻䆈䰎
醀枈㙺檍㻑梞睸轛袘娡㥍胒䉜恎鞁聭㸂㐸㥞䝸鷧䐉㵨鑆眭䜐䳐娷鐾腃洷㑧㴃㿷䥙䔹犕臎䞈鶅䣦㽷䔬䗽羛㱲輢饖㾽煝誀纗楴沶婎䰨㱖䫁䗹㳏䏪㒾㰣䛈㿫
㣁憄䰯䉌㹑㢰㛅䜵妼濢䠦㸍祱瞡䦯䎵㮹䦙䕗唭蟌䠔㤦佊螝藣卶䑄嚜㦐㴛䅆酨馶稩欭㦤洓汥㱁䀣㢽䣵佴鴲㓨聏䓌瓗诒誃腄䄲肶茡䠏䜜䝯䞃㑶㕄嬑詄䚳撌
䉾䆊㦉䛋䩃㱴㣈䀿蕼㜇忥䯸䢦坔襣粊㑥浰䡵蚝貄怬䐀㞓䋟䉅肞茦芓枇䜻殔㿙秲哆搱禷䩀栨䕚㥡戠䨽""",
    3,
    -4,
    -3,
    63,
]

ww64 = [
    """气味贵慰未畏沸费谓纬魏讳渭汇既胃毅猬尉欷蔚饩塈衣罻卉髴芾溉屝狒忾诽暨翡蜚霼熂䠊汽煟靅緭霨熨瞆剕瞶黖媦昲藙鮇菋䵝䨾菲唏痱黂穊芔顡禨螱
蔇俷胇鲱藯泋㒫䝿㭑鱀笰陫喡濷盵䀈蛂㫓甶䲁䮎㥜䆏䉨蘶䝘攈䪋荱蕜䊠䬑䬣㔗炥犚旡摡奜忥䛍䤒餥㰟刏䙿䊧犔䰁滊㵒䭳㩌䊊""",
    3,
    -5,
    -3,
    64,
]

yu65 = [
    """絮曙御助驭誉据署豫箸虑翥遽庶去踞恕觑处预洳饫滪锯语如倨蓣诅舆除茹著与淤滤薯舁醵铝瘀鑢勮棜楚女嘘呿狙沮欤悆穥讵懅鸒㰦鏣櫖䂊怚礜憷鐻悇
椐濖麆櫡躆爈藷豦藇忬櫲嗻㾻麮㵂䎝饇䢩暏儊壉㫹耝䱟䬡勴㣽䘄䉀䁦謯莇䥨胠澽㫂䛯嫬坥竌㫢㵖䭖謶""",
    3,
    -6,
    -4,
    65,
]

yu66 = [
    """路暮住露赋雾步渡顾遇素故误怒度具护注富慕句悟树布墓固趣驻鹭妒诉戍屦兔务惧傅数寓蠹附晤付污互屡铸赴骛疏库哺雨炷怖祚喻裤孺忤寤溯瓠冱裕
谕措负痼妪芋濩愫辂吐聚捕澍妇讣锢鲋恶迕莫娶苦鹜仆霔醋吁嫭圃羽塑募頀柱赂婺璐飓铺亍呼呴阼胙埠嗉蛀潞煦祔愬足簬错绔擭戽斁作厝赙捂菟副酗
跗输酺咐枑葄酤驱埧頋傃蒟镀謼瞀餔祻崮馵属奼窹茹穫䜴瞿咮㴑雇胯疰蚹姁堌䪒胍龥涸诅絇驸觎抪啎俉腧蕗鵅虂鵵鏴熃䜑䑰秅袝䊺㳍綔紸䎸鮬鉒凅婟
祩殶芏韄棝嵍捗崓裋鲴捒盓䨼榑䠵隃㬬豧姹緅䝾埾䣱慔秺娪孵忂䈮嫊䒀罜瘘尌䇘㹥詂蘁䣴飳禺䟔鳠趶秙䨁㕖䞯媀㺛饇軴姇稒誧㤔㨞钴怘陠㧽䀠摢䟻䂤
秨旿紨䵕捬魱鴮䝵胕㜐㓃䴁嬎䓢縸敄䛾䮛攎䎷䠼㚴䊇䝬陚縤侸篧㽽㾟㻉䦌榡㯝鵏弖鹱聥荹㸦䘱迬䔯怐㹘喥䥄墿奦䐍㲓䍛齼邭""",
    3,
    -7,
    -4,
    66,
]

ji67 = [
    """世计际岁细势霁弟丽逝制袂闭第桂帝系继滞惠翳砌裔涕繫厉憩髻卫例艺蔽蒂製替税递脆慧弊荔婿敝唳契蜕誓诣锐隶蕙睨砺曳睇赘疠谛戾励噬毙币缀枻
禊澨蓟俪柢剂毳瘗祭济曀棣係贳汭薙嘒罽离彘帨蚋筮呓谜嚏剃偈殪堄遰羿濞枘缔揭说睿殢傺逮媲猘沴泥蛎㵝盭泄懘蹶嬖粝蓺切掣哜襼彗眦刿釱哕踶禘
薜蜧愒畷挤涖芮寱漈槥穧屉妻蜹轊蘙螮瞖穄悷筀暳橇䳏晢题嫕熭竁鳜蟪轪砅捩医埶娣杕綟繐淠揥憏甈秇㙪懠簭瘈涚箅噎䆿㿃䟡譓达霓璿蜺鳀齐墆紒欐
睥稧枍唑葪讆媂棙忕軎豷鏏珶鱥䬅㝣銴䱥巁睼昋浙觢盻鷩裼攦醊迾洟跇蝭劙慸蹛躗嵽疐鄨䙆濿檵迣獙蟿檕瀱齌偙瘱焍櫗蘮銐僀跩栺殹腣儶䔾鐴櫅䵻䠠
鏸㴉䬽裞暩爄㰥罊餀㪒㓷鮤㵩䠘䀸䶍㥣㜒蓕悘䇽奃㸄誽嫛忚祱㸷䗟溎挮楴㓹䶩禲䜞彐靾潎蛈骶炔鶗詍妎㻰笍䎺寭梊㛳㦣㡜䤞䐭䶏䋵䓲䨖㼖幆䎮䇤㡀泲
呭䤱㜆䫔趆㘑䅄䩢䀙㬩㖂㡂䄟鈌䕍㪈䇧炅㿛瞉䨆㔺瘛丿䚕䏿瓗㲅赽䶓猰䁹㗣鈗䚉㾐捙渧㩨痸䩚䢃彑鷤橞㹭䭁㡫鑖潓䏅榽䎈曞贎抁摖䶑㨹慀栬璏㡼䰏櫔
轚捝䂱䘙㑜㽝䄌鰶浰眱㑦鮨㥷䟤掜犡裚攭䟷沵㓯㭡玴袣狾槸哾䤧帠䓞戻䇩䄿䡟疶䧥怟㤡㳪靪珕蘻㨅㯔䦇彆遾栵摕眭䲪䲦韢魝䛖淣臷栛""",
    3,
    -8,
    -3,
    67,
]

td68_1 = [
    """外大带赖霭籁泰害艾濑盖鲙蔼狯蔡壒奈丐柰太汰郐馤磕癞忲旝粝㐲轪瞹愒㟋藾糩嗳釱忕濭䓶䔽匃㮏戤嗐廗篕跢䠭餀㞭毻䭝䊪摕冭刏昹鴱䨠㞧簤瘌胈䯤
棑贎攋䡷婡忦㪡㘷溙䈆㲡㲕㥭艜堨瓂㯂䮑㧩舦渿䱞䲚笩""",
    3,
    -9,
    -5,
    68,
]

td68_2 = [
    """外会最旆绘桧脍沛霈贝浍狈荟兑昧侩翙蕞蜕廥酹濊哕駾祋禬襘茷刽眛稡珼娧杮徻浿钡璯瀢梖癐絊瞺䬈㙂幆姵犡昁嬒懀綐㛝䵳㤄䠿戻㸽襊郥㝮馷鐬㸬䰽
䢈䔴䟺鈗㣛翇裞杸頪鋷祱餯""",
    3,
    -9,
    -3,
    68,
]

gx69_1 = [
    """界怪拜戒快债迈派隘败卖坏介芥惫械湃瘵诫届懈寨薤呗稗廨疥嘬聩砦虿蒯瀣噫玠晒犗喟解哙欬夬狯邂齘眦韛䪥㬠喝价粺蚧䯰魪駃佅餲繲阨柴劢齂蒉孬
祭㝏衸躗譺悈篑㒠䵘骱嘳䜕紒炌㾏咶唏呃嶰懀吤韰賹膪䈛袃㠹忦㑘䦤㧔庎㠔睉㭛狤纗訍蘾㳗琾䖰㦅烗汖帴楐噧䘍欳欼斺䝽砈㶔䴝䒔䦏丯慸㿍䊽㿄妎䶐
鶛棑䚸浿㞒囆祄㕟䛺庍璯攦欯䇒䢙嬇㳦謑㖑䅬""",
    3,
    -10,
    -5,
    69,
]

gx69_2 = ["""话挂画卦铩絓杀繣褂诖瘥衩䛡尬罫榨睚杷嗄黊䇈舙諣澅""", 3, -10, -10, 69]

dv70_1 = [
    """爱态代慨碍黛菜再戴岱概耐槩溉贷在鼐赛叇袋赉塞嘅载埭睐暧裁叆襶阂逮縡欬薆咳徕簺玳采縩忾劾瑁怠铠嫒棌曃儗皧輆褦酨蝳摡瑷瀻洅燤䒫㾢墤䵧柋
㙕㝵佴棑㧉杚㕢懝㤥䚅鴱蚮婇䣬㻖埰㑷栽㕌螚""",
    3,
    -11,
    -5,
    70,
]

dv70_2 = [
    """辈内对佩碎背废退晦队珮吠秽块妹肺瀣配溃喙诲耒昧碓阓酹乂刈痗愦䨴悖焙倅颣淬缋悔沬憝晬硙靧柹抺颒頮北礌眛镦薱綷癈擂傫韎瀩儽啐邶濧敦㣻孛
回褙圚䕠昩㾦朏睟谇茷杮脢捘櫑憞篃啛瀢蝐繀胇槶䊃嬇䃀䒹礧䯟䉪鼣姵殨眊轛㑍䣂㐻㬣犻簂䖊䌆橃膭嶏㥆䀛蓌㻗砩䜋㲼䈐䠩䩈䛛螝祽㠚䂕鲅㳃䐴獩櫠
饖㔨刏㫲䘹錊靅烠頪䏗嚜銇㘨䃍哱䋳鼥埣鞼䮹詯怢琗苝燊䉬䵢跊䚨慖䨺柭顪""",
    3,
    -11,
    -3,
    70,
]

vf71 = [
    """信润鬓进印阵讯峻仞俊镇烬晋顺骏刃震舜吝认振迅瞬慎闰觐衅殉榇轫浚赈胤衬赆殡疢荩馑躏摈蔺徇趁畯仅憖汛慭燐磷牣馂韧陈廑蕣亲引舋讱遴隽殣酳
蜃搢纫缙墐䏰龀靷瑾鬊袗䭀菣傧瑨盹螾㕙朄䗲晙埈堇睃填鵔儭娠瑱谆圳㷠奞抻㬜呁楯㒞殾䀢岕诊驎轥囟焌瞤侲攈嚫橉垽葰訰琎䞋甐閵檼枃䜭洕眒扨䚔
杒䴄鋠䑞阠馸㥧荵䛜廴㶦㖁䏖覕䪿疄猌䛨鏻瀙䚏嫤䢯璶帪溍濥瞵麐歏寯茚焛㢙軐迿懏䀔獜螴夋侚㠈汮䒖橍䦞㐰㣀寴稕綧㧈賐屻䉮菫敒揗㝦䫃䗯鮣㠴湚
㪦㝻臸䚱㼱㸾螼鈏琗㶳挋毥""",
    3,
    -12,
    -6,
    71,
]

wf72 = [
    """问郡韵运分训晕奋酝愠靳粪闻紊近偾捃隐份璺瀵腪焮蕴郓餫汶忿絻抆垽坋拚员煇㸪堇攈韗懚鶤秎㡈鐼挋䝍䲰㨷桾䚋泿緷㥼㧆縥鼤㟦珺妏鱝檃㡥渂䩵馸
㒚㱵莬檼忶脕歏㴈縕㞬枟魵鱝臐鵘鑂賱斤㿎""",
    3,
    -13,
    -6,
    72,
]

yr73_1 = [
    """健愿願怨万萬劝献蔓建宪券曼贩楦饭远绻畈㤪堰郾圈畹番挽腱媛蟃韏鬗鬳旔嫣毽獌隁褑踺妴婏䝡楥㝃槾㜛䇟謜㪻䛄褗瀗䡬閞鄤䉊脕汳䧮臶䄐絭㬅㶗漹
贎奿傿僆褍鶨卍㸘㰽㤆㽹瓛䏍牶椻虇傆""",
    3,
    -14,
    -7,
    73,
]

yr73_2 = [
    """恨寸论困遁嫩闷顿钝逊褪坌喷溷艮巽噀慁奔鐏囤诨䭓揾敦媆涽渀捘睔茛瀳碖䭡謴㨰䍎袸䫀㥃㫻陯炃硍䵪扽睴㧷溣䤜㶧㴫埨㫔涃銌憞殙俒摌焝詪拵㯎焌
捹顐忳㥵䬶䅱""",
    3,
    -14,
    -6,
    73,
]

hj74 = [
    """断散乱汉岸叹半畔换看案玩旦观烂漫晏干唤粲翰贯幹难炭段幔汗窜焕熳赞爨灿绊冠腕泮灌判榦弹闬按璨盥旰涣惋骭锻叛鹳伴算缦暵逭馆奂蒜瀚捍懦漶
沜悍惮澜彖罐煅犴宴涆谩祼墁矸谰钻毈桉瓘浣鼾滩衎豻駻垾撺缎笇捥㡢谚胖愞杆侃爟鴠頖靽雚偄盰碫㬇哻㬮碳熯釬簳抏垸椴腶姅褖螒䡬灒摊巏疸酇餪
痑镩獌瓓毌鏆拌悹牉饡殩忨湠狚矔澯怑鮟愌䍐峖㪋錌傼䝺帴䠉洝忓䯛錧雗㡺檊妲湪淉钎䮗槾嚾禶㜺䥗竱镧㯘㱫妧睕皯喛䛃䝢兓遃坢䬤䮧㢨咹穳䗰㪵䯎
䏎馯鱹䀓鶨薒㲦倝䅁婩瑍糷躖䃹䯘仠䕿貚㵄㣓碝詊遦攼屽皔暺㪱㻮觛灡衦䏷瑖溿肒㛶梡鑚㽩媻蠸厂㛑襸鳱炍灓䎯䕕""",
    3,
    -15,
    -7,
    74,
]

jm75 = [
    """雁幻惯涧宦患办谏绽盼间慢瓣串鴳赝豢苋讪丱篡晏汕薍擐㵎扮襻覸栈嫚閒虥骭孪䆠谩轘瞷绾铲裥栅扳缦䋎疝涮刬虦瞯僈槵卝䗃䁙䴮鋬藖覵䘺睔粯䍺羼
锏赸摜輚矔䚲奻摜摱綄菚䳛㝈繝㬄釆銏㷳蔄姲䒛䊲妟梡䙪暥枧麲㹖㻵騴㕕鳱澋䉯缳洝贃䙮""",
    3,
    -16,
    -7,
    75,
]

xm76 = [
    """见面变遍殿燕倦战恋贱院扇传练羡县彦片线箭电荐砚便薦甸眷现霰馔啭茜眩膳奠绢饯擅掾鍊宴绚眄颤转卷谴炼堰溅咽弁研炫禅钏援衒嚥旋罥狷汴淀善
先钿忭缮唁暗碾衍倩选抃竁缘煽遣麪缠澱穿卞媛漩瑗晛煎纤牵楝甗饭谚佃靛勌鬋娈撰瑱惓眴拚渲骗輤悁剸拣袨昡链綪嬿睊栫昪鄄籑弮偭趼湔圈鄯缱帣
狿莚瞑填縼臶㳬篟这刋桊汧淃伣涀噮㪇餋晵䄠阗䉵䬼䪻袸騗鋻涏劵辗蚬僝椫骟縓贙諓浰湅獧葥婘萰匽怰衏嵃埢軐蔙絭㴐癜褑楥婩僆蜔鶨㪝烇䴏汌糋閞
㼑皘䑶䆄孨灷瑓湣琠㭓梋䈠䢭竱㢧繏玣䍗䝮縳溎牪鼰䀎怋堜㜃硟㪨灓䂩㢾㧦䅈勬䍻嫸曫夐瓹珔䡀纞䀏槙儙䵖橏枧哯㬗䡪䖭姩汳㺹㯠䬇㝸咞蒝姰飬䏒牑
䛉睼牮㳎頨迿謆橂媡猭琔庼㭇烻豣䥖㞟䠣榗䨘摙駨閵襈鰊驠㸤䒪禐䡓瀳㬫鱄擶檈帴覵棈䄅裫婝䛹惗䢥矎䪈㴜糆抁諯肙繟""",
    3,
    -17,
    -7,
    76,
]

xn77 = [
    """笑照妙啸调庙诏钓眺料耀召峭峤叫要窍诮徼曜肖掉烧疗吊窱少釂劭藋茑獠跳俏邵铫粜窔鹞醮鞘哨轿噭骠漂噍燎摇剽炤绕谯约爝蓧穾票尿㷖悄嘂嘹僬卲
趭僄溺朓鹩䆗脁俵嬥艞葽㙩訆裱镣摽䔄㗛頫獥顤瘭瞾嘺覜偢窎尥誂潐膫藠帩獟伄僺㔅瘹䐹髚䠷踃顠枛䞄䎆㬓䇌翏顅篎篍㚁䨅䔙劁䉼䂃蔈㞁䃝㴥鋽竨覞
徱娆晱樢嬓熎㬭䬰䢧抭顟鷣嫽筄絩㧼㿢讑䊥鸄敿㢗撨尞䏇㳮熮莜熽窲䧂鐈䆻敫訋鑃㞙炓䊮㰾璙嫖""",
    3,
    -18,
    -8,
    77,
]

xn78 = [
    """孝闹貌豹教效校棹淖觉罩窖稍炮较乐趠砲钞泡礮珓踔疱胶敲爆桡恔滘靿酵坳窌敩儤哮獶笊䫉巧䑲拗袎箹䶂㹸撽嗃奅娋犦麭刨艄挍饺婥潲睄岰㒵骲䡚䶌
洨漖悎髱烄仯䈇㷹䍜詏䔠㹿礉㘐軪緢㯡䏴""",
    3,
    -19,
    -8,
    78,
]

hc79 = [
    """到报帽操灶傲噪奥盗号诰导蹈劳耗告悼隩躁耄暴好道瑁冒奡骜漕焘造嫪膏氉犒倒芼翿抱靠扫眊瀑帱慥纛墺秏祷糙凿郜旄㟼曝慠澳䤖懊燠涝搞瘙謟缟埽
扷㬥媢謷鏊䊭鼜鷔套痨僗嶅憦軇鲓毷髝髞軂㪞烄鯌䐧耢㞻橯鐭㒻叝蔜䋃艒䪽哠䚽㧌璹㴘㲧㚐㙱圫瓙鯌菿㜩翢鄵喿嚗㚪萺祰㿞檤覒䌦㲒㿋藃祮㺺䒵镺襙
擙㘪冃䜒㜜芺䎋㥿""",
    3,
    -20,
    -8,
    79,
]

ge80 = [
    """坐过卧破座和个贺课饿箇唾涴货些大磨惰挫做簸個逻佐作奈那懦驮左剉锉播糯莝坷堁轲愞蹉磋瘅媠剁譒他逤骒髁娑㰤䙃䃺蓌哆哪啊蚵摞毻袔藦耱蔢㵑
涶㖠袏侳桗攠䞆㟇㘞鐹跢俰楇䇔硰㘸敤攍㾧襎䟶痑尮侉㳀䉓吤腂纙㞅夎椤㿚沎盉誃挆""",
    3,
    -21,
    -9,
    80,
]

ma81 = [
    """夜化暇驾谢罢价借架榭亚稼下罅嫁骂讶怕诧华舍蔗麝迓卸跨赦诈射乍泻夏藉柘霸咤坝胯炙稏吒帕汊娅靶假砑姹吓灞把嚇斝榨贳鹧蜡厦䏑差桦祃岔髂籍
奼弝杷睱吗嗄贾耙衩䕢唬溠䄍衙哧諕侘槬犸䆉鵺㰳䆛閕躤酠踷蓌㕦䖳渣哆挜偌杩爸觟跁摦嗻㖡鬕褯渃厍䂞膪愘仛䤳䵭䉣襾狛哋㾝笡㙈訍懗宱嬅搲叭閯
揢砟鳠䧞騇傌䀅䃻䟕觰䩗誜㴬㾺謑夎㓔侂䃎涻䗪䒲椵疨犽䢝芐俹灹諣疜㣾䠶䩾矺䣕杹坬""",
    3,
    -22,
    -10,
    81,
]

yh82 = [
    """望壮相浪怅唱状障恙访帐旷涨将上舫嶂样酿尚仗让妄亮丧畅况漾饷藏量匠贶葬瘴向谤盎忘王放宕傍怆抗当创谅飏纩杖旺鬯荡酱幛诳行桁阆圹亢长倡养
仰砀张脏两偿妨韔挡悢颃嚮擋伉絖强吭榜胀扬防炕踼瀁炀饟广傥怏账闶鄣掠烫醠淌緉獞畼喨汤旁埌绑曏艕䩨棒晾迋菪䌙䀶羕攩糨懹矌潢徬眻逛㼽䦳珦
烺㤮诓㾗桄戗爌搒儾逿枊塝哴懬犺湸弶蒗軦鐋唴䦒鐋圵賶詇瀇臦蟓岲䊑盳晑凔䭐䤑䵁灀㺊㙣㔀嗙倞焋邡趽㫛嵹懭砊䕞蠰摾俇撗誏摪摥䞪礑㼜趤眖䅮䬺
䵮櫎萫俍掚瞕焵䍚嵣欀曂䬬囥畺䩫諹姠嫎柍羻瓺焻邟㢓姎蚢恦""",
    3,
    -23,
    -2,
    82,
]

jk83 = [
    """病命镜性咏净盛政圣映令正庆劲竞姓敬柄竟孟迸聘郑横泳硬证更诤儆行凊獍迎并侦评夐帧靓㡧榜證另阱倩証请禜轻晟盟㡠摒醟怲檠娉挣婧诇锃渹䀻碰
邴倞牚请跰啈詺絎墭窉詇䓝璥寎澃矎朾狌竧悙靗賏㶇鑋䛭胻䡖姃䰢儬葝鸻䨻掅㘫鉼貹妌誩䙬賆䂻梷炩䈣竀㽀滰䔔摬瀴鈵曔眐浧㼞絎鞕""",
    3,
    -24,
    -11,
    83,
]

jk84 = [
    """兴定径胜赠听暝应磬磴乘称莹甑罄剩胫佞蹬凝凭饤亘孕订媵邓瞑宁泞醒镫秤滢證碇靘凳经亙庭锭瞪嶝症钉綮凌廷隥譍懜㵾蹭墱懵穪鸋堋濪堩鑋俓膡倰
踜䔭蕂靪臖䥌桱碠掅䲛䱆驓邆㿦霯鋞㑞䱍蓥䰝烝冥掟䵴掕䠬僜誔㮓㞌㣷傰鱦殸搄芿濎橙䙢鼮忊痭㲌氶碃覴榺䮚褮䒅䒌䮴睲撜靐㚺㹵㓈""",
    3,
    -25,
    -11,
    84,
]

yz85 = [
    """旧秀瘦候袖就昼漏奏岫绣透豆茂陋斗宙溜授构寇窦皱兽骤臭谬逅胄又售后究鬭後鬬幼祐救堠搆逗觏狩寿漱彀甃嗅酎扣凑狖厩疚宥咒耨籀鹫覆遘辏右诟
囿霤富绉镂脰走购厚宿首侑雊留懋媾鷇守瞀糅蔻僽饾贸柩冑副戊咮复鼬受簉腠復廏锈仆袤缪叩僦吼够馏绶姆佑嗽琇收姤柚读句廖鲎繇灸楙蜼槱冓伏蹂
釉沤愗狃瘤噣廇糗痘嗾譳懤揉飂楱鄮畜鹨擩釦鍑塯韝㖟䓮油揍佝鍭筘貁䔰煹㤱窌睺㳶㖃䐢䀁毭褔䛠䙔牰複犹輶雺輮偻溴酘铀瘘浢㑳镏娒螑䩜䤅姷蔟豞
櫾䬨㜌熰謏㢄迶嬼䜬䩽䋓䛆匓嗕䆜㗕駎㔌竎鏅㔷慦䃓殧㔿鯦斣璓磂撀煣䝭㰯㠇椆猚䅢怐䞬䍍㙧䄈㙀凁䪷㕻鬸㝊䳹珛䌂㺠䊘嬬遚袧㶯鴢㛒䞧㝌骺䞥峟䛵
蜏暓栯䒄㲃糔䇺䋴鄇豧惾嬦㾭㡱䠐䠫㽬鲘䟝㩆鏉瞉鮈鞣㝤㹨敊㨌粙㗜㦞梎㵵䬦㝅洉䪖嗖韖郖輻憱窛㼙怞疛䟬䦣䔏䀤""",
    3,
    -26,
    -12,
    85,
]

qb86 = [
    """禁荫谶浸任祲沁闯赁鸩䜟谮渗甚饮吟窨枕深罧纴临寖噤衽喑沈揕妊僸酖紟鵀癊侺锓妗吣邥齽䌝鈊㱽䶖䥠䧵赺䜗䲴愖㓄瘎䏕抋㯲夦搇莐笒伈㼉䫴鈂䈜扲
㤈䑤搇㵕瞫""",
    3,
    -27,
    -13,
    86,
]

kj87 = [
    """暗憾缆暂瞰勘担探绀甔淡䌫歛滥三澹惔憺啖赕錾懢淦磡憨憛墈唅䗊嚂䘓篸闇阚赣霮爁僋莟琀壏倓俕腅䟅帎蜭凵饀䀍䲺䯥䐺詌瞫漤閐㤾㜮揞䐄黚参姏䨵
撍馾竷䫅䬓䗣儑顑癚浛沊汵誩婻錎顲""",
    3,
    -28,
    -14,
    87,
]

yj88 = [
    """剑念艳店验焰滟堑欠占酽垫赡厌坫僭砭窆餍殓觇掞敛韂痁爓兼佔椠苫舚潜潋傔俺歉襜盐㪁㮇忝噞熌惦煔醶嬱沾䦲㼭䀡䪜幨淹碱猃驔酓裧䛳艌稴䱤嬮覎
覎菾棯爁敥㣣裺曕譣䧔䁮頕㷔胁㟻姭䯡澰㱨䊴㜞埝䈴䃸嶦㙴趝鳒䶫殗䃱㶺㝪㛪䠨羷""",
    3,
    -29,
    -14,
    88,
]

xm89 = [
    """鉴泛监梵陷汎忏赚蘸站帆镵馅欠儳氾剑摲沨訉㽉钐䪌阚湴譀湛谗埳㦑㕨㪠钒揞䬚顑覱甉臽䜛䶟䀀滼淹㺘㣌韽㸥㒈肷錎䱿溓艬""",
    3,
    -30,
    -14,
    89,
]

wu90 = [
    """竹屋谷目木熟哭腹菊服肉福独速鹿麓逐禄肃轴宿牧卜筑陆六族毂祝沐穀馥读築斛犊缩叔粥牍复掬簇蹙育復覆伏秃穆淑曲蓄渎碌矗幅戮縠扑镞燠漉菽竺
瀑蓿撲椟蔌恧簌鞠鵩簏塾睦蹴黩谡蝠鹜觫霂煜澳仆夙複畜餗郁槭洑辘孰麴朴浊濮蔔辐衄角匊毓鬻舳樸輻讟樕倏暴僇醭曝啄蝮槲箙稑鞫昱盝俶朒匐輹蔟
蹜滀彧韣踧琭蓼髑碡柚葍告囿毣熇忸鵴㳤睩龊袱柷茯慉䍡澓菔摝䤋蓛遬苜楅剭勠瀫䘵䎘搐副鹔薁瘯殰穋㝛觳嘼榖虙橚涑鱐䉛豖螰缪簶鮛踀喌䔎鳆䩮瑴
嗀䃤儥趚骕梀蹗鏕錥鵚栿贕噈閦皾鵱莤摵朷焀䃚縬䀲阿䘐濲腛䱙椈稢摍䮷䪁虪璛鋉璹堉藗䛢㕰蹼唷汋淯唂趢蜟拲娽蔛跾鶝翏匑蟏踾坶樚熝梮鴔栯踿蓫
䫳獛圥栜嬻艒躹鯥蕧棴蚞偪茿楘蔍沑趗鱁韇喐諔襡惐䑿纀踓攴㜙㬼剹鉐媉㵀垘㓐樢㾄鑟㯷䜯雮騼淕趜䡜襆䥮㺉埱嚛荲鞪䟮砡䙒㒔䞱㦽㰗䱡䑁䗇㥌磩螜
稪㯟䢗鼀癁㪩㴼䧤㜚䕮蓻誎䶊箼㣎聏䜼䴪粶蒮鄐鍙鱳㼾㚆䪕涋逳䗛㑛鄜㾥㘲㹼䫝鐭䙯哊䐁蔋㲫骲㽇諨䐨㠅㾇㞘㑐䗱㮋鎐觷㬘㖨㥔塶䎌䊾䟟玊泦篴喅䨱
殐䏋㛬稶㙏䇍疁畐㻃䛙炑騳斀㜈槒㽤媨㗤䌒䞽齱㶖礇䮱鏉䵈鵦䄾䨹䏱䋹篫䖡椂㦇莥㤢巈宓㯈䘻䜡㞺坴軮蘛閰㜅殧㓘嗖䀰婌㪶䚼䐿鉃疛潚琡丵珿斣萺䃙
膔㪖掓焂樎㰲轐㧅䎼㣃剢粷䇚婅䎑㷤䈸罜㩋苖犕椱㑉敊穙絥䃞䋭鳪䟿䢱棛㡔瓄驧觻""",
    4,
    -1,
    15,
    90,
]

wo91 = [
    """绿玉俗足烛续粟束促局辱躅录鹄欲触蜀毒浴旭瞩曲狱属笃酷箓渌沃醁赎勖督溽褥斸嘱缛梏跼鹆北峪纛瘃菉蓐蠋騄仆顼趣牿告鄏䠱幞挶㒒喾襮歜鋈裻鳿
檋輂逯藚熇锔趗䒼斶媷虑䕽哫臅镤蝳襆梮憟俈㯮㩴匤臛蛐旮拲欘趢䙱犦灟娽駶軉傉彳鸀鋊琟筁蠾砡薥髷脨䶜隺噣䋰䎤襡潥䴰䥔䞖䱚䧊䴆㮂䡞䪅㦺䅇㔄
䛤泶搙㙇䳔捁䚛珛䞝䚄絭钃斀䐂洬孎㫽䧼㻿錊䟉嗕頶䌚觷傶斣疁䈞䅶䑑捒䌵嚛䜹悎錖誎蔋鶮钰輍㿥螸""",
    4,
    -2,
    15,
    91,
]

jt92 = [
    """学岳朔渥幄角濯邈握觉璞剥确琢卓壳斲雹擢槊荦鷟驳捉浊喔数桷啄榷乐朴駮诼灂搉樸龊珏埆啅较鸴峃偓涿踔倬椓镯鸑药搦爆㲉桌娖礐穱翯悫跑鸐浞擉
戳謈硞㱿㧻斮趵懪墣㩧箾眊斠捔鋜棹飑礭嚗瞀觳碻瓝豰穛皃齱噣欶搠鳆掿晫烞嗍瑴攴韄骲傕硺㓸龌蒴鵫汋瓁蠗䈏鞄籗窇鎙䓎丵㦝洬殐䪨䇶䥃㵡泶犦捳
䃕斀琸髉䨌燩鞪籱㹊楃欘䡈䑈矠㴶簎齺悎豿觷韷㔬䦠壆䂍䮓仢燢敩菿㺪劰隺腛搻㙸㿺㺟䠎䮸娕瞐㼎䃗鑡篧墧㰌䥤鳪媉㹒㰒䁷顜钋㙾瞨龏㱋㪬珿㮶""",
    4,
    -3,
    16,
    92,
]

vi93 = [
    """日笔室一失密术疾实術逸律出毕匹膝瑟帙漆吉述溢七栗必秩诘橘恤跸蜜质乙悉栉虱秫慄蟀唧荜黜弼潏戌谧叱汩嵂嫉昵朮轶率节骘窒镒篥怵壹卒侄釰锧
驲绌苾佚鹬姪崒茁蛭抶疋桎铚繂肸泌遹繘霱䫻獝韠罼凓飶筚堲咥袐尼佾鳦衵泆銊鴥厔帅蟋䣛佶訹礩聿紩耴溧蒺桼翐袟飋姞宲比珌蔤挃觱沏鞸踤䁥拮熚
妷㮚駜馝鷅庢饆瀄膟晊沕沭傈铋窋璱䟆秷柣䭿㤕柒驈㗚鴄摔捽矞鉥滭㮿楖窸齣佖祑䬆荗胵祇㘉䜉眰䵒㧒䤉䘌䋖茟眣瓆䎉䬄鬻咭圪疙枇蛣宓郅怸鹎銡鱊
滗黢滵螲痆趌膣怭邲鷝螏彃呹䬹㯃珬㻫狤箻峚欪樒榓䢖箤跮鮅䘤僁㲺㞊㟳䢤櫍柫欰㺷㪤䢞秖㰵㻶芛瑮燏䆝恎㜱㣟䮇焌㻎魓䮡塛趉郆㣰㑁腟㢸揤㳼䟣豑
䩛寽擳恄衹袕䔞䰬蝍䑇㘍鏎㖅䶡縪㜼鴓㓖㗧咰㻭胇祗嬄䵑鶐㢶䖩㑵浂抳洷䌏䒤蹫妼笜銉䟈䬛槉䳀㴵䡃詄㳑䱣肷犵㵥䏘暨鴶㳚䄶䔁㗌㔑䱃淧怷逫琗欥㺩
絉䢦䳳炢搮臷䤎炪䏄㗭蠠㳴㾁欯䜠䢕鞊㚕麜臸㔕㫘䫕秪鲒㤜""",
    4,
    -4,
    17,
    93,
]

wu94 = [
    """物佛屈拂郁绂乞绋黻勿崛讫屹綍祓诎熨韨茀髴蔚黦倔咈弗歘怫仡芴不欻刜吃沕岉㗵迄菀掘岪镼汔昒釳帗䘿魆肸尉艴甶冹笰爩厥忔鶌灪坲粅䠇炥誳芞鮄
烼趉惌䞷䭮柫䞞鉘袦虳䵥弡䁌沷砩䎢㠨翇阢伆昲䰴䖇㐹㷉㪄䏌䒗乀蛂芾紑嶏柭莔䛥㭾㻕""",
    4,
    -5,
    18,
    94,
]

yt95 = [
    """月发發骨阙髮没窟忽兀伐谒袜笏樾突钺歇襪粤蕨渤鹘越惚勃殁罚筏刖曰阀蹶掘窣柮卒讷橛竭屼滑龁猝羯劂獗杌矹矻揭讦卼垡蟨咄搰腯蠍軏碣纥馞核崒
峍淈捽悖汨硉浡愲凸狘暍撅鳜蚏扢孛堀哕扤鷢䓤厥榾瞂揬䬍蜶曶嗢饽艴抇钀阏昢㶿䑔䬂㪍玥不泏䨚崛棁葧桲猲嶡胐瘚抐鈯朏麧糏䎳宊顝匫䞘颰莈脖昒
鹁唿钠囫镢犵淴腽馉蓇阢怢葖椊稡湥杚絗馧饳䍪鶟荸鼵蚎侓歾縎囝舭䠈㵐寣䇅䡇䪬㬞橃啒䚝㛲笜䓛埣䟠沷㲞㪐䎀䑢亅憠冹熓挬榲鼿貀犻哱䝆㐳䪲殟㫚
䭯㳷䖓㔜䁫抈瘟䦍籺㒴䥟䙠㕹㷎䘚䯿碿㻠枂䟜捸䯇榲坺鍎䣹䀜㘺熭尳㟑㧮趉䮩殨趃郣㾶迌㽾琷䋐揾㞽䩐㖀䂗鋍㴾璏岄鍻㵠垏㨡堨瞃怴䴯欮㧾藅侼㩿摕
㛘""",
    4,
    -6,
    18,
    95,
]

he96 = [
    """阔末活渴脱豁夺闼钵葛褐割沫聒拨抹遏掇达泼跋括剌秣怛萨辣斡魃粝蝎阏獭栝轕喝躠挞撮筈茇鞨捋敚撒頞臈鱍摋拶鹖䌨越拔澾軷咄捺曷妺囋钹靺袯歇
䟦蘖噶鞑酦濊喇暍毼呾鏺鸹剟妲裰佸㔇䡾碣跶齾嶭胺泧髺犮胈姡妭㵧攃适羍哒堨笪猲獦嶱毲靼炟枺焥㒓荙莌䯋蹳捾馛葀繓丐轹砸叭咱侻饐瘌齃鵽蛞蝲
嵑茉敠帓囐蟽萿揦攥䃮癹洝頢鼥䒷粖頱礤魩癶㻝㵣揧㦫䯏䁊䅥濣䱅㓉鮵匃䄑䍨䯺蛶柭㮫㸊鶷㭮懖餲䕣䴲昲䦚㞈㺚䏞䟯㩵䫘㧊䟛䢌蔎䦢枂瓎刽秳㳨冭噧
狚㵶嬒鲅颰仴磆㿣䈓䄆汰咹襊湏䵣驋痥燤䳚䱫坺䣮㕲皌炥骱橃睕橽䖧幯昩炦奯脟螛䳁啈㖕䶛秡抈䣪趏䯦眜㞉㶬攋眓捝鬝㣞㣵䬴砞灒懀㿹䣶""",
    4,
    -7,
    18,
    96,
]

xx97 = [
    """札八刹察辖黠轧杀戛刮煞猾恝齾哳圠秸扎瞎滑揠拔嘎楬蚻擦刷茁鹘汃窡铩妠豽嗗肭鬝扒颉刖铡劼圿䕓䀣㓤獭螖榝䝟扴䀨帓㳐䦪帕咶紥鸹稭磍擖哵搳窫
痆硈䯉秳娺猰㗫挖捺錣鴶菝捌朳砎叭鲒聐摖礣劜詙傄詚柭鶷䫄貀閁䵵㭭䱻䦖䥷忦趏䴳䶪歇耫㪴㨸䂒骱䓭袹捖捾嗐袺仈㑻㔠玐釛㔍咭鱊㮖颳縖㕯䆯㓞磆
鵽蠿釟䤢揳䃰㺴䰲䚴帴眣檫糪螛睰""",
    4,
    -8,
    18,
    97,
]

xp98 = [
    """雪别绝灭血热拙结穴说洁节铁裂列缺烈辙诀悦舌杰设彻屑竭决哲咽阅折切劣冽缬澈辍掣瞥阕窃孽蘖玦鳖埒啜截爇鴂绁歇齧撷垤泄耋挈揭跌嵲撤孑谲泬
餮涅亵吷刷薛迭蔑洌糵撇缀鐍桀抉蕝瓞噎苶惙臬契浙闑楔闭卨蠛絜嶭㓗碣歠拽绖棁篾臲襭僣页掇凸隉蹩晢媟捏觖衊呐莂趐霓茁緤锲岊昳颉蛚偈捩蜺醊
揲驖巀茢轶楶蠥咥哔朅蜇焫摰幭禼㧙丿拮颲㙞讦渫桔蛣畷疖褉㞕覈批褐谳碟瘪锊悊准篞䥫佚迾搣槷辥蠘棳䆷䁾䨮憋蛭龁鷩橇趹僪襒奊蠮瞲刔鴷駃挒嫳
藒孓罬暼㿱滐㗧揳䖦䚢镻絬瞮覕䕵䫾䠥㖶馝姪帨踅咧剟紒屮醛唰趔瀎咇詄硩蠽蟞蚗潎爡跮蒛蔎蛈袺趌芵蛥嵥糏鲒僁懱鐅蛂鱴胅㳿赽䌘哾脟蝢趃逫嵽啘
齛囐敜鈌䪼蠿娎乴袕聅籺䍳㔎麧迼䩤眓剈䫎䞰虌螲㘿榝擳㐖緳䘁翓㢼狤攦䂼㩪䓆菍䐼䀗郣巁姴坹眰砄䲙燤馛尐䏳㓭䙽㲳䭇痥鄨妜笍怢㛃烲䟾㣯哷疶䏐
㭈稧矞䅀栵朳䛎䭱㘶揊炪眣爄䥕䩧㝂靾䏟䦬夨蛶䇷㭞㔡聺炔魝䂐䤿勶蛪㨝捌鴓洇鮤疦叕疀睙䫼㩢㔢彆櫍蠞㴪莭㴮蛞㽟䦑㔃㮮䮕苵摕呭滊䱑䟙㯙砓柭䌩
䯵眜蜹㭩㹟㸞潱㼤㬚䋉㬯鑖㴽䊦鱊諁歽䨆湀㓶炦臷䳤䆢㦢幯䒸櫗詍棙䟹劽掜敠坲䏲䆕戜粖猰徶桖㕞㸅毻䘊櫭䝌㸹搩瘛栨㒝靼㖏䘷䊝䋢㤠䒆䈼恎䞵䩏洯""",
    4,
    -9,
    18,
    98,
]

yc99 = [
    """落薄鹤阁壑寞郭托酌漠泊略脚恶作乐雀廓託却昨弱跃洛缚萼鹊约索著诺爵着削钥错橐络谑博箔幕铄虐药柝嚼藿箨灼若铎霍怍礴凿瘼愕鹗屩烁酢籥锷勺
攫搏噱粕杓酪度崿鳄彴涸蠖各斫莫掠雘绰貉讬恪鄂镬瀹谔拓疟穫垩萚膊珞膜雒魄椁噩笮骆矱扩箬摸爚爝镈臛腭襮堮缴遌玃格妁烙㟧醵泺咢饦礡鞟泽钁
获蒻亳龠搁斮焯礿蠚矍獲彍艧蹻硌䋏臄镆陌郝躩暯逴霩熇芍皭柞矐瞙皵踱戄㠋跞靃篗鑮煿臒漷岝欂䧿皬鄚糳悫汋婥蒦昔㗁燋躇㹱䨥轹攉嗃婼㖾䥬咯鷇
貜迮謞犦碏楉蒪袥䋤䱜飵蠼貈侂嬳仢琧檴䙏䟑湂踖塻猎汑蝁鄀䁨䚥㜰庹厝胳喏颚鮥隺彠袼鐯嗼喥辵瀖嚯铂崞猼凙㚟渃鸙硸烵峈杔鄗沰馎馲剒磭矆胉縸
縒嚩敫噋㘀蘥鶮鶸䬪䨰籱稓铬鰝慔㓢㕡婩䞢嫋矌謶圴䖃䶈佫彏䶳仛擆蹃䤕䪙㬍䈅㤞撗㸕䰊癨詻㷾斱櫡㩱魠鬕岞庴䖋葃㰛䐞䎰㓵㤩挄焲䉟逽䮤䀩䖛㑼䭦
䮬鈼䍸砟趞蘁䗚䐾籗嚛䨣毭䄸㿑蛒郤鹱龥櫮䂄笿矺䯨䅵鞒禚曤䈷㦍癋棤䛚㕁跅䎊㖸檡鑩䲵䝫㦡䧄䖼䥣藃䣞䶅䧐䅴鱳㲋䢲矡莡䐘䅂䨋秨劐㦜䖈覨䇥㸲搻
扚娋䌇䁻㗥纅㱳蠌擽䠯㴖㤰溹鎍㨼㗘茖䇎䌎䂮狛櫎㗉㪾㮙㷬䣤繑牔剫偔墌溺㒂㬦莋犳妰谻苲㨯䫷""",
    4,
    -10,
    16,
    99,
]

mo100 = [
    """客白石迹碧夕宅尺席隔策惜役屐益陌璧伯赤癖柏百驿窄剧脉辟昔翮隙戟迫掷泽麦液僻责释额积易舄厄获册坼帛獲逆适籍谪赫革择脊帻拍魄碛掖拆格腋
瘠斥奕绎擘画怿射舶只译索藉磔汐珀膈硕鲫弈檗蹠炙啧貊蹐绤斁轭扼划穸赜鶒螫帼箦摘疫阨唶馘骼蜴埸帟㶁摭迮栅核襞襫奭峄咋刺摵躄祏婳踯薜湱覈
亦虢哑霢擿腊蝈借擗砉醳嗌喀磶虩槅剨蓦穫踖耤阸齰峉莫鬲搦筴霹掴㗲塉媳鹡鼫騞齚呃撠圛愬齸嚄觡貘㫺滆晹潟㼟翟嗝佰襗蚱粣舴睗橶㧖䇲䌟霸泎蚇
睪柞鸊啯礉蕮覤榒洦襀㼣敀瘷厏㥽䘸詻㟙㩇縌謮㦎㡿㿟㳻㴒覛嚇郤胔啪哧嘀郄硅虴徦蛨皟袹漍缂曎墌檡嗼鸅塥乇礋燡簂痬鲌焬腘垎蚅躤銆捇鐴鉐嵴雿
擌帞閴諽䜺鯣箣蹃茖礊熤鳠棤䛿㡯廦馲慖坄䂹焃䖌烢䕉掝㮝䶦䤨絔䨫棭㣱䭞㭙㩍頙澅杔扸㦴豛憡䘔䞟苩䂝洓䣢鰿矺歵蠌䟄䨛焷虉糪揢矠厝䳮銏嚿樍拺
脨楁㵹煂㒀眲獈呄㜋㦦獥䬉䄷厇窢䡛䂸䞦褯趞茦䮮䞠铬葃㾊籷簎䩹庴犱䁤䪂嫧䕪㴁諎㗆䮰溹㮦膉鳽䐙覞蚸挀䁺㖪䳭聑㛭䐸丮焲莋啇貖碦㽚搩蛒劐䦝䊂
躆䦴豟䧍耫㝜㠛潪㿭䳆䃒䵂䱮焟䐱狛韄疒蒚䰜㘁讗㑊䚂䖨燚瞔墿瞁㘌檘啋罊屰凙鈠釽鏼臵雃啙聻枙㶠炈䈿胉嬕跅䭆砈䊞謋䙐㹮岶㣂䘑䪝鶪䲽谻""",
    4,
    -11,
    17,
    100,
]

xi101 = [
    """壁寂笛敌滴历觅激戚绩檄击锡沥的觌雳涤砾鹢惕枥析镝吃狄羃淅栎荻劈晰甓溺皪剔阒逖籴幂迪靮嫡皙菂适呖䍥趯觋霓惄甋篴阋鵙瓅轹汨摘踢籊艗幕澼
鴃殈裼焱蜥䍽郦蹢樀疬吊礰鬲赥鼊鼏坜倜墼緆䥶轣薂繴簚㭊㰅鼜砉翟踧镉秝鹝苈覭糸䵠濗䓇䤙焃䢮狊砳蚸㢩霹攦悐幦鶪磿幎䔉虉熐毄塓菥馰嚁擽釽憵
漃鱳鐴玓瓋䟐譤湨啇㻺苖綼趘焬㣙䨤㿨盢冖虳儮歒欫扸梑䚫爏㤸婥樍䤨撽蓨椺䣓䮥墑漞㲻䂆䖑䴞磩䞶㦘儥瞁㺡頔硩礕㹍轚銢燩䮭䗩㱹㔏敫䈪㱤蒚䰛惁
㒪讈仢鄓郹㽁蓧㬏犑䌐䳬䑀蔋廦鸄觻糑㛫䨀覛纅靋䚐扚䁶肑獥䢰䚍鼳䟏㷴䯜㱸""",
    4,
    -12,
    17,
    101,
]

vi102 = [
    """色得息国力极侧识翼直黑忆墨域食测北职棘贼刻臆德逼恻饰默勒惑则稷织特即拭陟匿蚀仄式塞穑亿植亟抑敕克殖弋熄肋昃轼忒饬啬蜮慝泐阈踣洫劾嘿
殛赩翊匐湜屴愊僰纆崱寔薏杙裓嶷墄螣唧埴愎罭尅幅剋襋偪衋轖扐遫或蠈棫淢栻蟘湢緎㥾畟淂鲫恧翌㳁侐鲗荝阞慗鷘仂副腷醷㘈繶菔蕀餩瀷芅冒戫㥶
䘃噫釴稙樴竻黓膱戠稄淔蒠㚤癔朸熼㭲蟔䐈皕㽣䰥犆蝍堲楅趩忑恜㮨掝堛嚜瘜嫟煏玏蘵赲嘚艻脦稫惐溭腘䅞閄澺㕵䞳檍踾䮠䯆氻㘠䉢䧗蛡釛皀棏䈟鶝
潩爅䁼鲾烅㹄㥂㤫䴬臸㢞䭒嬂䱛㝶霬㻷懝捗㷶侙䐚䘅窢㴧鄎螚鳓熤䵱㮩㥛諽㷵䁿㞋畐㞃艒禃遈䵗䎪䦗㱄浳䩯㯤蟙垘㔴䘝鳨揤琙㥀䄩鉽揊䮙焏䦼嫼謋㔹
㯰㱇茍蔷䙷骮潶䣧㚜㧹忇䗷烒穓繬悈蚮鉓䖁捑䆐㫯䬎殕㵓懎䁇㥁䤭""",
    4,
    -13,
    17,
    102,
]

ji103 = [
    """急立入湿集及泣邑十涩习蛰拾笠粒什汲袭揖给级吸执汁絷笈隰挹戢葺岌浥辑悒翕缉熠楫裛唈伋噏褶廿濈潗蕺霫雭歙槢苙孴歰馵芨㵫熻咠霵钑煜潝漐鳛
雴飁㞏㧀卌啃闟俋礏湆箿岦㬤圾皀諿䓃㞚㠍砬卙鵖湁鷑㗱䶋䒁慹礘騽譅㒊㬛喅䙄䁒翜䔼㤂釞㩉㿇㴔瓡䏠叺䦹㘊譶蓻㱞䅤湒㕸鴔䏩彶䐕漝䭂㣬鉝偮㒆淁
㡮嬆㗊䉗嶯㙫㲸㴕㽺㦻㗩鏶趇䮶骉䩰㪧䲯䇼㙷䶘鴗䁯䏉謺䔱""",
    4,
    -14,
    17,
    103,
]

he104 = [
    """合榻塔答杂腊阖衲纳飒匝蜡榼踏閤沓蛤鸽荅盍遝拓塌拉帀蹋鞳搭盒靸䬃鲽蒳嗒嗑溘趿阘㷈磕漯欱㯓噆匌遢咂罨嚃剳鎝䗶誻唈岋涾卡馺㔩砵盖卅镴濌颌
軜嘁搕钑韐鞜褟廅傝䑽耠篕峇䞙䕹㗳䶀䈳䃳䆟铪哈瘩碜褡瞌耷鮯毾狧錔溻峆囃詥溚匒歞雥鉔鰪魶匎鑉砐菈崉鳎䍇䑥磼䪏畗䫦鎉䪞殧䪚㾑龖㧺譶韴䶁㥺
魥㧁䪺熆䌈㨥遪㚫㿯㠷䳴㕇䂿䐦䙣䨿䢔䵬䧻㭼儑㕎硆罯䗘䐛磖礘䓠㛕佮㽂枼䑪厒姶㛥䍝圾笚榙㰰䈫㕉䵽䑜抸㝓㯚笝砝翋䈋㿴䂰鞥魳㹺拹柆痷矺魼䜚㡴""",
    4,
    -15,
    19,
    104,
]

ye105 = [
    """叶葉接蝶叠楫帖捷涉箧惬颊堞妾侠铗鬣睫牒靥屧浃协荚蹑摄慑贴燮挟摺馌镊猎烨躞晔捻谍跕蹀詟氎躐辄艓嗫擪褶聂怗箑厌㲲韘褋惵衱笈魇裛屟梜喋霎
苶歙籋楪霅呫讘襵菨折炸鞢婕椄欇錜筴鍱擸偞崨㬪䈉䌜䈎鲽蛱熀儠䐑倢踕䩞渫䜓㱌誱㫸挕㩶巤䠟䌌㯿邋熚踥滠擛獦颞謵唊緁䛟僷牃犣帇㢵劦鑈昅㑙㩎
㼪穕䝓踗㸎㤐䵿䥡踂䌰慹鏶䜲迠䇣㚲蓵揞埝䴴痷鮿㚔㾜徢䭟䁽綊㒤㨩殜鱲䤮䌖䝃聑寁㰔褺萐㪑煠鎑㷸䢡䪓㰼淁銸敜㼲謺脻㥦㢎惗䳖帹疌聗瞸䝱㤲䪉㥈
㙷㛍蓻䐲枼蠂䴑㭯䝕㤴䧪䁋䯀㳧㽊瞱䜆㴇㩸㡇鯜""",
    4,
    -16,
    18,
    105,
]

qx106 = [
    """业法甲劫峡洽怯匣鸭狎压乏插狭锸夹嶪闸霎袷箑押恰柙歃呷劄胁翣帢唼掐胛邺裌陜硖霅祫恊眨凹搯扱嗋啑鞈跲鵊郏喋筴㰱岬愶欱䶎萐熁蜐玾擖庘哈钾
胠㡊葜喢䆘筪姂㭱㾀渫烚䩡韐呿䱒嚈圔䤶魻唊舺饸䮜㛼磼㕅殜䖎歰䀫䘥鉣砝珨铪姶㵊䛅㑢嶯㴙㿓疺殎鸈㘡䮢驜㳌偛㸣䁍魥昅翜圶䀴煠疀䁆澲抾䂲曱帹
痷䖖䎎垥魼㽠湆㵤䞩㮑䨐厒㓣殗餣㙝㹤䀷搚笚䶝㾎㷅炠譗拹䬊䲜㭘䛽䕛䧨㡋翈㗼笝㘝埉""",
    4,
    -17,
    19,
    106,
]
